{
  "verses": [
    {
      "id": 101,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "1",
      "sanskrit": "धृतराष्ट्र उवाच। धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः। मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय॥",
      "transliteration": "dhṛtarāṣṭra uvāca | dharma-kṣetre kuru-kṣetre samavetā yuyutsavaḥ | māmakāḥ pāṇḍavāś caiva kim akurvata sañjaya ||",
      "translation": "Dhritarashtra said: O Sanjaya, after my sons and the sons of Pandu assembled in the place of pilgrimage at Kurukshetra, desiring to fight, what did they do?",
      "teaching": "The opening verse sets the stage for the great dialogue. Kurukshetra represents both the external battlefield and the internal field of dharma where the battle between good and evil takes place within each person.",
      "category": "dharma",
      "relevance": 75
    },
    {
      "id": 102,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "2",
      "sanskrit": "सञ्जय उवाच। दृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा। आचार्यमुपसङ्गम्य राजा वचनमब्रवीत्॥",
      "transliteration": "sañjaya uvāca | dṛṣṭvā tu pāṇḍavānīkaṁ vyūḍhaṁ duryodhanas tadā | ācāryam upasaṅgamya rājā vacanam abravīt ||",
      "translation": "Sanjaya said: O King, after looking over the army arranged in military formation by the sons of Pandu, King Duryodhana went to his teacher and spoke the following words.",
      "teaching": "This verse shows how in times of crisis, even the proud seek guidance from their teachers. It highlights the importance of seeking counsel from experienced mentors.",
      "category": "dharma",
      "relevance": 70
    },
    {
      "id": 103,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "3",
      "sanskrit": "पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम्। व्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता॥",
      "transliteration": "paśyaitāṁ pāṇḍu-putrāṇām ācārya mahatīṁ camūm | vyūḍhāṁ drupada-putreṇa tava śiṣyeṇa dhīmatā ||",
      "translation": "O my teacher, behold the great army of the sons of Pandu, so expertly arranged by your intelligent disciple Dhrishtadyumna, the son of Drupada.",
      "teaching": "Duryodhana acknowledges the skill of his enemies, showing that wisdom recognizes merit even in opponents. This teaches us to respect competence regardless of personal conflicts.",
      "category": "dharma",
      "relevance": 72
    },
    {
      "id": 104,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "4",
      "sanskrit": "अत्र शूरा महेष्वासा भीमार्जुनसमा युधि। युयुधानो विराटश्च द्रुपदश्च महारथः॥",
      "transliteration": "atra śūrā maheṣvāsā bhīmārjuna-samā yudhi | yuyudhāno virāṭaś ca drupadaś ca mahā-rathaḥ ||",
      "translation": "Here in this army are many heroic bowmen equal in fighting to Bhima and Arjuna: great fighters like Yuyudhana, Virata and Drupada.",
      "teaching": "Recognition of strength in opponents is a mark of wisdom. Acknowledging others' abilities without diminishing our own confidence shows mature assessment.",
      "category": "dharma",
      "relevance": 73
    },
    {
      "id": 105,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "5",
      "sanskrit": "धृष्टकेतुश्चेकितानः काशिराजश्च वीर्यवान्। पुरुजित्कुन्तिभोजश्च शैब्यश्च नरपुङ्गवः॥",
      "transliteration": "dhṛṣṭaketuś cekitānaḥ kāśi-rājaś ca vīryavān | purujit kuntibhojaś ca śaibyaś ca nara-puṅgavaḥ ||",
      "translation": "There are also great heroic, powerful fighters like Dhrishtaketu, Chekitana, the valiant King of Kashi, Purujit, Kuntibhoja and Shaibya, who are all great among men.",
      "teaching": "Every army has its heroes and capable leaders. Recognizing and honoring the strengths of all participants shows respect for human potential and dignity.",
      "category": "dharma",
      "relevance": 72
    },
    {
      "id": 106,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "6",
      "sanskrit": "युधामन्युश्च विक्रान्त उत्तमौजाश्च वीर्यवान्। सौभद्रो द्रौपदेयाश्च सर्व एव महारथाः॥",
      "transliteration": "yudhāmanyuś ca vikrānta uttamaujāś ca vīryavān | saubhadro draupadeyāś ca sarva eva mahā-rathāḥ ||",
      "translation": "There are the mighty Yudhamanyu, the very powerful Uttamauja, the son of Subhadra and the sons of Draupadi. All these warriors are great chariot fighters.",
      "teaching": "The next generation of warriors represents the continuation of values and traditions. Each person brings their unique strengths to serve the greater cause.",
      "category": "dharma",
      "relevance": 73
    },
    {
      "id": 107,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "7",
      "sanskrit": "अस्माकं तु विशिष्टा ये तान्निबोध द्विजोत्तम। नायका मम सैन्यस्य संज्ञार्थं तान्ब्रवीमि ते॥",
      "transliteration": "asmākaṁ tu viśiṣṭā ye tān nibodha dvijottama | nāyakā mama sainyasya saṁjñārthaṁ tān bravīmi te ||",
      "translation": "But for your information, O best of the twice-born, let me tell you about the captains who are especially qualified to lead my military force.",
      "teaching": "Good leadership requires knowing your key people and their capabilities. Duryodhana demonstrates strategic thinking by identifying his strongest commanders.",
      "category": "dharma",
      "relevance": 74
    },
    {
      "id": 108,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "8",
      "sanskrit": "भवान्भीष्मश्च कर्णश्च कृपश्च समितिञ्जयः। अश्वत्थामा विकर्णश्च सौमदत्तिस्तथैव च॥",
      "transliteration": "bhavān bhīṣmaś ca karṇaś ca kṛpaś ca samitiñjayaḥ | aśvatthāmā vikarṇaś ca saumadattis tathaiva ca ||",
      "translation": "There are personalities like you, Bhishma, Karna, Kripa, Ashvatthama, Vikarna and the son of Somadatta, who are always victorious in battle.",
      "teaching": "Recognizing the strengths and capabilities of those around us, even opponents, shows wisdom and strategic thinking. Respect for worthy adversaries is a mark of nobility.",
      "category": "dharma",
      "relevance": 75
    },
    {
      "id": 109,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "9",
      "sanskrit": "अन्ये च बहवः शूरा मदर्थे त्यक्तजीविताः। नानाशस्त्रप्रहरणाः सर्वे युद्धविशारदाः॥",
      "transliteration": "anye ca bahavaḥ śūrā mad-arthe tyakta-jīvitāḥ | nānā-śastra-praharaṇāḥ sarve yuddha-viśāradāḥ ||",
      "translation": "There are many other heroes who are prepared to lay down their lives for my sake. All of them are well equipped with different kinds of weapons, and all are experienced in military science.",
      "teaching": "Loyalty and willingness to sacrifice for a cause shows the power of dedication. However, we must ensure the cause is worthy of such sacrifice.",
      "category": "dharma",
      "relevance": 74
    },
    {
      "id": 110,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "10",
      "sanskrit": "अपर्याप्तं तदस्माकं बलं भीष्माभिरक्षितम्। पर्याप्तं त्विदमेतेषां बलं भीमाभिरक्षितम्॥",
      "transliteration": "aparyāptaṁ tad asmākaṁ balaṁ bhīṣmābhirakṣitam | paryāptaṁ tv idam eteṣāṁ balaṁ bhīmābhirakṣitam ||",
      "translation": "Our strength is immeasurable, and we are perfectly protected by Grandfather Bhishma, whereas the strength of the Pandavas, carefully protected by Bhima, is limited.",
      "teaching": "Confidence in one's abilities and resources is important, but overconfidence can lead to downfall. True assessment requires honesty about both strengths and weaknesses.",
      "category": "dharma",
      "relevance": 75
    },
    {
      "id": 111,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "11",
      "sanskrit": "अयनेषु च सर्वेषु यथाभागमवस्थिताः। भीष्ममेवाभिरक्षन्तु भवन्तः सर्व एव हि॥",
      "transliteration": "ayaneṣu ca sarveṣu yathā-bhāgam avasthitāḥ | bhīṣmam evābhirakṣantu bhavantaḥ sarva eva hi ||",
      "translation": "All of you must now give full support to Grandfather Bhishma, as you stand at your respective strategic points of entrance into the phalanx of the army.",
      "teaching": "Unity of purpose and protecting key leadership are essential for any successful endeavor. Supporting those who lead with wisdom and experience strengthens the whole group.",
      "category": "dharma",
      "relevance": 76
    },
    {
      "id": 112,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "12",
      "sanskrit": "तस्य सञ्जनयन्हर्षं कुरुवृद्धः पितामहः। सिंहनादं विनद्योच्चैः शङ्खं दध्मौ प्रतापवान्॥",
      "transliteration": "tasya sañjanayan harṣaṁ kuru-vṛddhaḥ pitāmahaḥ | siṁha-nādaṁ vinadyoccaiḥ śaṅkhaṁ dadhmau pratāpavān ||",
      "translation": "Then Bhishma, the great valiant grandsire of the Kuru dynasty, the grandfather of the fighters, blew his conchshell very loudly, making a sound like the roar of a lion, giving Duryodhana joy.",
      "teaching": "Great leaders inspire confidence in their followers through their presence and actions. Bhishma's powerful conch call demonstrates how experienced leadership can boost morale in challenging times.",
      "category": "dharma",
      "relevance": 79
    },
    {
      "id": 113,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "13",
      "sanskrit": "ततः शङ्खाश्च भेर्यश्च पणवानकगोमुखाः। सहसैवाभ्यहन्यन्त स शब्दस्तुमुलोऽभवत्॥",
      "transliteration": "tataḥ śaṅkhāś ca bheryaś ca paṇavānaka-gomukhāḥ | sahasaivābhyahanyanta sa śabdas tumulo 'bhavat ||",
      "translation": "After that, the conchshells, drums, bugles, trumpets and horns were all suddenly sounded, and the combined sound was tumultuous.",
      "teaching": "The crescendo of battle sounds represents the moment when peaceful resolution gives way to conflict. Sometimes life forces us into situations where action becomes unavoidable.",
      "category": "dharma",
      "relevance": 77
    },
    {
      "id": 114,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "14",
      "sanskrit": "ततः श्वेतैर्हयैर्युक्ते महति स्यन्दने स्थितौ। माधवः पाण्डवश्चैव दिव्यौ शङ्खौ प्रदध्मतुः॥",
      "transliteration": "tataḥ śvetair hayair yukte mahati syandane sthitau | mādhavaḥ pāṇḍavaś caiva divyau śaṅkhau pradadhmatuḥ ||",
      "translation": "Then, seated in a great chariot drawn by white horses, both Madhava (Krishna) and the son of Pandu (Arjuna) blew their transcendental conchshells.",
      "teaching": "The partnership between Krishna and Arjuna represents the ideal relationship between the divine and the devotee, working together in righteous action.",
      "category": "devotion",
      "relevance": 82
    },
    {
      "id": 115,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "15",
      "sanskrit": "पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जयः। पौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदरः॥",
      "transliteration": "pāñcajanyaṁ hṛṣīkeśo devadattaṁ dhanañjayaḥ | pauṇḍraṁ dadhmau mahā-śaṅkhaṁ bhīma-karmā vṛkodaraḥ ||",
      "translation": "Lord Krishna blew His conchshell Panchajanya; Arjuna blew his, called Devadatta; and Bhima the terrible blew his great shell called Paundra.",
      "teaching": "The divine sound of conchshells represents the call to righteous action. When we align with dharma, even our preparations become sacred and announce the victory of good over evil.",
      "category": "dharma",
      "relevance": 95
    },
    {
      "id": 116,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "16",
      "sanskrit": "अनन्तविजयं राजा कुन्तीपुत्रो युधिष्ठिरः। नकुलः सहदेवश्च सुघोषमणिपुष्पकौ॥",
      "transliteration": "ananta-vijayaṁ rājā kuntī-putro yudhiṣṭhiraḥ | nakulaḥ sahadevaś ca sughoṣa-maṇipuṣpakau ||",
      "translation": "King Yudhishthira, the son of Kunti, blew his conchshell, the Ananta-vijaya, and Nakula and Sahadeva blew the Sughosa and Manipuspaka.",
      "teaching": "Each warrior has their unique role and contribution. The different named conchshells represent the diverse ways righteous people serve the cause of dharma.",
      "category": "dharma",
      "relevance": 76
    },
    {
      "id": 117,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "17",
      "sanskrit": "काश्यश्च परमेष्वासः शिखण्डी च महारथः। धृष्टद्युम्नो विराटश्च सात्यकिश्चापराजितः॥",
      "transliteration": "kāśyaś ca parameṣvāsaḥ śikhaṇḍī ca mahā-rathaḥ | dhṛṣṭadyumno virāṭaś ca sātyakiś cāparājitaḥ ||",
      "translation": "The King of Kashi, the great archer, Shikhandi, the mighty chariot-fighter, Dhrishtadyumna, Virata, and Satyaki, the unconquerable.",
      "teaching": "Every side in a conflict has capable and noble people. Recognizing the worth and abilities of all participants helps us understand that conflicts often involve good people on different sides.",
      "category": "dharma",
      "relevance": 74
    },
    {
      "id": 118,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "18",
      "sanskrit": "द्रुपदो द्रौपदेयाश्च सर्वशः पृथिवीपते। सौभद्रश्च महाबाहुः शङ्खान्दध्मुः पृथक्पृथक्॥",
      "transliteration": "drupado draupadeyāś ca sarvaśaḥ pṛthivī-pate | saubhadraś ca mahā-bāhuḥ śaṅkhān dadhmuḥ pṛthak pṛthak ||",
      "translation": "King Drupada, the sons of Draupadi, and others, O King, such as the mighty-armed son of Subhadra, all blew their respective conchshells.",
      "teaching": "Each person has their own voice and contribution to make. The individual conchshells represent how unity comes from many distinct voices joining together for a common purpose.",
      "category": "dharma",
      "relevance": 76
    },
    {
      "id": 119,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "19",
      "sanskrit": "स घोषो धार्तराष्ट्राणां हृदयानि व्यदारयत्। नभश्च पृथिवीं चैव तुमुलो व्यनुनादयन्॥",
      "transliteration": "sa ghoṣo dhārtarāṣṭrāṇāṁ hṛdayāni vyadārayat | nabhaś ca pṛthivīṁ caiva tumulo vyanunādayan ||",
      "translation": "The blowing of these different conchshells became uproarious. Vibrating both in the sky and on the earth, it shattered the hearts of the sons of Dhritarashtra.",
      "teaching": "The sound of righteous determination can shake the confidence of those who know they are in the wrong. Truth has a power that affects even those who oppose it.",
      "category": "dharma",
      "relevance": 78
    },
    {
      "id": 120,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "20",
      "sanskrit": "अथ व्यवस्थितान्दृष्ट्वा धार्तराष्ट्रान्कपिध्वजः। प्रवृत्ते शस्त्रसम्पाते धनुरुद्यम्य पाण्डवः॥",
      "transliteration": "atha vyavasthitān dṛṣṭvā dhārtarāṣṭrān kapi-dhvajaḥ | pravṛtte śastra-sampāte dhanur udyamya pāṇḍavaḥ ||",
      "translation": "At that time Arjuna, the son of Pandu, seated in the chariot bearing the flag marked with Hanuman, took up his bow and prepared to shoot his arrows.",
      "teaching": "The moment of truth arrives when preparation meets action. Hanuman's flag symbolizes devotion and strength, showing the spiritual foundation needed for righteous action.",
      "category": "dharma",
      "relevance": 77
    },
    {
      "id": 121,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "21",
      "sanskrit": "अर्जुन उवाच। सेनयोरुभयोर्मध्ये रथं स्थापय मेऽच्युत। यावदेतान्निरीक्षेऽहं योद्धुकामानवस्थितान्॥",
      "transliteration": "arjuna uvāca | senayor ubhayor madhye rathaṁ sthāpaya me 'cyuta | yāvad etān nirīkṣe 'haṁ yoddhu-kāmān avasthitān ||",
      "translation": "Arjuna said: O infallible one, please place my chariot between the two armies so that I may see those present here, who desire to fight.",
      "teaching": "Sometimes we need to pause and assess a situation fully before acting. Taking time to understand what we're facing is a sign of wisdom, not weakness.",
      "category": "self-development",
      "relevance": 76
    },
    {
      "id": 122,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "22",
      "sanskrit": "यावदेतान्निरीक्षेऽहं योद्धुकामानवस्थितान्। कैर्मया सह योद्धव्यमस्मिन्रणसमुद्यमे॥",
      "transliteration": "yāvad etān nirīkṣe 'haṁ yoddhu-kāmān avasthitān | kair mayā saha yoddhavyam asmin raṇa-samudyame ||",
      "translation": "Let me see those who have come here to fight, wishing to please the evil-minded son of Dhritarashtra in this venture of war.",
      "teaching": "Before engaging in any difficult endeavor, it's wise to understand exactly what and whom you're facing. Clear assessment prevents being overwhelmed by the magnitude of challenges.",
      "category": "self-development",
      "relevance": 78
    },
    {
      "id": 123,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "23",
      "sanskrit": "योत्स्यमानानवेक्षेऽहं य एतेऽत्र समागताः। धार्तराष्ट्रस्य दुर्बुद्धेर्युद्धे प्रियचिकीर्षवः॥",
      "transliteration": "yotsyamānān avekṣe 'haṁ ya ete 'tra samāgatāḥ | dhārtarāṣṭrasya durbuddher yuddhe priya-cikīrṣavaḥ ||",
      "translation": "Let me observe the warriors who have assembled here, ready to fight and seeking to gratify the evil-minded Duryodhana by engaging in this battle.",
      "teaching": "Understanding the motivations behind conflicts helps us see clearly. Many people get drawn into disputes not from personal conviction but from loyalty to misguided leadership.",
      "category": "psychology",
      "relevance": 79
    },
    {
      "id": 124,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "24",
      "sanskrit": "एवमुक्तो हृषीकेशो गुडाकेशेन भारत। सेनयोरुभयोर्मध्ये स्थापयित्वा रथोत्तमम्॥",
      "transliteration": "evam ukto hṛṣīkeśo guḍākeśena bhārata | senayor ubhayor madhye sthāpayitvā rathottamam ||",
      "translation": "O descendant of Bharata, having thus been addressed by Arjuna, Lord Krishna drew up the fine chariot in the midst of the armies of both parties.",
      "teaching": "Krishna immediately responds to Arjuna's request, showing how the divine is always ready to help when we ask with sincerity. Good guidance comes from positioning ourselves to see clearly.",
      "category": "devotion",
      "relevance": 78
    },
    {
      "id": 125,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "25",
      "sanskrit": "भीष्मद्रोणप्रमुखतः सर्वेषां च महीक्षिताम्। उवाच पार्थ पश्यैतान्समवेतान्कुरूनिति॥",
      "transliteration": "bhīṣma-droṇa-pramukhataḥ sarveṣāṁ ca mahīkṣitām | uvāca pārtha paśyaitān samavetān kurūn iti ||",
      "translation": "In the presence of Bhishma, Drona and all the other chieftains of the world, the Lord said: Just behold, Partha, all the Kurus assembled here.",
      "teaching": "Sometimes we need to face our challenges directly and see them clearly. Krishna helps Arjuna confront the full reality of his situation before offering guidance.",
      "category": "self-development",
      "relevance": 80
    },
    {
      "id": 126,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "26",
      "sanskrit": "तत्रापश्यत्स्थितान्पार्थः पितॄनथ पितामहान्। आचार्यान्मातुलान्भ्रातॄन्पुत्रान्पौत्रान्सखींस्तथा॥",
      "transliteration": "tatrāpaśyat sthitān pārthaḥ pitṝn atha pitāmahān | ācāryān mātulān bhrātṝn putrān pautrān sakhīṁs tathā ||",
      "translation": "There Arjuna could see, within the midst of the armies of both parties, his fathers, grandfathers, teachers, maternal uncles, brothers, sons, grandsons, friends.",
      "teaching": "Seeing familiar faces in opposition creates deep emotional conflict. This moment represents how life often puts us in situations where duty conflicts with personal attachment.",
      "category": "psychology",
      "relevance": 85
    },
    {
      "id": 127,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "27",
      "sanskrit": "श्वशुरान्सुहृदश्चैव सेनयोरुभयोरपि। तान्समीक्ष्य स कौन्तेयः सर्वान्बन्धूनवस्थितान्॥",
      "transliteration": "śvaśurān suhṛdaś caiva senayor ubhayor api | tān samīkṣya sa kaunteyaḥ sarvān bandhūn avasthitān ||",
      "translation": "When the son of Kunti, Arjuna, saw all these different grades of friends and relatives, he became overwhelmed with compassion.",
      "teaching": "Seeing loved ones in opposition creates profound emotional conflict. True compassion sometimes makes action more difficult, but it also ensures our actions come from a place of love rather than hatred.",
      "category": "psychology",
      "relevance": 84
    },
    {
      "id": 128,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "28",
      "sanskrit": "अर्जुन उवाच। दृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम्। सीदन्ति मम गात्राणि मुखं च परिशुष्यति॥",
      "transliteration": "arjuna uvāca | dṛṣṭvemaṁ sva-janaṁ kṛṣṇa yuyutsuṁ samupasthitam | sīdanti mama gātrāṇi mukhaṁ ca pariśuṣyati ||",
      "translation": "Arjuna said: My dear Krishna, seeing my friends and relatives present before me in such a fighting spirit, I feel the limbs of my body quivering and my mouth drying up.",
      "teaching": "Physical symptoms often reflect mental and spiritual conflicts. Our body responds to moral dilemmas, showing the deep connection between conscience and physical well-being.",
      "category": "psychology",
      "relevance": 85
    },
    {
      "id": 129,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "29",
      "sanskrit": "वेपथुश्च शरीरे मे रोमहर्षश्च जायते। गाण्डीवं स्रंसते हस्तात्त्वक्चैव परिदह्यते॥",
      "transliteration": "vepathuś ca śarīre me romaharṣaś ca jāyate | gāṇḍīvaṁ sraṁsate hastāt tvak caiva paridahyate ||",
      "translation": "My whole body is trembling, my hair is standing on end, my bow Gandiva is slipping from my hand, and my skin is burning.",
      "teaching": "Physical symptoms often reflect inner spiritual and moral conflicts. The body naturally responds when the heart is in turmoil about right and wrong action.",
      "category": "psychology",
      "relevance": 83
    },
    {
      "id": 130,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "30",
      "sanskrit": "न च शक्नोम्यवस्थातुं भ्रमतीव च मे मनः। निमित्तानि च पश्यामि विपरीतानि केशव॥",
      "transliteration": "na ca śaknomy avasthātuṁ bhramatīva ca me manaḥ | nimittāni ca paśyāmi viparītāni keśava ||",
      "translation": "I am now unable to stand here any longer. I am forgetting myself, and my mind is reeling. I see only causes of misfortune, O Keshava.",
      "teaching": "When overwhelmed by moral conflict, the mind loses its stability and clarity. Arjuna's confusion shows how ethical dilemmas can shake even the strongest person's foundation.",
      "category": "psychology",
      "relevance": 86
    },
    {
      "id": 131,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "31",
      "sanskrit": "न च श्रेयोऽनुपश्यामि हत्वा स्वजनमाहवे। न काङ्क्षे विजयं कृष्ण न च राज्यं सुखानि च॥",
      "transliteration": "na ca śreyo 'nupaśyāmi hatvā sva-janam āhave | na kāṅkṣe vijayaṁ kṛṣṇa na ca rājyaṁ sukhāni ca ||",
      "translation": "I can find no good in killing my own kinsmen in battle, nor can I, my dear Krishna, desire any subsequent victory, kingdom, or happiness.",
      "teaching": "When personal relationships conflict with duty, we may question whether any gain is worth the cost. This moral sensitivity shows the depth of Arjuna's character.",
      "category": "psychology",
      "relevance": 82
    },
    {
      "id": 132,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "32",
      "sanskrit": "किं नो राज्येन गोविन्द किं भोगैर्जीवितेन वा। येषामर्थे काङ्क्षितं नो राज्यं भोगाः सुखानि च॥",
      "transliteration": "kiṁ no rājyena govinda kiṁ bhogair jīvitena vā | yeṣām arthe kāṅkṣitaṁ no rājyaṁ bhogāḥ sukhāni ca ||",
      "translation": "O Govinda, of what avail to us are a kingdom, happiness or even life itself when all those for whom we may desire them are now arrayed on this battlefield?",
      "teaching": "Material gains lose all meaning when achieved at the cost of those we love. True happiness comes from relationships and shared joy, not individual success.",
      "category": "psychology",
      "relevance": 84
    },
    {
      "id": 133,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "33",
      "sanskrit": "त इमे समवेता युद्धे प्राणांस्त्यक्त्वा धनानि च। येषामर्थे काङ्क्षितं नो राज्यं भोगाः सुखानि च॥",
      "transliteration": "ta ime samavetā yuddhe prāṇāṁs tyaktvā dhanāni ca | yeṣām arthe kāṅkṣitaṁ no rājyaṁ bhogāḥ sukhāni ca ||",
      "translation": "All these persons are assembled here on this battlefield, giving up their lives and riches, for whom we had desired to enjoy a kingdom, material happiness and pleasures.",
      "teaching": "The very people for whose happiness we strive are often the ones who suffer from our ambitions. True success should benefit those we care about, not harm them.",
      "category": "psychology",
      "relevance": 82
    },
    {
      "id": 134,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "34",
      "sanskrit": "आचार्याः पितरः पुत्रास्तथैव च पितामहाः। मातुलाः श्वशुराः पौत्राः श्यालाः सम्बन्धिनस्तथा॥",
      "transliteration": "ācāryāḥ pitaraḥ putrās tathaiva ca pitāmahāḥ | mātulāḥ śvaśurāḥ pautrāḥ śyālāḥ sambandhinas tathā ||",
      "translation": "Here I see teachers, fathers, sons, grandfathers, maternal uncles, fathers-in-law, grandsons, brothers-in-law and other relatives.",
      "teaching": "Family relationships create a web of emotional connections that complicate moral decisions. The comprehensive list shows how conflict affects entire social networks, not just individuals.",
      "category": "psychology",
      "relevance": 80
    },
    {
      "id": 135,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "35",
      "sanskrit": "न काङ्क्षे विजयं कृष्ण न च राज्यं सुखानि च। किं नो राज्येन गोविन्द किं भोगैर्जीवितेन वा॥",
      "transliteration": "na kāṅkṣe vijayaṁ kṛṣṇa na ca rājyaṁ sukhāni ca | kiṁ no rājyena govinda kiṁ bhogair jīvitena vā ||",
      "translation": "I do not wish for victory, O Krishna, nor kingdom nor pleasures. Of what avail to us are a kingdom, happiness or even life, O Govinda?",
      "teaching": "When relationships are at stake, material gains lose their meaning. Arjuna's renunciation of worldly desires shows how love and duty can conflict, leading to spiritual crisis.",
      "category": "psychology",
      "relevance": 84
    },
    {
      "id": 136,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "36",
      "sanskrit": "निहत्य धार्तराष्ट्रान्नः का प्रीतिः स्याज्जनार्दन। पापमेवाश्रयेदस्मान्हत्वैतानाततायिनः॥",
      "transliteration": "nihatya dhārtarāṣṭrān naḥ kā prītiḥ syāj janārdana | pāpam evāśrayed asmān hatvaitān ātatāyinaḥ ||",
      "translation": "O Janardana, what pleasure can we derive from killing the sons of Dhritarashtra? Sin will overcome us if we slay such aggressors.",
      "teaching": "Arjuna grapples with whether violence, even in self-defense, brings spiritual consequence. This reflects the deep moral questioning that leads to spiritual growth.",
      "category": "dharma",
      "relevance": 83
    },
    {
      "id": 137,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "37",
      "sanskrit": "यद्यप्येते न पश्यन्ति लोभोपहतचेतसः। कुलक्षयकृतं दोषं मित्रद्रोहे च पातकम्॥",
      "transliteration": "yady apy ete na paśyanti lobhopahata-cetasaḥ | kula-kṣaya-kṛtaṁ doṣaṁ mitra-drohe ca pātakam ||",
      "translation": "Although these men, their hearts overtaken by greed, see no fault in killing one's family or quarreling with friends, why should we, who can see the crime in destroying a family, engage in these acts of sin?",
      "teaching": "Just because others cannot see the moral consequences of their actions doesn't mean we should follow suit. Higher consciousness means taking responsibility even when others don't.",
      "category": "dharma",
      "relevance": 87
    },
    {
      "id": 138,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "38",
      "sanskrit": "कथं न ज्ञेयमस्माभिः पापादस्मान्निवर्तितुम्। कुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन॥",
      "transliteration": "kathaṁ na jñeyam asmābhiḥ pāpād asmān nivartitum | kula-kṣaya-kṛtaṁ doṣaṁ prapaśyadbhir janārdana ||",
      "translation": "O Janardana, although these men see no fault in destroying the family or betraying friends, why should we, who can clearly see the fault in this destruction of a family, not turn away from this sinful act?",
      "teaching": "Moral clarity brings responsibility. When we can see the consequences of actions clearly, we have a duty to choose the path that prevents harm, even if it's difficult.",
      "category": "dharma",
      "relevance": 85
    },
    {
      "id": 139,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "39",
      "sanskrit": "कथं न ज्ञेयमस्माभिः पापादस्मान्निवर्तितुम्। कुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन॥",
      "transliteration": "kathaṁ na jñeyam asmābhiḥ pāpād asmān nivartitum | kula-kṣaya-kṛtaṁ doṣaṁ prapaśyadbhir janārdana ||",
      "translation": "O Janardana, although these men see no fault in destroying the family or betraying friends, why should we, who can clearly see the fault in this destruction, not turn away from this sin?",
      "teaching": "Having moral clarity brings the responsibility to act according to that understanding. We cannot use others' blindness as an excuse for our own wrong actions.",
      "category": "dharma",
      "relevance": 86
    },
    {
      "id": 140,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "40",
      "sanskrit": "अधर्माभिभवात्कृष्ण प्रदुष्यन्ति कुलस्त्रियः। स्त्रीषु दुष्टासु वार्ष्णेय जायते वर्णसङ्करः॥",
      "transliteration": "adharmābhibhavāt kṛṣṇa praduṣyanti kula-striyaḥ | strīṣu duṣṭāsu vārṣṇeya jāyate varṇa-saṅkaraḥ ||",
      "translation": "When irreligion is prominent in the family, O Krishna, the women of the family become polluted, and from the degradation of womanhood, O descendant of Vrishni, comes unwanted progeny.",
      "teaching": "Arjuna expresses concern about social breakdown following war. His worry shows how individual actions can have far-reaching consequences on society and future generations.",
      "category": "dharma",
      "relevance": 74
    },
    {
      "id": 141,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "41",
      "sanskrit": "सङ्करो नरकायैव कुलघ्नानां कुलस्य च। पतन्ति पितरो ह्येषां लुप्तपिण्डोदकक्रियाः॥",
      "transliteration": "saṅkaro narakāyaiva kula-ghnānāṁ kulasya ca | patanti pitaro hy eṣāṁ lupta-piṇḍodaka-kriyāḥ ||",
      "translation": "An increase of unwanted population certainly causes hellish life both for the family and for those who destroy the family tradition. The ancestors of such corrupt families fall down, because the performances for their benefit are entirely stopped.",
      "teaching": "Actions have consequences that extend beyond the immediate participants to affect future generations and even ancestral obligations. Social responsibility includes considering long-term effects.",
      "category": "dharma",
      "relevance": 78
    },
    {
      "id": 142,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "42",
      "sanskrit": "उत्साद्यन्ते जातिधर्माः कुलधर्माश्च शाश्वताः। धर्मे नष्टे कुलं कृत्स्नं प्रणश्यतीत्यनुशुश्रुम॥",
      "transliteration": "utsādyante jāti-dharmāḥ kula-dharmāś ca śāśvatāḥ | dharme naṣṭe kulaṁ kṛtsnaṁ praṇaśyatīty anuśuśruma ||",
      "translation": "When the social and family welfare activities are devastated and family traditions are destroyed, we have heard that the remaining members of the family become involved in irreligious practice.",
      "teaching": "Social institutions and family traditions provide structure and guidance for ethical behavior. When these break down, it becomes harder for people to maintain moral standards.",
      "category": "dharma",
      "relevance": 77
    },
    {
      "id": 143,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "43",
      "sanskrit": "दोषैरेतैः कुलघ्नानां वर्णसङ्करकारकैः। उत्साद्यन्ते जातिधर्माः कुलधर्माश्च शाश्वताः॥",
      "transliteration": "doṣair etaiḥ kula-ghnānāṁ varṇa-saṅkara-kārakaiḥ | utsādyante jāti-dharmāḥ kula-dharmāś ca śāśvatāḥ ||",
      "translation": "By the evil deeds of those who destroy the family tradition and thus give rise to unwanted children, all kinds of community projects and family welfare activities are devastated.",
      "teaching": "Individual actions have far-reaching social consequences. When family and community structures break down, it affects the welfare systems that support society as a whole.",
      "category": "dharma",
      "relevance": 76
    },
    {
      "id": 144,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "44",
      "sanskrit": "उत्सन्नकुलधर्माणां मनुष्याणां जनार्दन। नरकेऽनियतं वासो भवतीत्यनुशुश्रुम॥",
      "transliteration": "utsanna-kula-dharmāṇāṁ manuṣyāṇāṁ janārdana | narake 'niyataṁ vāso bhavatīty anuśuśruma ||",
      "translation": "O Janardana, we have heard from learned authorities that those who destroy family traditions dwell always in hell.",
      "teaching": "Actions that break down social and family structures are considered to have severe consequences, both in this life and beyond. This reflects the importance of maintaining systems that support community welfare.",
      "category": "dharma",
      "relevance": 78
    },
    {
      "id": 145,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "45",
      "sanskrit": "अहो बत महत्पापं कर्तुं व्यवसिता वयम्। यद्राज्यसुखलोभेन हन्तुं स्वजनमुद्यताः॥",
      "transliteration": "aho bata mahat pāpaṁ kartuṁ vyavasitā vayam | yad rājya-sukha-lobhena hantuṁ sva-janam udyatāḥ ||",
      "translation": "Alas, how strange it is that we are preparing to commit greatly sinful acts. Driven by the desire to enjoy royal happiness, we are intent on killing our own kinsmen.",
      "teaching": "Self-reflection reveals how ambition can lead us toward actions that contradict our deepest values. Recognizing this contradiction is the first step toward finding a better path.",
      "category": "psychology",
      "relevance": 88
    },
    {
      "id": 146,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "46",
      "sanskrit": "यदि मामप्रतीकारमशस्त्रं शस्त्रपाणयः। धार्तराष्ट्रा रणे हन्युस्तन्मे क्षेमतरं भवेत्॥",
      "transliteration": "yadi mām apratīkāram aśastraṁ śastra-pāṇayaḥ | dhārtarāṣṭrā raṇe hanyus tan me kṣema-taraṁ bhavet ||",
      "translation": "It would be better for me if the sons of Dhritarashtra, with weapons in hand, were to kill me unarmed and unresisting on the battlefield.",
      "teaching": "Sometimes the pain of action seems worse than the pain of inaction, even when inaction might lead to death. This represents the depth of Arjuna's moral crisis and sets the stage for divine guidance.",
      "category": "psychology",
      "relevance": 87
    },
    {
      "id": 147,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "47",
      "sanskrit": "एवमुक्त्वार्जुनः सङ्ख्ये रथोपस्थ उपाविशत्। विसृज्य सशरं चापं शोकसंविग्नमानसः॥",
      "transliteration": "evam uktvārjunaḥ saṅkhye rathopastha upāviśat | visṛjya sa-śaraṁ cāpaṁ śoka-saṁvigna-mānasaḥ ||",
      "translation": "Arjuna, having thus spoken on the battlefield, cast aside his bow and arrows and sat down on the chariot, his mind overwhelmed with grief.",
      "teaching": "This verse shows the climax of Arjuna's crisis. Sometimes we must reach the depths of confusion before we can receive divine guidance. It sets the stage for Krishna's teachings.",
      "category": "psychology",
      "relevance": 90
    },
    {
      "id": 201,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "1",
      "sanskrit": "सञ्जय उवाच। तं तथा कृपयाविष्टमश्रुपूर्णाकुलेक्षणम्। विषीदन्तमिदं वाक्यमुवाच मधुसूदनः॥",
      "transliteration": "sañjaya uvāca | taṁ tathā kṛpayāviṣṭam aśru-pūrṇākulekṣaṇam | viṣīdantam idaṁ vākyam uvāca madhusūdanaḥ ||",
      "translation": "Sanjaya said: Seeing Arjuna full of compassion, his mind depressed, his eyes full of tears, Madhusudana, Krishna, spoke the following words.",
      "teaching": "Krishna responds to Arjuna's emotional crisis with wisdom. This shows that divine guidance comes when we are most receptive, often in our moments of greatest need.",
      "category": "psychology",
      "relevance": 85
    },
    {
      "id": 202,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "2",
      "sanskrit": "श्रीभगवानुवाच। कुतस्त्वा कश्मलमिदं विषमे समुपस्थितम्। अनार्यजुष्टमस्वर्ग्यमकीर्तिकरमर्जुन॥",
      "transliteration": "śrī-bhagavān uvāca | kutas tvā kaśmalam idaṁ viṣame samupasthitam | anārya-juṣṭam asvargyam akīrti-karam arjuna ||",
      "translation": "The Supreme Personality of Godhead said: My dear Arjuna, how have these impurities come upon you? They are not at all befitting a man who knows the value of life. They lead not to higher planets but to infamy.",
      "teaching": "Krishna challenges Arjuna's despondency, calling it 'impurity' that doesn't befit a noble person. Sometimes we need direct confrontation with our weaknesses to move forward.",
      "category": "self-development",
      "relevance": 80
    },
    {
      "id": 203,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "3",
      "sanskrit": "क्लैब्यं मा स्म गमः पार्थ नैतत्त्वय्युपपद्यते। क्षुद्रं हृदयदौर्बल्यं त्यक्त्वोत्तिष्ठ परन्तप॥",
      "transliteration": "klaibyaṁ mā sma gamaḥ pārtha naitat tvayy upapadyate | kṣudraṁ hṛdaya-daurbalyaṁ tyaktvottiṣṭha parantapa ||",
      "translation": "O son of Pritha, do not yield to this degrading impotence. It does not become you. Give up such petty weakness of heart and arise, O chastiser of the enemy!",
      "teaching": "Krishna calls for courage and action over despair. True strength comes from rising above emotional weakness and taking appropriate action despite difficulties.",
      "category": "self-development",
      "relevance": 88
    },
    {
      "id": 204,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "4",
      "sanskrit": "अर्जुन उवाच। कथं भीष्ममहं सङ्ख्ये द्रोणं च मधुसूदन। इषुभिः प्रतियोत्स्यामि पूजार्हावरिसूदन॥",
      "transliteration": "arjuna uvāca | kathaṁ bhīṣmam ahaṁ saṅkhye droṇaṁ ca madhusūdana | iṣubhiḥ pratiyotsyāmi pūjārhāv arisūdana ||",
      "translation": "Arjuna said: O Madhusudana, how can I counterattack with arrows in battle men like Bhishma and Drona, who are worthy of my worship?",
      "teaching": "The conflict between personal respect and duty creates deep moral anguish. Sometimes life demands actions that seem to contradict our deepest values and relationships.",
      "category": "psychology",
      "relevance": 84
    },
    {
      "id": 205,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "5",
      "sanskrit": "गुरूनहत्वा हि महानुभावान्श्रेयो भोक्तुं भैक्ष्यमपीह लोके। हत्वार्थकामांस्तु गुरूनिहैव भुञ्जीय भोगान्रुधिरप्रदिग्धान्॥",
      "transliteration": "gurūn ahatvā hi mahānubhāvān śreyo bhoktuṁ bhaikṣyam apīha loke | hatvārtha-kāmāṁs tu gurūn ihaiva bhuñjīya bhogān rudhira-pradigdhān ||",
      "translation": "It would be better to live in this world by begging than to live at the cost of the lives of great souls who are my teachers. Though they are avaricious, they are nonetheless superiors. If they are killed, everything we enjoy will be tainted with blood.",
      "teaching": "Arjuna values his teachers above material gain. True respect for mentors means not harming them even when they oppose us. Some victories come at too high a moral cost.",
      "category": "dharma",
      "relevance": 86
    },
    {
      "id": 206,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "6",
      "sanskrit": "न चैतद्विद्मः कतरन्नो गरीयो यद्वा जयेम यदि वा नो जयेयुः। यानेव हत्वा न जिजीविषामस्ते वस्थिताः प्रमुखे धार्तराष्ट्राः॥",
      "transliteration": "na caitad vidmaḥ kataran no garīyo yad vā jayema yadi vā no jayeyuḥ | yān eva hatvā na jijīviṣāmas te 'vasthitāḥ pramukhe dhārtarāṣṭrāḥ ||",
      "translation": "Nor can we tell which would be better—conquering them or being conquered by them. If we killed the sons of Dhritarashtra, we would not want to live.",
      "teaching": "Some situations present no clear winning option. When all choices lead to suffering, we need wisdom beyond ordinary calculation to find the right path.",
      "category": "psychology",
      "relevance": 88
    },
    {
      "id": 207,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "7",
      "sanskrit": "कार्पण्यदोषोपहतस्वभावः पृच्छामि त्वां धर्मसम्मूढचेताः। यच्छ्रेयः स्यान्निश्चितं ब्रूहि तन्मे शिष्यस्तेऽहं शाधि मां त्वां प्रपन्नम्॥",
      "transliteration": "kārpaṇya-doṣopahata-svabhāvaḥ pṛcchāmi tvāṁ dharma-sammūḍha-cetāḥ | yac chreyaḥ syān niścitaṁ brūhi tan me śiṣyas te 'haṁ śādhi māṁ tvāṁ prapannam ||",
      "translation": "In pity lost, by doubtings tossed, my thoughts—distracted—turn to Thee, the Guide I reverence most, that I may counsel learn: I know not what would heal the grief burned into soul and sense, if I were earth's unchallenged chief—a god—and these gone thence!",
      "teaching": "Arjuna surrenders to Krishna as his spiritual teacher, acknowledging his confusion about dharma. True learning begins with humility and the recognition that we need guidance from those wiser than ourselves.",
      "category": "surrender",
      "relevance": 89
    },
    {
      "id": 208,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "8",
      "sanskrit": "न हि प्रपश्यामि ममापनुद्यात्यच्छोकमुच्छोषणमिन्द्रियाणाम्। अवाप्य भूमावसपत्नमृद्धं राज्यं सुराणामपि चाधिपत्यम्॥",
      "transliteration": "na hi prapaśyāmi mamāpanudyād yac chokam ucchoṣaṇam indriyāṇām | avāpya bhūmāv asapatnam ṛddhaṁ rājyaṁ surāṇām api cādhipatyam ||",
      "translation": "I can find no means to drive away this grief which is drying up my senses. I will not be able to dispel it even if I win a prosperous, unrivaled kingdom on earth with sovereignty like that of the gods in heaven.",
      "teaching": "Material success cannot heal spiritual wounds. When our conscience is troubled, external achievements feel meaningless. True peace must be found within.",
      "category": "psychology",
      "relevance": 89
    },
    {
      "id": 209,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "9",
      "sanskrit": "सञ्जय उवाच। एवमुक्त्वा हृषीकेशं गुडाकेशः परन्तप। न योत्स्य इति गोविन्दमुक्त्वा तूष्णीं बभूव ह॥",
      "transliteration": "sañjaya uvāca | evam uktvā hṛṣīkeśaṁ guḍākeśaḥ parantapa | na yotsya iti govindam uktvā tūṣṇīṁ babhūva ha ||",
      "translation": "Sanjaya said: Having spoken thus, Arjuna, chastiser of enemies, told Govinda, 'I will not fight,' and fell silent.",
      "teaching": "Sometimes we reach a point of complete decision - right or wrong. Arjuna's definitive refusal shows he has moved from confusion to a firm (though misguided) resolve.",
      "category": "psychology",
      "relevance": 85
    },
    {
      "id": 210,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "10",
      "sanskrit": "तमुवाच हृषीकेशः प्रहसन्निव भारत। सेनयोरुभयोर्मध्ये विषीदन्तमिदं वचः॥",
      "transliteration": "tam uvāca hṛṣīkeśaḥ prahasann iva bhārata | senayor ubhayor madhye viṣīdantam idaṁ vacaḥ ||",
      "translation": "O descendant of Bharata, at that time Krishna, smiling, in the midst of both the armies, spoke the following words to the grief-stricken Arjuna.",
      "teaching": "Krishna's smile suggests compassionate understanding rather than mockery. A true teacher remains calm and even joyful when guiding someone through their darkest moments.",
      "category": "devotion",
      "relevance": 84
    },
    {
      "id": 211,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "11",
      "sanskrit": "अशोच्यानन्वशोचस्त्वं प्रज्ञावादांश्च भाषसे। गतासूनगतासूंश्च नानुशोचन्ति पण्डिताः॥",
      "transliteration": "aśocyān anvaśocas tvaṁ prajñā-vādāṁś ca bhāṣase | gatāsūn agatāsūṁś ca nānuśocanti paṇḍitāḥ ||",
      "translation": "Thou grievest where no grief should be! thou speak'st words lacking wisdom! for the wise in heart mourn not for those that live, nor those that die.",
      "teaching": "True wisdom lies in understanding the eternal nature of the soul. The wise do not grieve for the temporary changes of the body, knowing the soul is imperishable.",
      "category": "wisdom",
      "relevance": 95
    },
    {
      "id": 212,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "12",
      "sanskrit": "न त्वेवाहं जातु नासं न त्वं नेमे जनाधिपाः। न चैव न भविष्यामः सर्वे वयमतः परम्॥",
      "transliteration": "na tv evāhaṁ jātu nāsaṁ na tvaṁ neme janādhipāḥ | na caiva na bhaviṣyāmaḥ sarve vayam ataḥ param ||",
      "translation": "Nor I, nor thou, nor any one of these, ever was not, nor ever will not be, for ever and for ever afterwards.",
      "teaching": "The soul is eternal - it has no beginning and no end. This fundamental truth about our divine nature should eliminate fear of death and attachment to the temporary body.",
      "category": "philosophy",
      "relevance": 98
    },
    {
      "id": 213,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "13",
      "sanskrit": "देहिनोऽस्मिन्यथा देहे कौमारं यौवनं जरा। तथा देहान्तरप्राप्तिर्धीरस्तत्र न मुह्यति॥",
      "transliteration": "dehino 'smin yathā dehe kaumāraṁ yauvanaṁ jarā | tathā dehāntara-prāptir dhīras tatra na muhyati ||",
      "translation": "All, that doth live, lives always! To man's frame as there come infancy and youth and age, so come there raisings-up and layings-down of other and of other life-abodes, which the wise know, and fear not.",
      "teaching": "Just as the soul passes through childhood, youth and old age in one body, it similarly passes from one body to another. The wise are not bewildered by this process.",
      "category": "philosophy",
      "relevance": 92
    },
    {
      "id": 214,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "14",
      "sanskrit": "मात्रास्पर्शास्तु कौन्तेय शीतोष्णसुखदुःखदाः। आगमापायिनोऽनित्यास्तांस्तितिक्षस्व भारत॥",
      "transliteration": "mātrā-sparśās tu kaunteya śītoṣṇa-sukha-duḥkha-dāḥ | āgamāpāyino 'nityās tāṁs titikṣasva bhārata ||",
      "translation": "This that irks thy sense-life, thrilling to the elements—bringing thee heat and cold, sorrows and joys, 'tis brief and mutable! Bear with it, Prince!",
      "teaching": "Sensory experiences of pleasure and pain, heat and cold are temporary and come and go like seasons. The wise person learns to tolerate them with equanimity.",
      "category": "detachment",
      "relevance": 88
    },
    {
      "id": 215,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "15",
      "sanskrit": "यं हि न व्यथयन्त्येते पुरुषं पुरुषर्षभ। समदुःखसुखं धीरं सोऽमृतत्वाय कल्पते॥",
      "transliteration": "yaṁ hi na vyathayanty ete puruṣaṁ puruṣarṣabha | sama-duḥkha-sukhaṁ dhīraṁ so 'mṛtatvāya kalpate ||",
      "translation": "As the wise bear. The soul which is not moved, the soul that with a strong and constant calm takes sorrow and takes joy indifferently, lives in the life undying!",
      "teaching": "One who remains undisturbed by pleasure and pain, and treats them equally, becomes eligible for liberation and immortality.",
      "category": "detachment",
      "relevance": 94
    },
    {
      "id": 216,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "16",
      "sanskrit": "नासतो विद्यते भावो नाभावो विद्यते सतः। उभयोरपि दृष्टोऽन्तस्त्वनयोस्तत्त्वदर्शिभिः॥",
      "transliteration": "nāsato vidyate bhāvo nābhāvo vidyate sataḥ | ubhayor api dṛṣṭo 'ntas tv anayos tattva-darśibhiḥ ||",
      "translation": "That which is can never cease to be; that which is not will not exist. To see this truth of both is theirs who part essence from accident, substance from shadow.",
      "teaching": "The unreal has no existence, and the real never ceases to be. Those who can discern between the temporary and eternal understand this fundamental truth.",
      "category": "philosophy",
      "relevance": 96
    },
    {
      "id": 217,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "17",
      "sanskrit": "अविनाशि तु तद्विद्धि येन सर्वमिदं ततम्। विनाशमव्ययस्यास्य न कश्चित्कर्तुमर्हति॥",
      "transliteration": "avināśi tu tad viddhi yena sarvam idaṁ tatam | vināśam avyayasyāsya na kaścit kartum arhati ||",
      "translation": "Indestructible, learn thou! the Life is, spreading life through all; it cannot anywhere, by any means, be anywise diminished, stayed, or changed.",
      "teaching": "Know that which pervades the entire body is indestructible. No one can destroy the imperishable soul that animates all living beings.",
      "category": "philosophy",
      "relevance": 91
    },
    {
      "id": 218,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "18",
      "sanskrit": "अन्तवन्त इमे देहा नित्यस्योक्ताः शरीरिणः। अनाशिनोऽप्रमेयस्य तस्माद्युध्यस्व भारत॥",
      "transliteration": "antavanta ime dehā nityasyoktāḥ śarīriṇaḥ | anāśino 'prameyasya tasmād yudhyasva bhārata ||",
      "translation": "But for these fleeting frames which it informs with spirit deathless, endless, infinite, they perish. Let them perish, Prince! and fight!",
      "teaching": "Only the physical bodies are perishable, while the soul dwelling within is eternal, indestructible and immeasurable. Therefore, do your duty without hesitation.",
      "category": "action",
      "relevance": 85
    },
    {
      "id": 219,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "19",
      "sanskrit": "य एनं वेत्ति हन्तारं यश्चैनं मन्यते हतम्। उभौ तौ न विजानीतो नायं हन्ति न हन्यते॥",
      "transliteration": "ya enaṁ vetti hantāraṁ yaś cainaṁ manyate hatam | ubhau tau na vijānīto nāyaṁ hanti na hanyate ||",
      "translation": "He who shall say, 'Lo! I have slain a man!' He who shall think, 'Lo! I am slain!' those both know naught! Life cannot slay. Life is not slain!",
      "teaching": "Neither the soul kills nor can it be killed. Those who think they are the killer or the killed are both ignorant of the soul's eternal nature.",
      "category": "philosophy",
      "relevance": 89
    },
    {
      "id": 220,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "20",
      "sanskrit": "न जायते म्रियते वा कदाचिन्नायं भूत्वा भविता वा न भूयः। अजो नित्यः शाश्वतोऽयं पुराणो न हन्यते हन्यमाने शरीरे॥",
      "transliteration": "na jāyate mriyate vā kadācin nāyaṁ bhūtvā bhavitā vā na bhūyaḥ | ajo nityaḥ śāśvato 'yaṁ purāṇo na hanyate hanyamāne śarīre ||",
      "translation": "Never the spirit was born; the spirit shall cease to be never; never was time it was not; End and Beginning are dreams! Birthless and deathless and changeless remaineth the spirit for ever; death hath not touched it at all, dead though the house of it seems!",
      "teaching": "The soul is never born, nor does it die. It is unborn, eternal, permanent, and primeval. It is not destroyed when the body is destroyed.",
      "category": "philosophy",
      "relevance": 97
    },
    {
      "id": 221,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "21",
      "sanskrit": "वेदाविनाशिनं नित्यं य एनमजमव्ययम्। कथं स पुरुषः पार्थ कं घातयति हन्ति कम्॥",
      "transliteration": "vedāvināśinaṁ nityaṁ ya enam ajam avyayam | kathaṁ sa puruṣaḥ pārtha kaṁ ghātayati hanti kam ||",
      "translation": "Who knoweth it exhaustless, self-sustained, immortal, indestructible,—shall such say, 'I have killed a man, or caused to kill?'",
      "teaching": "One who truly knows the soul to be indestructible, eternal, unborn and unchanging - how can such a person kill anyone or cause anyone to be killed?",
      "category": "wisdom",
      "relevance": 86
    },
    {
      "id": 222,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "22",
      "sanskrit": "वासांसि जीर्णानि यथा विहाय नवानि गृह्णाति नरोऽपराणि। तथा शरीराणि विहाय जीर्णान्यन्यानि संयाति नवानि देही॥",
      "transliteration": "vāsāṁsi jīrṇāni yathā vihāya navāni gṛhṇāti naro 'parāṇi | tathā śarīrāṇi vihāya jīrṇāny anyāni saṁyāti navāni dehī ||",
      "translation": "Nay, but as when one layeth his worn-out robes away, and taking new ones, sayeth, 'These will I wear to-day!' so putteth by the spirit lightly its garb of flesh, and passeth to inherit a residence afresh.",
      "teaching": "Just as a person sheds worn-out clothes and wears new garments, the soul casts off worn-out bodies and enters new ones. This natural process should not be a cause for grief.",
      "category": "philosophy",
      "relevance": 93
    },
    {
      "id": 223,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "23",
      "sanskrit": "नैनं छिन्दन्ति शस्त्राणि नैनं दहति पावकः। न चैनं क्लेदयन्त्यापो न शोषयति मारुतः॥",
      "transliteration": "nainaṁ chindanti śastrāṇi nainaṁ dahati pāvakaḥ | na cainaṁ kledayanty āpo na śoṣayati mārutaḥ ||",
      "translation": "I say to thee weapons reach not the Life; flame burns it not, waters cannot o'erwhelm, nor dry winds wither it.",
      "teaching": "The soul cannot be cut by weapons, burned by fire, moistened by water, or dried by wind. It is beyond the reach of physical forces.",
      "category": "philosophy",
      "relevance": 87
    },
    {
      "id": 224,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "24",
      "sanskrit": "अच्छेद्योऽयमदाह्योऽयमक्लेद्योऽशोष्य एव च। नित्यः सर्वगतः स्थाणुरचलोऽयं सनातनः॥",
      "transliteration": "acchedyo 'yam adāhyo 'yam akledyo 'śoṣya eva ca | nityaḥ sarvagataḥ sthāṇur acalo 'yaṁ sanātanaḥ ||",
      "translation": "Impenetrable, unentered, unassailed, unharmed, untouched, immortal, all-arriving, stable, sure, invisible, ineffable, by word and thought uncompassed, ever all itself, thus is the Soul declared!",
      "teaching": "The soul is uncleavable, incombustible, insoluble and unwitherable. It is eternal, omnipresent, unchangeable, immovable and eternally the same.",
      "category": "philosophy",
      "relevance": 90
    },
    {
      "id": 225,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "25",
      "sanskrit": "अव्यक्तोऽयमचिन्त्योऽयमविकार्योऽयमुच्यते। तस्मादेवं विदित्वैनं नानुशोचितुमर्हसि॥",
      "transliteration": "avyakto 'yam acintyo 'yam avikāryo 'yam ucyate | tasmād evaṁ viditvainaṁ nānuśocitum arhasi ||",
      "translation": "How wilt thou, then,—knowing it so,—grieve when thou shouldst not grieve?",
      "teaching": "The soul is said to be unmanifest, unthinkable and unchangeable. Knowing this, you should not grieve for the temporary body.",
      "category": "wisdom",
      "relevance": 88
    },
    {
      "id": 226,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "26",
      "sanskrit": "अथ चैनं नित्यजातं नित्यं वा मन्यसे मृतम्। तथापि त्वं महाबाहो नैवं शोचितुमर्हसि॥",
      "transliteration": "atha cainaṁ nitya-jātaṁ nityaṁ vā manyase mṛtam | tathāpi tvaṁ mahā-bāho naivaṁ śocitum arhasi ||",
      "translation": "How, if thou hearest that the man new-dead is, like the man new-born, still living man—one same, existent Spirit—wilt thou weep?",
      "teaching": "Even if you think the soul is perpetually taking birth and dying, still you should not grieve, O mighty-armed one, because this too is the natural way.",
      "category": "detachment",
      "relevance": 82
    },
    {
      "id": 227,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "27",
      "sanskrit": "जातस्य हि ध्रुवो मृत्युर्ध्रुवं जन्म मृतस्य च। तस्मादपरिहार्येऽर्थे न त्वं शोचितुमर्हसि॥",
      "transliteration": "jātasya hi dhruvo mṛtyur dhruvaṁ janma mṛtasya ca | tasmād aparihārye 'rthe na tvaṁ śocitum arhasi ||",
      "translation": "The end of birth is death; the end of death is birth: this is ordained! and mournest thou, Chief of the stalwart arm! for what befalls which could not otherwise befall?",
      "teaching": "For one who has taken birth, death is certain; and for one who is dead, birth is certain. Therefore, in the unavoidable discharge of duty, you should not lament.",
      "category": "acceptance",
      "relevance": 85
    },
    {
      "id": 228,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "28",
      "sanskrit": "अव्यक्तादीनि भूतानि व्यक्तमध्यानि भारत। अव्यक्तनिधनान्येव तत्र का परिदेवना॥",
      "transliteration": "avyaktādīni bhūtāni vyakta-madhyāni bhārata | avyakta-nidhanāny eva tatra kā paridevanā ||",
      "translation": "The birth of living things comes unperceived; the death comes unperceived; between them, beings perceive: what is there sorrowful herein, dear Prince?",
      "teaching": "All beings are unmanifest before birth, manifest between birth and death, and unmanifest again after death. So what is there to lament about?",
      "category": "acceptance",
      "relevance": 83
    },
    {
      "id": 229,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "29",
      "sanskrit": "आश्चर्यवत्पश्यति कश्चिदेनमाश्चर्यवद्वदति तथैव चान्यः। आश्चर्यवच्चैनमन्यः शृणोति श्रुत्वाप्येनं वेद न चैव कश्चित्॥",
      "transliteration": "āścarya-vat paśyati kaścid enam āścarya-vad vadati tathaiva cānyaḥ | āścarya-vac cainam anyaḥ śṛṇoti śrutvāpy enaṁ veda na caiva kaścit ||",
      "translation": "Wonderful, wistful, to contemplate! Difficult, doubtful, to speak upon! Strange and great for tongue to relate, mystical hearing for every one! Nor wotteth man this, what a marvel it is, when seeing, and saying, and hearing are done!",
      "teaching": "Some look upon the soul as amazing, some speak of it as amazing, some hear of it as amazing, while others, even after hearing about it, cannot understand it at all.",
      "category": "wonder",
      "relevance": 79
    },
    {
      "id": 230,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "30",
      "sanskrit": "देही नित्यमवध्योऽयं देहे सर्वस्य भारत। तस्मात्सर्वाणि भूतानि न त्वं शोचितुमर्हसि॥",
      "transliteration": "dehī nityam avadhyo 'yaṁ dehe sarvasya bhārata | tasmāt sarvāṇi bhūtāni na tvaṁ śocitum arhasi ||",
      "translation": "This Life within all living things, my Prince! hides beyond harm; scorn thou to suffer, then, for that which cannot suffer. Do thy part!",
      "teaching": "The embodied soul in everyone's body is eternal and indestructible. Therefore, you should not grieve for any living being.",
      "category": "duty",
      "relevance": 87
    },
    {
      "id": 231,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "31",
      "sanskrit": "स्वधर्ममपि चावेक्ष्य न विकम्पितुमर्हसि। धर्म्याद्धि युद्धाच्छ्रेयोऽन्यत्क्षत्रियस्य न विद्यते॥",
      "transliteration": "sva-dharmam api cāvekṣya na vikampitum arhasi | dharmyād dhi yuddhāc chreyo 'nyat kṣatriyasya na vidyate ||",
      "translation": "Be mindful of thy name, and tremble not! Nought better can betide a martial soul than lawful war; happy the warrior to whom comes joy of battle—comes, as now, glorious and fair, unsought; opening for him a gateway unto Heav'n.",
      "teaching": "Considering your specific duty as a warrior, you should not waver. For a warrior, there is no better engagement than fighting for righteousness.",
      "category": "duty",
      "relevance": 89
    },
    {
      "id": 232,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "32",
      "sanskrit": "यदृच्छया चोपपन्नं स्वर्गद्वारमपावृतम्। सुखिनः क्षत्रियाः पार्थ लभन्ते युद्धमीदृशम्॥",
      "transliteration": "yadṛcchayā copapannaṁ svarga-dvāram apāvṛtam | sukhinaḥ kṣatriyāḥ pārtha labhante yuddham īdṛśam ||",
      "translation": "But, if thou shunn'st this honourable field—a Kshattriya—if, knowing thy duty and thy task, thou bidd'st duty and task go by—that shall be sin!",
      "teaching": "O Partha, happy are the warriors who obtain such a battle, which comes of its own accord as an open door to heaven.",
      "category": "duty",
      "relevance": 84
    },
    {
      "id": 233,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "33",
      "sanskrit": "अथ चेत्त्वमिमं धर्म्यं संग्रामं न करिष्यसि। ततः स्वधर्मं कीर्तिं च हित्वा पापमवाप्स्यसि॥",
      "transliteration": "atha cet tvam imaṁ dharmyaṁ saṅgrāmaṁ na kariṣyasi | tataḥ sva-dharmaṁ kīrtiṁ ca hitvā pāpam avāpsyasi ||",
      "translation": "And those to come shall speak thee infamy from age to age; but infamy is worse for men of noble blood to bear than death!",
      "teaching": "If you do not engage in this righteous war, then you will certainly incur sin by neglecting your duties and losing your reputation.",
      "category": "duty",
      "relevance": 86
    },
    {
      "id": 234,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "34",
      "sanskrit": "अकीर्तिं चापि भूतानि कथयिष्यन्ति तेऽव्ययाम्। सम्भावितस्य चाकीर्तिर्मरणादतिरिच्यते॥",
      "transliteration": "akīrtiṁ cāpi bhūtāni kathayiṣyanti te 'vyayām | sambhāvitasya cākīrtir maraṇād atiricyate ||",
      "translation": "The chiefs upon their battle-chariots will deem 'twas fear that drove thee from the fray. Of those who held thee mighty-souled the scorn thou must abide, while all thine enemies will scatter bitter speech of thee, to mock the valour which thou hadst; what fate could fall more grievously than this?",
      "teaching": "People will always speak of your infamy, and for a respectable person, dishonor is worse than death.",
      "category": "honor",
      "relevance": 81
    },
    {
      "id": 235,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "35",
      "sanskrit": "भयाद्रणादुपरतं मंस्यन्ते त्वां महारथाः। येषां च त्वं बहुमतो भूत्वा यास्यसि लाघवम्॥",
      "transliteration": "bhayād raṇād uparataṁ maṁsyante tvāṁ mahā-rathāḥ | yeṣāṁ ca tvaṁ bahu-mato bhūtvā yāsyasi lāghavam ||",
      "translation": "Either—being killed—thou wilt win Swarga's safety, or—alive and victor—thou wilt reign an earthly king. Therefore, arise, thou Son of Kunti! brace thine arm for conflict, nerve thy heart to meet—as things alike to thee—pleasure or pain, profit or ruin, victory or defeat: so minded, gird thee to the fight, for so thou shalt not sin!",
      "teaching": "The great generals will think that you have withdrawn from the battlefield out of fear. Those who have held you in great esteem will fall down in their estimation of you.",
      "category": "reputation",
      "relevance": 80
    },
    {
      "id": 236,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "36",
      "sanskrit": "अवाच्यवादांश्च बहून्वदिष्यन्ति तवाहिताः। निन्दन्तस्तव सामर्थ्यं ततो दुःखतरं नु किम्॥",
      "transliteration": "avācya-vādāṁś ca bahūn vadiṣyanti tavāhitāḥ | nindantas tava sāmarthyaṁ tato duḥkhataraṁ nu kim ||",
      "translation": "Your enemies will speak many unkind words and scorn your ability. What could be more painful than this?",
      "teaching": "Your enemies will speak many harsh words and criticize your abilities. What could be more painful than this humiliation?",
      "category": "reputation",
      "relevance": 78
    },
    {
      "id": 237,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "37",
      "sanskrit": "हतो वा प्राप्स्यसि स्वर्गं जित्वा वा भोक्ष्यसे महीम्। तस्मादुत्तिष्ठ कौन्तेय युद्धाय कृतनिश्चयः॥",
      "transliteration": "hato vā prāpsyasi svargaṁ jitvā vā bhokṣyase mahīm | tasmād uttiṣṭha kaunteya yuddhāya kṛta-niścayaḥ ||",
      "translation": "O son of Kunti, either you will be killed on the battlefield and attain the heavenly planets, or you will conquer and enjoy the earthly kingdom. Therefore, get up with determination and fight.",
      "teaching": "There are only two outcomes in righteous battle: victory leads to earthly enjoyment, death leads to heavenly reward. Both outcomes are favorable for a warrior doing his duty.",
      "category": "duty",
      "relevance": 88
    },
    {
      "id": 238,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "38",
      "sanskrit": "सुखदुःखे समे कृत्वा लाभालाभौ जयाजयौ। ततो युद्धाय युज्यस्व नैवं पापमवाप्स्यसि॥",
      "transliteration": "sukha-duḥkhe same kṛtvā lābhālābhau jayājayau | tato yuddhāya yujyasva naivaṁ pāpam avāpsyasi ||",
      "translation": "So minded, gird thee to the fight, for so thou shalt not sin! Thus far I speak to thee as from the 'Sankhya'—unspiritually—hear now the deeper teaching of the Yog, which holding, understanding, thou shalt burst thy Karmabandh, the bondage of wrought deeds.",
      "teaching": "Treating pleasure and pain, gain and loss, victory and defeat equally, engage in battle. In this way you will never incur sin.",
      "category": "equanimity",
      "relevance": 92
    },
    {
      "id": 239,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "39",
      "sanskrit": "एषा तेऽभिहिता सांख्ये बुद्धिर्योगे त्विमां शृणु। बुद्ध्या युक्तो यया पार्थ कर्मबन्धं प्रहास्यसि॥",
      "transliteration": "eṣā te 'bhihitā sāṅkhye buddhir yoge tv imāṁ śṛṇu | buddhyā yukto yayā pārtha karma-bandhaṁ prahāsyasi ||",
      "translation": "Thus far I have taught you analytical knowledge. Now listen as I explain it in terms of working without fruitive results. O son of Pritha, when you act with such intelligence you can free yourself from the bondage of works.",
      "teaching": "So far this wisdom has been presented through analytical study. Now hear about it in terms of yoga. By this understanding, you can break free from the bondage of action.",
      "category": "knowledge",
      "relevance": 90
    },
    {
      "id": 240,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "40",
      "sanskrit": "नेहाभिक्रमनाशोऽस्ति प्रत्यवायो न विद्यते। स्वल्पमप्यस्य धर्मस्य त्रायते महतो भयात्॥",
      "transliteration": "nehābhikrama-nāśo 'sti pratyavāyo na vidyate | svalpam apy asya dharmasya trāyate mahato bhayāt ||",
      "translation": "Here shall no end be hindered, no hope marred, no loss be feared: faith—yea, a little faith—shall save thee from the anguish of thy dread.",
      "teaching": "In this endeavor there is no loss or diminution, and a little advancement on this path can protect one from the most dangerous type of fear.",
      "category": "hope",
      "relevance": 85
    },
    {
      "id": 241,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "41",
      "sanskrit": "व्यवसायात्मिका बुद्धिरेकेह कुरुनन्दन। बहुशाखा ह्यनन्ताश्च बुद्धयोऽव्यवसायिनाम्॥",
      "transliteration": "vyavasāyātmikā buddhir ekeha kuru-nandana | bahu-śākhā hy anantāś ca buddhayo 'vyavasāyinām ||",
      "translation": "Here, Glory of the Kurus! shines one rule—one steadfast rule—while shifting souls have laws many and hard.",
      "teaching": "Those who are on this path are resolute in purpose, and their aim is one. O beloved child of the Kurus, the intelligence of the irresolute is many-branched.",
      "category": "focus",
      "relevance": 87
    },
    {
      "id": 242,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "42",
      "sanskrit": "यामिमां पुष्पितां वाचं प्रवदन्त्यविपश्चितः। वेदवादरताः पार्थ नान्यदस्तीति वादिनः॥",
      "transliteration": "yām imāṁ puṣpitāṁ vācaṁ pravadanty avipaścitaḥ | veda-vāda-ratāḥ pārtha nānyad astīti vādinaḥ ||",
      "translation": "Specious, but wrongful deem the speech of those ill-taught ones who extol the letter of their Vedas, saying, 'This is all we have, or need;' being weak at heart with wants, seekers of Heaven.",
      "teaching": "Men of small knowledge are very much attached to the flowery words of the Vedas, which recommend various fruitive activities for elevation to heavenly planets.",
      "category": "wisdom",
      "relevance": 83
    },
    {
      "id": 243,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "43",
      "sanskrit": "कामात्मानः स्वर्गपरा जन्मकर्मफलप्रदाम्। क्रियाविशेषबहुलां भोगैश्वर्यगतिं प्रति॥",
      "transliteration": "kāmātmānaḥ svarga-parā janma-karma-phala-pradām | kriyā-viśeṣa-bahulāṁ bhogaiśvarya-gatiṁ prati ||",
      "translation": "Which comes—they say—as 'fruit of good deeds done;' promising men much profit in new births for works of faith; in various rites abounding.",
      "teaching": "Driven by desire and aimed at heaven, they speak flowery words that promise new birth as the reward of their actions, prescribing various elaborate rituals for the attainment of pleasure and power.",
      "category": "detachment",
      "relevance": 81
    },
    {
      "id": 244,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "44",
      "sanskrit": "भोगैश्वर्यप्रसक्तानां तयापहृतचेतसाम्। व्यवसायात्मिका बुद्धिः समाधौ न विधीयते॥",
      "transliteration": "bhogaiśvarya-prasaktānāṁ tayāpahṛta-cetasām | vyavasāyātmikā buddhiḥ samādhau na vidhīyate ||",
      "translation": "Albeit, who wealth and power do most desire least fixity of soul have such, least hold on heavenly meditation.",
      "teaching": "In the minds of those who are too attached to sense enjoyment and material opulence, and who are bewildered by such things, the resolute determination for devotional service does not take place.",
      "category": "detachment",
      "relevance": 82
    },
    {
      "id": 245,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "45",
      "sanskrit": "त्रैगुण्यविषया वेदा निस्त्रैगुण्यो भवार्जुन। निर्द्वन्द्वो नित्यसत्त्वस्थो निर्योगक्षेम आत्मवान्॥",
      "transliteration": "traiguṇya-viṣayā vedā nistraiguṇyo bhavārjuna | nirdvandvo nitya-sattva-stho niryoga-kṣema ātmavān ||",
      "translation": "Much these teach, from Veds, concerning the 'three qualities;' but thou, be free of the 'three qualities,' free of the 'pairs of opposites,' and free from that sad righteousness which calculates; self-ruled, Arjuna! simple, satisfied!",
      "teaching": "The Vedas deal mainly with the subject of the three modes of material nature. O Arjuna, become transcendental to these three modes. Be free from all dualities and from all anxieties for gain and safety, and be established in the self.",
      "category": "transcendence",
      "relevance": 89
    },
    {
      "id": 246,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "46",
      "sanskrit": "यावानर्थ उदपाने सर्वतः सम्प्लुतोदके। तावान्सर्वेषु वेदेषु ब्राह्मणस्य विजानतः॥",
      "transliteration": "yāvān artha udapāne sarvataḥ samplutodake | tāvān sarveṣu vedeṣu brāhmaṇasya vijānataḥ ||",
      "translation": "Look! like as when a tank pours water forth to suit all needs, so do these Brahmans draw text for all wants from tank of Holy Writ. But thou, want not! ask not! Find full reward of doing right in right!",
      "teaching": "All purposes served by a small well can at once be served by a great reservoir of water. Similarly, all the purposes of the Vedas can be served to one who knows the purpose behind them.",
      "category": "wisdom",
      "relevance": 84
    },
    {
      "id": 247,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "47",
      "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
      "transliteration": "karmaṇy evādhikāras te mā phaleṣu kadācana | mā karma-phala-hetur bhūr mā te saṅgo 'stv akarmaṇi ||",
      "translation": "Let right deeds be thy motive, not the fruit which comes from them. And live in action! Labour! Make thine acts thy piety, casting all self aside, contemning gain and merit; equable in good or evil: equability is Yog, is piety!",
      "teaching": "You have a right to perform your prescribed duty, but not to the fruits of action. Never consider yourself the cause of the results of your activities, and never be attached to not doing your duty.",
      "category": "action",
      "relevance": 98
    },
    {
      "id": 248,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "48",
      "sanskrit": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥",
      "transliteration": "yoga-sthaḥ kuru karmāṇi saṅgaṁ tyaktvā dhanañjaya | siddhy-asiddhyoḥ samo bhūtvā samatvaṁ yoga ucyate ||",
      "translation": "Yet, the right act is less, far less, than the right-thinking mind. Seek refuge in thy soul; have there thy heaven! Scorn them that follow virtue for her gifts!",
      "teaching": "Perform your duty equipoised, O Arjuna, abandoning all attachment to success or failure. Such equanimity is called yoga.",
      "category": "equanimity",
      "relevance": 95
    },
    {
      "id": 249,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "49",
      "sanskrit": "दूरेण ह्यवरं कर्म बुद्धियोगाद्धनञ्जय। बुद्धौ शरणमन्विच्छ कृपणाः फलहेतवः॥",
      "transliteration": "dūreṇa hy avaraṁ karma buddhi-yogād dhanañjaya | buddhau śaraṇam anviccha kṛpaṇāḥ phala-hetavaḥ ||",
      "translation": "Far lower than the right-thinking mind is mere right action, O Dhananjaya. Seek refuge in the attitude of wisdom. Those who work for reward are wretched.",
      "teaching": "O Dhananjaya, keep all abominable activities far distant by devotional service, and in that consciousness surrender unto the Lord. Those who want to enjoy the fruits of their work are misers.",
      "category": "wisdom",
      "relevance": 86
    },
    {
      "id": 250,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "50",
      "sanskrit": "बुद्धियुक्तो जहातीह उभे सुकृतदुष्कृते। तस्माद्योगाय युज्यस्व योगः कर्मसु कौशलम्॥",
      "transliteration": "buddhi-yukto jahātīha ubhe sukṛta-duṣkṛte | tasmād yogāya yujyasva yogaḥ karmasu kauśalam ||",
      "translation": "The mind of pure devotion—even here—casts equally aside good deeds and bad, passing above them. Unto pure devotion devote thyself: with perfect meditation comes perfect act.",
      "teaching": "A man engaged in devotional service rids himself of both good and bad actions even in this life. Therefore strive for yoga, which is the art of all work.",
      "category": "transcendence",
      "relevance": 91
    },
    {
      "id": 251,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "51",
      "sanskrit": "कर्मजं बुद्धियुक्ता हि फलं त्यक्त्वा मनीषिणः। जन्मबन्धविनिर्मुक्ताः पदं गच्छन्त्यनामयम्॥",
      "transliteration": "karma-jaṁ buddhi-yuktā hi phalaṁ tyaktvā manīṣiṇaḥ | janma-bandha-vinirmuktāḥ padaṁ gacchanty anāmayam ||",
      "translation": "When thy firm soul hath shaken off those tangled oracles which ignorantly guide, then shall it soar to high neglect of what's denied or said, this way or that way, in doctrinal writ.",
      "teaching": "By thus engaging in devotional service to the Lord, great sages or devotees free themselves from the results of work in the material world. In this way they become free from the cycle of birth and death and attain the state beyond all miseries.",
      "category": "liberation",
      "relevance": 88
    },
    {
      "id": 252,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "52",
      "sanskrit": "यदा ते मोहकलिलं बुद्धिर्व्यतितरिष्यति। तदा गन्तासि निर्वेदं श्रोतव्यस्य श्रुतस्य च॥",
      "transliteration": "yadā te moha-kalilaṁ buddhir vyatitariṣyati | tadā gantāsi nirvedaṁ śrotavyasya śrutasya ca ||",
      "translation": "Troubled no longer by the priestly lore, safe shall it live, and sure; steadfastly bent on meditation. This is Yog—and Peace!",
      "teaching": "When your intelligence has passed out of the dense forest of delusion, you shall become indifferent to all that has been heard and all that is to be heard.",
      "category": "liberation",
      "relevance": 87
    },
    {
      "id": 253,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "53",
      "sanskrit": "श्रुतिविप्रतिपन्ना ते यदा स्थास्यति निश्चला। समाधावचला बुद्धिस्तदा योगमवाप्स्यसि॥",
      "transliteration": "śruti-vipratipannā te yadā sthāsyati niścalā | samādhāv acalā buddhis tadā yogam avāpsyasi ||",
      "translation": "When your mind is no longer disturbed by the flowery language of the Vedas, and when it remains fixed in the trance of self-realization, then you will have attained the divine consciousness.",
      "teaching": "When your mind is no longer disturbed by the flowery language of the Vedas, and when it remains fixed in the trance of self-realization, then you will have attained the Divine consciousness.",
      "category": "meditation",
      "relevance": 89
    },
    {
      "id": 254,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "54",
      "sanskrit": "अर्जुन उवाच स्थितप्रज्ञस्य का भाषा समाधिस्थस्य केशव। स्थितधीः किं प्रभाषेत किमासीत व्रजेत किम्॥",
      "transliteration": "arjuna uvāca sthita-prajñasya kā bhāṣā samādhi-sthasya keśava | sthita-dhīḥ kiṁ prabhāṣeta kim āsīta vrajeta kim ||",
      "translation": "What is his mark who hath that steadfast heart, confirmed in holy meditation? How know we his speech, Kesava? Sits he, moves he like other men?",
      "teaching": "Arjuna said: O Krishna, what are the symptoms of one whose consciousness is thus merged in transcendence? How does he speak, and what is his language? How does he sit, and how does he walk?",
      "category": "inquiry",
      "relevance": 85
    },
    {
      "id": 255,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "55",
      "sanskrit": "श्रीभगवानुवाच प्रजहाति यदा कामान्सर्वान्पार्थ मनोगतान्। आत्मन्येवात्मना तुष्टः स्थितप्रज्ञस्तदोच्यते॥",
      "transliteration": "śrī-bhagavān uvāca prajahāti yadā kāmān sarvān pārtha mano-gatān | ātmany evātmanā tuṣṭaḥ sthita-prajñas tadocyate ||",
      "translation": "When one, O Pritha's Son! abandoning desires which shake the mind—finds in his soul full comfort for his soul, he hath attained the Yog—that man is such!",
      "teaching": "The Supreme Personality of Godhead said: O Partha, when a man gives up all varieties of desire for sense gratification, which arise from mental concoction, and when his mind, thus purified, finds satisfaction in the self alone, then he is said to be in pure transcendental consciousness.",
      "category": "self-realization",
      "relevance": 93
    },
    {
      "id": 256,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "56",
      "sanskrit": "दुःखेष्वनुद्विग्नमनाः सुखेषु विगतस्पृहः। वीतरागभयक्रोधः स्थितधीर्मुनिरुच्यते॥",
      "transliteration": "duḥkheṣv anudvigna-manāḥ sukheṣu vigata-spṛhaḥ | vīta-rāga-bhaya-krodhaḥ sthita-dhīr munir ucyate ||",
      "translation": "In sorrows not dejected, and in joys not overjoyed; dwelling outside the stress of passion, fear, and anger; fixed in calms of lofty contemplation;—such an one is Muni, is the Sage, the true Recluse!",
      "teaching": "One who is not disturbed in mind even amidst the threefold miseries or elated when there is happiness, and who is free from attachment, fear and anger, is called a sage of steady mind.",
      "category": "equanimity",
      "relevance": 91
    },
    {
      "id": 257,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "57",
      "sanskrit": "यः सर्वत्रानभिस्नेहस्तत्तत्प्राप्य शुभाशुभम्। नाभिनन्दति न द्वेष्टि तस्य प्रज्ञा प्रतिष्ठिता॥",
      "transliteration": "yaḥ sarvatrānabhisnehas tat tat prāpya śubhāśubham | nābhinandati na dveṣṭi tasya prajñā pratiṣṭhitā ||",
      "translation": "He who to none and nowhere overbound by ties of flesh, takes evil things and good neither desponding nor exulting, such bears wisdom's plainest mark!",
      "teaching": "In the material world, one who is unattached to the fruits of his work and who acts as a matter of duty is in the renounced order of life, and he is the true mystic.",
      "category": "detachment",
      "relevance": 88
    },
    {
      "id": 258,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "58",
      "sanskrit": "यदा संहरते चायं कूर्मोऽङ्गानीव सर्वशः। इन्द्रियाणीन्द्रियार्थेभ्यस्तस्य प्रज्ञा प्रतिष्ठिता॥",
      "transliteration": "yadā saṁharate cāyaṁ kūrmo 'ṅgānīva sarvaśaḥ | indriyāṇīndriyārthebhyas tasya prajñā pratiṣṭhitā ||",
      "translation": "He who shall draw as the wise tortoise draws its four feet safe under its shield, his five frail senses back under the spirit's buckler from the world which else assails them, such an one, my Prince! hath wisdom's mark!",
      "teaching": "One who is able to withdraw his senses from sense objects, as the tortoise draws its limbs within the shell, is firmly fixed in perfect consciousness.",
      "category": "self-control",
      "relevance": 90
    },
    {
      "id": 259,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "59",
      "sanskrit": "विषया विनिवर्तन्ते निराहारस्य देहिनः। रसवर्जं रसोऽप्यस्य परं दृष्ट्वा निवर्तते॥",
      "transliteration": "viṣayā vinivartante nirāhārasya dehinaḥ | rasa-varjaṁ raso 'py asya paraṁ dṛṣṭvā nivartate ||",
      "translation": "Things that solicit sense hold off from the self-governed; nay, it comes, the appetites of him who lives beyond depart,—aroused no more.",
      "teaching": "Though the embodied soul may be restricted from sense enjoyment, the taste for sense objects remains. But, ceasing such engagements by experiencing a higher taste, he is fixed in consciousness.",
      "category": "transcendence",
      "relevance": 87
    },
    {
      "id": 260,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "60",
      "sanskrit": "यततो ह्यपि कौन्तेय पुरुषस्य विपश्चितः। इन्द्रियाणि प्रमाथीनि हरन्ति प्रसभं मनः॥",
      "transliteration": "yatato hy api kaunteya puruṣasya vipaścitaḥ | indriyāṇi pramāthīni haranti prasabhaṁ manaḥ ||",
      "translation": "Yet may it chance, O Son of Kunti! that a governed mind shall some time feel the sense-storms sweep, and wrest strong self-control by the roots.",
      "teaching": "The senses are so strong and impetuous, O Arjuna, that they forcibly carry away the mind even of a man of discrimination who is endeavoring to control them.",
      "category": "self-control",
      "relevance": 86
    },
    {
      "id": 261,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "61",
      "sanskrit": "तानि सर्वाणि संयम्य युक्त आसीत मत्परः। वशे हि यस्येन्द्रियाणि तस्य प्रज्ञा प्रतिष्ठिता॥",
      "transliteration": "tāni sarvāṇi saṁyamya yukta āsīta mat-paraḥ | vaśe hi yasyendriyāṇi tasya prajñā pratiṣṭhitā ||",
      "translation": "Let him regain his kingdom! let him conquer this, and sit on Me intent. That man alone is wise who keeps the mastery of himself!",
      "teaching": "One who restrains his senses, keeping them under full control, and fixes his consciousness upon Me, is known as a man of steady intelligence.",
      "category": "devotion",
      "relevance": 92
    },
    {
      "id": 262,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "62",
      "sanskrit": "ध्यायतो विषयान्पुंसः सङ्गस्तेषूपजायते। सङ्गात्संजायते कामः कामात्क्रोधोऽभिजायते॥",
      "transliteration": "dhyāyato viṣayān puṁsaḥ saṅgas teṣūpajāyate | saṅgāt sañjāyate kāmaḥ kāmāt krodho 'bhijāyate ||",
      "translation": "If one ponders on objects of the sense, there springs attraction; from attraction grows desire, desire flames to fierce passion, passion breeds recklessness.",
      "teaching": "While contemplating the objects of the senses, a person develops attachment for them, and from such attachment lust develops, and from lust anger arises.",
      "category": "psychology",
      "relevance": 94
    },
    {
      "id": 263,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "63",
      "sanskrit": "क्रोधाद्भवति सम्मोहः सम्मोहात्स्मृतिविभ्रमः। स्मृतिभ्रंशाद्बुद्धिनाशो बुद्धिनाशात्प्रणश्यति॥",
      "transliteration": "krodhād bhavati sammohaḥ sammohāt smṛti-vibhramaḥ | smṛti-bhraṁśād buddhi-nāśo buddhi-nāśāt praṇaśyati ||",
      "translation": "Then the memory—all betrayed—lets noble purpose go, and saps the mind, till purpose, mind, and man are all undone.",
      "teaching": "From anger, complete delusion arises, and from delusion bewilderment of memory. When memory is bewildered, intelligence is lost, and when intelligence is lost one falls down again into the material pool.",
      "category": "psychology",
      "relevance": 93
    },
    {
      "id": 264,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "64",
      "sanskrit": "रागद्वेषवियुक्तैस्तु विषयानिन्द्रियैश्चरन्। आत्मवश्यैर्विधेयात्मा प्रसादमधिगच्छति॥",
      "transliteration": "rāga-dveṣa-viyuktais tu viṣayān indriyaiś caran | ātma-vaśyair vidheyātmā prasādam adhigacchati ||",
      "translation": "But, if one deals with objects of the sense not loving and not hating, making them serve his free soul, which rests serenely lord, Lo! such a man comes to tranquillity.",
      "teaching": "But a person free from all attachment and aversion and able to control his senses through regulative principles of freedom can obtain the complete mercy of the Lord.",
      "category": "self-control",
      "relevance": 89
    },
    {
      "id": 265,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "65",
      "sanskrit": "प्रसादे सर्वदुःखानां हानिरस्योपजायते। प्रसन्नचेतसो ह्याशु बुद्धिः पर्यवतिष्ठते॥",
      "transliteration": "prasāde sarva-duḥkhānāṁ hānir asyopajāyate | prasanna-cetaso hy āśu buddhiḥ paryavatiṣṭhate ||",
      "translation": "And out of that tranquillity shall rise the end and healing of his earthly pains, since the will governed sets the soul at peace.",
      "teaching": "For one thus satisfied by mercy, all kinds of mental disturbances are destroyed. On such a satisfied person, intelligence is soon well established.",
      "category": "peace",
      "relevance": 87
    },
    {
      "id": 266,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "66",
      "sanskrit": "नास्ति बुद्धिरयुक्तस्य न चायुक्तस्य भावना। न चाभावयतः शान्तिरशान्तस्य कुतः सुखम्॥",
      "transliteration": "nāsti buddhir ayuktasya na cāyuktasya bhāvanā | na cābhāvayataḥ śāntir aśāntasya kutaḥ sukham ||",
      "translation": "The soul of the ungoverned is not his, nor hath he knowledge of himself; which lacked, how grows serenity? and, wanting that, whence shall he hope for happiness?",
      "teaching": "One who is not connected with the Supreme can have neither transcendental intelligence nor a steady mind, without which there is no possibility of peace. And how can there be any happiness without peace?",
      "category": "peace",
      "relevance": 85
    },
    {
      "id": 267,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "67",
      "sanskrit": "इन्द्रियाणां हि चरतां यन्मनोऽनुविधीयते। तदस्य हरति प्रज्ञां वायुर्नावमिवाम्भसि॥",
      "transliteration": "indriyāṇāṁ hi caratāṁ yan mano 'nuvidhīyate | tad asya harati prajñāṁ vāyur nāvam ivāmbhasi ||",
      "translation": "The mind that gives itself to follow shows of sense seeth its helm of wisdom rent away, and, like a ship in waves of whirlwind, drives to wreck and death.",
      "teaching": "As a strong wind sweeps away a boat on the water, even one of the roaming senses on which the mind focuses can carry away a man's intelligence.",
      "category": "self-control",
      "relevance": 88
    },
    {
      "id": 268,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "68",
      "sanskrit": "तस्माद्यस्य महाबाहो निगृहीतानि सर्वशः। इन्द्रियाणीन्द्रियार्थेभ्यस्तस्य प्रज्ञा प्रतिष्ठिता॥",
      "transliteration": "tasmād yasya mahā-bāho nigṛhītāni sarvaśaḥ | indriyāṇīndriyārthebhyas tasya prajñā pratiṣṭhitā ||",
      "translation": "Only with him, great Prince! whose senses are not swayed by things of sense—only with him who holds his mastery, shows wisdom perfect.",
      "teaching": "Therefore, O mighty-armed, one whose senses are restrained from their objects is firmly fixed in perfect consciousness.",
      "category": "self-control",
      "relevance": 90
    },
    {
      "id": 269,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "69",
      "sanskrit": "या निशा सर्वभूतानां तस्यां जागर्ति संयमी। यस्यां जाग्रति भूतानि सा निशा पश्यतो मुनेः॥",
      "transliteration": "yā niśā sarva-bhūtānāṁ tasyāṁ jāgarti saṁyamī | yasyāṁ jāgrati bhūtāni sā niśā paśyato muneḥ ||",
      "translation": "What is midnight-gloom to unenlightened souls shines wakeful day to his clear gaze; what seems as wakeful day is known for night, thick night of ignorance, to his true-seeing eyes. Such is the Saint!",
      "teaching": "What is night for all beings is the time of awakening for the self-controlled; and the time of awakening for all beings is night for the introspective sage.",
      "category": "wisdom",
      "relevance": 86
    },
    {
      "id": 270,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "70",
      "sanskrit": "आपूर्यमाणमचलप्रतिष्ठं समुद्रमापः प्रविशन्ति यद्वत्। तद्वत्कामा यं प्रविशन्ति सर्वे स शान्तिमाप्नोति न कामकामी॥",
      "transliteration": "āpūryamāṇam acala-pratiṣṭhaṁ samudram āpaḥ praviśanti yadvat | tadvat kāmā yaṁ praviśanti sarve sa śāntim āpnoti na kāma-kāmī ||",
      "translation": "And like the ocean, day by day receiving floods from all lands, which never overflows its boundary-line not leaping, and not leaving, fed by the rivers, but unswelled by those;—so is the perfect one! to his soul's ocean the world of sense pours streams of witchery; they leave him as they find, without commotion, taking their tribute, but remaining sea.",
      "teaching": "A person who is not disturbed by the incessant flow of desires—that enter like rivers into the ocean, which is ever being filled but is always still—can alone achieve peace, and not the man who strives to satisfy such desires.",
      "category": "peace",
      "relevance": 92
    },
    {
      "id": 271,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "71",
      "sanskrit": "विहाय कामान्यः सर्वान्पुमांश्चरति निःस्पृहः। निर्ममो निरहंकारः स शान्तिमधिगच्छति॥",
      "transliteration": "vihāya kāmān yaḥ sarvān pumāṁś carati niḥspṛhaḥ | nirmamo nirahaṅkāraḥ sa śāntim adhigacchati ||",
      "translation": "Yea! whoso, shaking off the yoke of flesh lives lord, not servant, of his lusts; set free from pride, from passion, from the sin of 'Self,' toucheth tranquillity!",
      "teaching": "A person who has given up all desires for sense gratification, who lives free from desires, who has given up all sense of proprietorship and is devoid of false ego—he alone can attain real peace.",
      "category": "peace",
      "relevance": 91
    },
    {
      "id": 272,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "72",
      "sanskrit": "एषा ब्राह्मी स्थितिः पार्थ नैनां प्राप्य विमुह्यति। स्थित्वास्यामन्तकालेऽपि ब्रह्मनिर्वाणमृच्छति॥",
      "transliteration": "eṣā brāhmī sthitiḥ pārtha naināṁ prāpya vimuhyati | sthitvāsyām anta-kāle 'pi brahma-nirvāṇam ṛcchati ||",
      "translation": "O Pritha's Son! That is the state of Brahm! There rests no dread when that last step is reached! Live where he will, die when he may, such passeth from all 'plaining, to blest Nirvana, with the Gods, attaining.",
      "teaching": "That is the way of the spiritual and godly life, O son of Pritha. After attaining this, a person is not bewildered. Being so situated even at the hour of death, one can enter into the kingdom of God.",
      "category": "liberation",
      "relevance": 96
    },
    {
      "id": 301,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "1",
      "sanskrit": "अर्जुन उवाच ज्यायसी चेत्कर्मणस्ते मता बुद्धिर्जनार्दन। तत्किं कर्मणि घोरे मां नियोजयसि केशव॥",
      "transliteration": "arjuna uvāca jyāyasī cet karmaṇas te matā buddhir janārdana | tat kiṁ karmaṇi ghore māṁ niyojayasi keśava ||",
      "translation": "Thou whom all mortals praise, Janardana! If meditation be a nobler thing than action, wherefore, then, great Kesava! Dost thou impel me to this dreadful fight?",
      "teaching": "Arjuna is confused by what seems like contradictory advice - Krishna praised wisdom but is asking him to fight. This confusion arises when we don't understand how knowledge and action work together.",
      "category": "inquiry",
      "relevance": 87
    },
    {
      "id": 302,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "2",
      "sanskrit": "व्यामिश्रेणेव वाक्येन बुद्धिं मोहयसीव मे। तदेकं वद निश्चित्य येन श्रेयोऽहमाप्नुयाम्॥",
      "transliteration": "vyāmiśreṇeva vākyena buddhiṁ mohayasīva me | tad ekaṁ vada niścitya yena śreyo 'ham āpnuyām ||",
      "translation": "Now am I by thy doubtful speech disturbed! Tell me one thing, and tell me certainly; by what road shall I find the better end?",
      "teaching": "When faced with apparent contradictions in spiritual teaching, we should seek clarity through sincere inquiry rather than remaining confused. A good student asks for definitive guidance.",
      "category": "inquiry",
      "relevance": 85
    },
    {
      "id": 303,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "3",
      "sanskrit": "श्रीभगवानुवाच लोकेऽस्मिन्द्विविधा निष्ठा पुरा प्रोक्ता मयानघ। ज्ञानयोगेन साङ्ख्यानां कर्मयोगेन योगिनाम्॥",
      "transliteration": "śrī-bhagavān uvāca loke 'smin dvi-vidhā niṣṭhā purā proktā mayānagha | jñāna-yogena sāṅkhyānāṁ karma-yogena yoginām ||",
      "translation": "I told thee, blameless Lord! there be two paths shown to this world; two schools of wisdom. First the Sankhya's, which doth save in way of works prescribed by reason; next, the Yog, which bids attain by meditation, spiritually.",
      "teaching": "Krishna clarifies that there are two valid spiritual paths: the path of knowledge (jnana-yoga) for contemplatives, and the path of action (karma-yoga) for those engaged in the world. Both lead to the same goal.",
      "category": "philosophy",
      "relevance": 92
    },
    {
      "id": 304,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "4",
      "sanskrit": "न कर्मणामनारम्भान्नैष्कर्म्यं पुरुषोऽश्नुते। न च संन्यसनादेव सिद्धिं समधिगच्छति॥",
      "transliteration": "na karmaṇām anārambhān naiṣkarmyaṁ puruṣo 'śnute | na ca sannyasanād eva siddhiṁ samadhigacchati ||",
      "translation": "Yet these are one! No man shall 'scape from act by shunning action; nay, and none shall come by mere renouncements unto perfectness.",
      "teaching": "Simply avoiding action doesn't lead to freedom from action's bondage, nor does external renunciation alone bring spiritual perfection. True freedom comes from right understanding and right action.",
      "category": "action",
      "relevance": 90
    },
    {
      "id": 305,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "5",
      "sanskrit": "न हि कश्चित्क्षणमपि जातु तिष्ठत्यकर्मकृत्। कार्यते ह्यवशः कर्म सर्वः प्रकृतिजैर्गुणैः॥",
      "transliteration": "na hi kaścit kṣaṇam api jātu tiṣṭhaty akarma-kṛt | kāryate hy avaśaḥ karma sarvaḥ prakṛti-jair guṇaiḥ ||",
      "translation": "Nay, and no jot of time, at any time, rests any actionless; his nature's law compels him, even unwilling, into act.",
      "teaching": "Complete inaction is impossible - everyone is constantly compelled to act by the forces of material nature. Even breathing, thinking, and bodily functions are actions. The goal is right action, not no action.",
      "category": "action",
      "relevance": 88
    },
    {
      "id": 306,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "6",
      "sanskrit": "कर्मेन्द्रियाणि संयम्य य आस्ते मनसा स्मरन्। इन्द्रियार्थान्विमूढात्मा मिथ्याचारः स उच्यते॥",
      "transliteration": "karmendriyāṇi saṁyamya ya āste manasā smaran | indriyārthān vimūḍhātmā mithyācāraḥ sa ucyate ||",
      "translation": "For thought is act in fancy. He who sits suppressing all the instruments of flesh, yet in his idle heart thinking on them, plays the inept and guilty hypocrite.",
      "teaching": "A person who restrains the senses externally but mentally dwells on sense objects is a hypocrite. True renunciation involves both external control and internal purity of thought.",
      "category": "hypocrisy",
      "relevance": 86
    },
    {
      "id": 307,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "7",
      "sanskrit": "यस्त्विन्द्रियाणि मनसा नियम्यारभतेऽर्जुन। कर्मेन्द्रियैः कर्मयोगमसक्तः स विशिष्यते॥",
      "transliteration": "yas tv indriyāṇi manasā niyamyārabhate 'rjuna | karmendriyaiḥ karma-yogam asaktaḥ sa viśiṣyate ||",
      "translation": "But he who, with strong body serving mind, gives up his mortal powers to worthy work, not seeking gain, Arjuna! such an one is honourable.",
      "teaching": "Superior is the person who controls the senses with the mind and engages in karma-yoga with the working senses, without attachment. This integration of inner control with outer service is the ideal.",
      "category": "action",
      "relevance": 91
    },
    {
      "id": 308,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "8",
      "sanskrit": "नियतं कुरु कर्म त्वं कर्म ज्यायो ह्यकर्मणः। शरीरयात्रापि च ते न प्रसिद्ध्येदकर्मणः॥",
      "transliteration": "niyataṁ kuru karma tvaṁ karma jyāyo hy akarmaṇaḥ | śarīra-yātrāpi ca te na prasiddhyed akarmaṇaḥ ||",
      "translation": "Do thine allotted task! Work is more excellent than idleness; the body's life proceeds not, lacking work.",
      "teaching": "Perform your prescribed duties, for action is better than inaction. Even maintaining your body would be impossible without work. Purposeful action is necessary for both material and spiritual life.",
      "category": "duty",
      "relevance": 89
    },
    {
      "id": 309,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "9",
      "sanskrit": "यज्ञार्थात्कर्मणोऽन्यत्र लोकोऽयं कर्मबन्धनः। तदर्थं कर्म कौन्तेय मुक्तसङ्गः समाचर॥",
      "transliteration": "yajñārthāt karmaṇo 'nyatra loko 'yaṁ karma-bandhanaḥ | tad-arthaṁ karma kaunteya mukta-saṅgaḥ samācara ||",
      "translation": "There is a task of holiness to do, unlike world-binding toil, which bindeth not the faithful soul; such earthly duty do free from desire, and thou shalt well perform thy heavenly purpose.",
      "teaching": "Work performed as sacrifice (yajna) liberates, while work done for personal gain binds us. When we dedicate our actions to a higher purpose, work becomes a spiritual practice rather than bondage.",
      "category": "sacrifice",
      "relevance": 94
    },
    {
      "id": 310,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "10",
      "sanskrit": "सहयज्ञाः प्रजाः सृष्ट्वा पुरोवाच प्रजापतिः। अनेन प्रसविष्यध्वमेष वोऽस्त्विष्टकामधुक्॥",
      "transliteration": "saha-yajñāḥ prajāḥ sṛṣṭvā purovāca prajāpatiḥ | anena prasaviṣyadhvam eṣa vo 'stv iṣṭa-kāma-dhuk ||",
      "translation": "Spake Prajapati—in the beginning, when all men were made, and, with mankind, the sacrifice—'Do this! Work! sacrifice! Increase and multiply with sacrifice! This shall be Kamaduk, your 'Cow of Plenty,' giving back her milk of all abundance.'",
      "teaching": "The creator established sacrifice as the principle of cosmic harmony. When we live in the spirit of giving and service rather than taking and exploitation, abundance flows naturally.",
      "category": "sacrifice",
      "relevance": 87
    },
    {
      "id": 311,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "11",
      "sanskrit": "देवान्भावयतानेन ते देवा भावयन्तु वः। परस्परं भावयन्तः श्रेयः परमवाप्स्यथ॥",
      "transliteration": "devān bhāvayatānena te devā bhāvayantu vaḥ | parasparaṁ bhāvayantaḥ śreyaḥ param avāpsyatha ||",
      "translation": "Worship the gods thereby; the gods shall yield thee grace. Those meats ye crave the gods will grant to Labour, when it pays tithes in the altar-flame.",
      "teaching": "Through sacrifice, we nourish the cosmic forces (devas) that sustain life, and they in turn provide for our needs. This mutual nourishment creates harmony between humanity and nature.",
      "category": "sacrifice",
      "relevance": 83
    },
    {
      "id": 312,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "12",
      "sanskrit": "इष्टान्भोगान्हि वो देवा दास्यन्ते यज्ञभाविताः। तैर्दत्तानप्रदायैभ्यो यो भुङ्क्ते स्तेन एव सः॥",
      "transliteration": "iṣṭān bhogān hi vo devā dāsyante yajña-bhāvitāḥ | tair dattān apradāyaibhyo yo bhuṅkte stena eva saḥ ||",
      "translation": "But if one eats fruits of the earth, rendering to kindly Heaven no gift of toil, that thief steals from his world.",
      "teaching": "Those who enjoy the gifts of nature and society without giving back in service are essentially thieves. True prosperity comes from contributing to the welfare of all, not just consuming.",
      "category": "service",
      "relevance": 85
    },
    {
      "id": 313,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "13",
      "sanskrit": "यज्ञशिष्टाशिनः सन्तो मुच्यन्ते सर्वकिल्बिषैः। भुञ्जते ते त्वघं पापा ये पचन्त्यात्मकारणात्॥",
      "transliteration": "yajña-śiṣṭāśinaḥ santo mucyante sarva-kilbiṣaiḥ | bhuñjate te tv aghaṁ pāpā ye pacanty ātma-kāraṇāt ||",
      "translation": "Who eat of food after their sacrifice are quit of fault, but they that spread a feast all for themselves, eat sin and drink of sin.",
      "teaching": "The righteous who eat the remnants of sacrifice are freed from all sins, but the selfish who cook only for themselves eat sin. Sharing and gratitude purify our enjoyment of life's gifts.",
      "category": "sacrifice",
      "relevance": 84
    },
    {
      "id": 314,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "14",
      "sanskrit": "अन्नाद्भवन्ति भूतानि पर्जन्यादन्नसम्भवः। यज्ञाद्भवति पर्जन्यो यज्ञः कर्मसमुद्भवः॥",
      "transliteration": "annād bhavanti bhūtāni parjanyād anna-sambhavaḥ | yajñād bhavati parjanyo yajñaḥ karma-samudbhavaḥ ||",
      "translation": "By food the living live; food comes of rain, and rain comes by the pious sacrifice, and sacrifice is paid with tithes of toil.",
      "teaching": "Krishna explains the cosmic cycle: beings depend on food, food comes from rain, rain from sacrifice, sacrifice from action. This shows how all life is interconnected through cycles of giving and receiving.",
      "category": "cycles",
      "relevance": 88
    },
    {
      "id": 315,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "15",
      "sanskrit": "कर्म ब्रह्मोद्भवं विद्धि ब्रह्माक्षरसमुद्भवम्। तस्मात्सर्वगतं ब्रह्म नित्यं यज्ञे प्रतिष्ठितम्॥",
      "transliteration": "karma brahmodbhavaṁ viddhi brahmākṣara-samudbhavam | tasmāt sarva-gataṁ brahma nityaṁ yajñe pratiṣṭhitam ||",
      "translation": "Thus action is of Brahma, who is One, the Only, All-pervading; at all times present in sacrifice.",
      "teaching": "Action originates from Brahma (the Vedas/Divine), which comes from the imperishable Supreme. Therefore, the all-pervading Brahman is always present in sacrifice, making all righteous action sacred.",
      "category": "philosophy",
      "relevance": 86
    },
  {
    "id": 316,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "16",
    "sanskrit": "एवं प्रवर्तितं चक्रं नानुवर्तयतीह यः। अघायुरिन्द्रियारामो मोघं पार्थ स जीवति॥",
    "transliteration": "evaṁ pravartitaṁ cakraṁ nānuvartayatīha yaḥ | aghāyur indriyārāmo moghaṁ pārtha sa jīvati ||",
    "translation": "He that abstains to help the rolling wheels of this great world, glutting his idle sense, lives a lost life, shameful and vain. Existing for himself, self-concentrated, serving self alone, no part hath he in aught; nothing achieved, nought wrought or unwrought toucheth him; no hope of help for all the living things of earth depends from him.",
    "teaching": "One who does not follow this cycle of sacrifice, who lives only for sensory pleasure, lives uselessly. Such a life is wasted because it contributes nothing to the cosmic order or the welfare of others.",
    "category": "duty",
    "relevance": 87
  },
  {
    "id": 317,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "17",
    "sanskrit": "यस्त्वात्मरतिरेव स्यादात्मतृप्तश्च मानवः। आत्मन्येव च सन्तुष्टस्तस्य कार्यं न विद्यते॥",
    "transliteration": "yas tv ātma-ratir eva syād ātma-tṛptaś ca mānavaḥ | ātmany eva ca santuṣṭas tasya kāryaṁ na vidyate ||",
    "translation": "Therefore, thy task prescribed with spirit unattached gladly perform, since in performance of plain duty man mounts to his highest bliss.",
    "teaching": "However, for one who rejoices only in the Self, who is satisfied in the Self, and who is content in the Self alone - for such a person there is no duty. They have transcended obligatory action through self-realization.",
    "category": "self-realization",
    "relevance": 85
  },
  {
    "id": 318,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "18",
    "sanskrit": "नैव तस्य कृतेनार्थो नाकृतेनेह कश्चन। न चास्य सर्वभूतेषु कश्चिदर्थव्यपाश्रयः॥",
    "transliteration": "naiva tasya kṛtenārtho nākṛteneha kaścana | na cāsya sarva-bhūteṣu kaścid artha-vyapāśrayaḥ ||",
    "translation": "By works alone Janak and ancient saints reached blessedness! Moreover, for the upholding of thy kind, action thou should'st embrace.",
    "teaching": "A self-realized person has nothing to gain from action or inaction in this world, and has no need to depend on any being. Yet even such beings may act for the welfare of the world.",
    "category": "self-realization",
    "relevance": 82
  },
  {
    "id": 319,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "19",
    "sanskrit": "तस्मादसक्तः सततं कार्यं कर्म समाचर। असक्तो ह्याचरन्कर्म परमाप्नोति पूरुषः॥",
    "transliteration": "tasmād asaktaḥ satataṁ kāryaṁ karma samācara | asakto hy ācaran karma param āpnoti pūruṣaḥ ||",
    "translation": "What the wise choose the unwise people take; what best men do the multitude will follow.",
    "teaching": "Therefore, always perform your duty efficiently and without attachment. By working without attachment one attains the Supreme. This is the path for those still progressing spiritually.",
    "category": "action",
    "relevance": 91
  },
  {
    "id": 320,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "20",
    "sanskrit": "कर्मणैव हि संसिद्धिमास्थिता जनकादयः। लोकसंग्रहमेवापि सम्पश्यन्कर्तुमर्हसि॥",
    "transliteration": "karmaṇaiva hi saṁsiddhim āsthitā janakādayaḥ | loka-saṅgraham evāpi sampaśyan kartum arhasi ||",
    "translation": "By works alone Janak and ancient saints reached blessedness! Moreover, for the upholding of thy kind, action thou should'st embrace.",
    "teaching": "King Janaka and other enlightened rulers attained perfection through action. Even considering the welfare of the world, you should perform your duty. Great souls act as examples for others.",
    "category": "example",
    "relevance": 88
  },
  {
    "id": 321,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "21",
    "sanskrit": "यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः। स यत्प्रमाणं कुरुते लोकस्तदनुवर्तते॥",
    "transliteration": "yad yad ācarati śreṣṭhas tat tad evetaro janaḥ | sa yat pramāṇaṁ kurute lokas tad anuvartate ||",
    "translation": "What the wise choose the unwise people take; what best men do the multitude will follow.",
    "teaching": "Whatever action a great person performs, common people follow. Whatever standards they set by exemplary acts, the world pursues. Leaders have a responsibility to set the right example.",
    "category": "leadership",
    "relevance": 89
  },
  {
    "id": 322,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "22",
    "sanskrit": "न मे पार्थास्ति कर्तव्यं त्रिषु लोकेषु किञ्चन। नानवाप्तमवाप्तव्यं वर्त एव च कर्मणि॥",
    "transliteration": "na me pārthāsti kartavyaṁ triṣu lokeṣu kiñcana | nānavāptam avāptavyaṁ varta eva ca karmaṇi ||",
    "translation": "Look on me, thou Son of Pritha! in the three wide worlds I am not bound to any toil, no height awaits to scale, no gift remains to gain, yet I act here!",
    "teaching": "Krishna personally has nothing to gain in all three worlds, yet He continues to act. This demonstrates that enlightened action is not motivated by personal need but by universal welfare.",
    "category": "example",
    "relevance": 90
  },
  {
    "id": 323,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "23",
    "sanskrit": "यदि ह्यहं न वर्तेयं जातु कर्मण्यतन्द्रितः। मम वर्त्मानुवर्तन्ते मनुष्याः पार्थ सर्वशः॥",
    "transliteration": "yadi hy ahaṁ na varteyaṁ jātu karmaṇy atandritaḥ | mama vartmānuvartante manuṣyāḥ pārtha sarvaśaḥ ||",
    "translation": "And, if I acted not—earnest and watchful—those that look to me for guidance, sinking back to sloth again because I slumbered, would decline from good, and I should break earth's order and commit her offspring unto ruin, Bharata!",
    "teaching": "If Krishna did not engage in action, people would follow His example and neglect their duties, leading to societal chaos. This shows the responsibility of those who serve as role models.",
    "category": "leadership",
    "relevance": 86
  },
  {
    "id": 324,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "24",
    "sanskrit": "उत्सीदेयुरिमे लोका न कुर्यां कर्म चेदहम्। सङ्करस्य च कर्ता स्यामुपहन्यामिमाः प्रजाः॥",
    "transliteration": "utsīdeyur ime lokā na kuryāṁ karma ced aham | saṅkarasya ca kartā syām upahanyām imāḥ prajāḥ ||",
    "translation": "Even as the unknowing toil, wedded to sense, so let the enlightened toil, sense-freed, but set to bring the world deliverance, and its bliss; not sowing in those simple, busy hearts seed of despair.",
    "teaching": "If Krishna ceased to work, the worlds would perish. He would be the cause of confusion and would destroy all these people. Even the enlightened must act to maintain cosmic and social order.",
    "category": "duty",
    "relevance": 87
  },
  {
    "id": 325,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "25",
    "sanskrit": "सक्ताः कर्मण्यविद्वांसो यथा कुर्वन्ति भारत। कुर्याद्विद्वांस्तथासक्तश्चिकीर्षुर्लोकसंग्रहम्॥",
    "transliteration": "saktāḥ karmaṇy avidvāṁso yathā kurvanti bhārata | kuryād vidvāṁs tathāsaktaś cikīrṣur loka-saṅgraham ||",
    "translation": "Yea! let each play his part in all he finds to do, with unyoked soul. All things are everywhere by Nature wrought in interaction of the qualities.",
    "teaching": "As the ignorant act with attachment to their work, the wise should act without attachment, desiring to lead people on the right path. The wise work for the welfare of the world.",
    "category": "leadership",
    "relevance": 88
  },
  {
    "id": 326,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "26",
    "sanskrit": "न बुद्धिभेदं जनयेदज्ञानां कर्मसङ्गिनाम्। जोषयेत्सर्वकर्माणि विद्वान्युक्तः समाचरन्॥",
    "transliteration": "na buddhi-bhedaṁ janayed ajñānāṁ karma-saṅginām | joṣayet sarva-karmāṇi vidvān yuktaḥ samācaran ||",
    "translation": "The fool, cheated by self, thinks, 'This I did' and 'That I wrought;' but—ah, thou strong-armed Prince!—a better-lessoned mind, knowing the play of visible things within the world of sense, and how the qualities must qualify, standeth aloof even from his acts.",
    "teaching": "The wise should not unsettle the minds of the ignorant who are attached to action. Instead, they should engage them in all activities while themselves acting with devotion and proper understanding.",
    "category": "wisdom",
    "relevance": 85
  },
  {
    "id": 327,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "27",
    "sanskrit": "प्रकृतेः क्रियमाणानि गुणैः कर्माणि सर्वशः। अहङ्कारविमूढात्मा कर्ताहमिति मन्यते॥",
    "transliteration": "prakṛteḥ kriyamāṇāni guṇaiḥ karmāṇi sarvaśaḥ | ahaṅkāra-vimūḍhātmā kartāham iti manyate ||",
    "translation": "All things are everywhere by Nature wrought in interaction of the qualities. The fool, cheated by self, thinks, 'This I did' and 'That I wrought.'",
    "teaching": "All actions are performed by the modes of material nature, but one deluded by false ego thinks 'I am the doer.' Understanding that nature acts while the Self observes brings freedom.",
    "category": "philosophy",
    "relevance": 92
  },
  {
    "id": 328,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "28",
    "sanskrit": "तत्त्ववित्तु महाबाहो गुणकर्मविभागयोः। गुणा गुणेषु वर्तन्त इति मत्वा न सज्जते॥",
    "transliteration": "tattva-vit tu mahā-bāho guṇa-karma-vibhāgayoḥ | guṇā guṇeṣu vartanta iti matvā na sajjate ||",
    "translation": "But, ah, thou strong-armed Prince!—a better-lessoned mind, knowing the play of visible things within the world of sense, and how the qualities must qualify, standeth aloof even from his acts.",
    "teaching": "One who knows the truth about the divisions of the modes and actions understands that it is the modes acting upon modes. Such a person does not become attached, seeing the Self as separate from action.",
    "category": "detachment",
    "relevance": 90
  },
  {
    "id": 329,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "29",
    "sanskrit": "प्रकृतेर्गुणसम्मूढाः सज्जन्ते गुणकर्मसु। तानकृत्स्नविदो मन्दान्कृत्स्नविन्न विचालयेत्॥",
    "transliteration": "prakṛter guṇa-sammūḍhāḥ sajjante guṇa-karmasu | tān akṛtsna-vido mandān kṛtsna-vin na vicālayet ||",
    "translation": "Th' untaught live mixed with them, knowing not Nature's way, of highest aims unwitting, slow and dull. Those make thou not to stumble, having the light.",
    "teaching": "Those deluded by the modes of nature become attached to the activities of the modes. The wise should not disturb the minds of the ignorant who have incomplete knowledge, but should engage them gradually.",
    "category": "compassion",
    "relevance": 84
  },
  {
    "id": 330,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "30",
    "sanskrit": "मयि सर्वाणि कर्माणि संन्यस्याध्यात्मचेतसा। निराशीर्निर्ममो भूत्वा युध्यस्व विगतज्वरः॥",
    "transliteration": "mayi sarvāṇi karmāṇi sannyasyādhyātma-cetasā | nirāśīr nirmamo bhūtvā yudhyasva vigata-jvaraḥ ||",
    "translation": "But all thy dues discharging, for My sake, with meditation centred inwardly, seeking no profit, satisfied, serene, heedless of issue—fight!",
    "teaching": "Surrendering all actions to Me with full consciousness of the Self, being free from desire and possessiveness, and cured of mental fever - fight! This is the essence of karma-yoga: dedicated action without attachment.",
    "category": "devotion",
    "relevance": 94
  },
  {
    "id": 331,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "31",
    "sanskrit": "ये मे मतमिदं नित्यमनुतिष्ठन्ति मानवाः। श्रद्धावन्तोऽनसूयन्तो मुच्यन्ते तेऽपि कर्मभिः॥",
    "transliteration": "ye me matam idaṁ nityam anutiṣṭhanti mānavāḥ | śraddhāvanto 'nasūyanto mucyante te 'pi karmabhiḥ ||",
    "translation": "They who shall keep my ordinance thus, the wise and willing hearts, have quittance from all issue of their acts.",
    "teaching": "Those who regularly follow this teaching of Mine with faith and without envy are freed from the bondage of actions. Simple faith and sincere practice lead to liberation.",
    "category": "faith",
    "relevance": 89
  },
  {
    "id": 332,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "32",
    "sanskrit": "ये त्वेतदभ्यसूयन्तो नानुतिष्ठन्ति मे मतम्। सर्वज्ञानविमूढांस्तान्विद्धि नष्टानचेतसः॥",
    "transliteration": "ye tv etad abhyasūyanto nānutiṣṭhanti me matam | sarva-jñāna-vimūḍhāṁs tān viddhi naṣṭān acetasaḥ ||",
    "translation": "But those who disregard My ordinance, thinking they know, know nought, and fall to loss, confused and foolish.",
    "teaching": "But those who find fault with My teaching and do not practice it are deluded in all knowledge, devoid of discrimination, and doomed to ignorance and bondage. Criticism without practice leads nowhere.",
    "category": "warning",
    "relevance": 83
  },
  {
    "id": 333,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "33",
    "sanskrit": "सदृशं चेष्टते स्वस्याः प्रकृतेर्ज्ञानवानपि। प्रकृतिं यान्ति भूतानि निग्रहः किं करिष्यति॥",
    "transliteration": "sadṛśaṁ ceṣṭate svasyāḥ prakṛter jñānavān api | prakṛtiṁ yānti bhūtāni nigrahaḥ kiṁ kariṣyati ||",
    "translation": "'Sooth, the instructed one doth of his kind, following what fits him most: and lower creatures of their kind; in vain contending 'gainst the law.",
    "teaching": "Even the wise act according to their nature; all beings follow their nature. What can mere repression accomplish? We must work with our nature, refining it through practice rather than fighting against it.",
    "category": "nature",
    "relevance": 87
  },
  {
    "id": 334,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "34",
    "sanskrit": "इन्द्रियस्येन्द्रियस्यार्थे रागद्वेषौ व्यवस्थितौ। तयोर्न वशमागच्छेत्तौ ह्यस्य परिपन्थिनौ॥",
    "transliteration": "indriyasyendriyasyārthe rāga-dveṣau vyavasthitau | tayor na vaśam āgacchet tau hy asya paripanthinau ||",
    "translation": "Needs must it be the objects of the sense will stir the sense to like and dislike, yet th' enlightened man yields not to these, knowing them enemies.",
    "teaching": "Attraction and aversion for sense objects are natural, but one should not come under their control, for they are obstacles on the path. We must acknowledge these tendencies while not being controlled by them.",
    "category": "self-control",
    "relevance": 91
  },
  {
    "id": 335,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "35",
    "sanskrit": "श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात्। स्वधर्मे निधनं श्रेयः परधर्मो भयावहः॥",
    "transliteration": "śreyān sva-dharmo viguṇaḥ para-dharmāt sv-anuṣṭhitāt | sva-dharme nidhanaṁ śreyaḥ para-dharmo bhayāvahaḥ ||",
    "translation": "Finally, this is better, that one do his own task as he may, even though he fail, than take tasks not his own, though they seem good. To die performing duty is no ill; but who seeks other roads shall wander still.",
    "teaching": "It is better to perform one's own duty imperfectly than to perform another's duty perfectly. Even death in one's own duty is preferable; another's duty brings danger. Each person has their unique path.",
    "category": "duty",
    "relevance": 95
  },
  {
    "id": 336,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "36",
    "sanskrit": "अर्जुन उवाच अथ केन प्रयुक्तोऽयं पापं चरति पूरुषः। अनिच्छन्नपि वार्ष्णेय बलादिव नियोजितः॥",
    "transliteration": "arjuna uvāca atha kena prayukto 'yaṁ pāpaṁ carati pūruṣaḥ | anicchann api vārṣṇeya balād iva niyojitaḥ ||",
    "translation": "Yet tell me, Teacher! by what force doth man go to his ill, unwilling; as if one pushed him that evil path?",
    "teaching": "Arjuna asks the crucial question: What compels a person to commit sin even against their will, as if forced? This shows the recognition that we often act against our better judgment.",
    "category": "inquiry",
    "relevance": 88
  },
  {
    "id": 337,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "37",
    "sanskrit": "श्रीभगवानुवाच काम एष क्रोध एष रजोगुणसमुद्भवः। महाशनो महापाप्मा विद्ध्येनमिह वैरिणम्॥",
    "transliteration": "śrī-bhagavān uvāca kāma eṣa krodha eṣa rajo-guṇa-samudbhavaḥ | mahāśano mahā-pāpmā viddhy enam iha vairiṇam ||",
    "translation": "Kama it is! Passion it is! born of the Darknesses, which pusheth him. Mighty of appetite, sinful, and strong is this!—man's enemy!",
    "teaching": "The Supreme Lord said: It is lust and anger, born from the mode of passion, which are all-devouring and greatly sinful. Know this to be the enemy. Desire transforms into anger when frustrated.",
    "category": "psychology",
    "relevance": 96
  },
  {
    "id": 338,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "38",
    "sanskrit": "धूमेनाव्रियते वह्निर्यथादर्शो मलेन च। यथोल्बेनावृतो गर्भस्तथा तेनेदमावृतम्॥",
    "transliteration": "dhūmenāvriyate vahnir yathādarśo malena ca | yatholbenāvṛto garbhas tathā tenedam āvṛtam ||",
    "translation": "As smoke blots the white fire, as clinging rust mars the bright mirror, as the womb surrounds the babe unborn, so is the world of things foiled, soiled, enclosed in this desire of flesh.",
    "teaching": "As fire is covered by smoke, a mirror by dust, and an embryo by the womb, so is knowledge covered by desire. These analogies show different degrees of obscuration - some easier to remove than others.",
    "category": "psychology",
    "relevance": 89
  },
  {
    "id": 339,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "39",
    "sanskrit": "आवृतं ज्ञानमेतेन ज्ञानिनो नित्यवैरिणा। कामरूपेण कौन्तेय दुष्पूरेणानलेन च॥",
    "transliteration": "āvṛtaṁ jñānam etena jñānino nitya-vairiṇā | kāma-rūpeṇa kaunteya duṣpūreṇānalena ca ||",
    "translation": "The wise fall, caught in it; the unresting foe it is of wisdom, wearing countless forms, fair but deceitful, subtle as a flame.",
    "teaching": "O son of Kunti, knowledge is covered by this eternal enemy in the form of insatiable desire, which is like fire. Desire can never be fully satisfied and always seeks more fuel.",
    "category": "psychology",
    "relevance": 92
  },
  {
    "id": 340,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "40",
    "sanskrit": "इन्द्रियाणि मनो बुद्धिरस्याधिष्ठानमुच्यते। एतैर्विमोहयत्येष ज्ञानमावृत्य देहिनम्॥",
    "transliteration": "indriyāṇi mano buddhir asyādhiṣṭhānam ucyate | etair vimohayaty eṣa jñānam āvṛtya dehinam ||",
    "translation": "Sense, mind, and reason—these, O Kunti's Son! are booty for it; in its play with these it maddens man, beguiling, blinding him.",
    "teaching": "The senses, mind, and intelligence are said to be the seats of desire. Through these, desire covers knowledge and deludes the embodied soul. Understanding where desire operates helps us combat it.",
    "category": "psychology",
    "relevance": 90
  },
  {
    "id": 341,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "41",
    "sanskrit": "तस्मात्त्वमिन्द्रियाण्यादौ नियम्य भरतर्षभ। पाप्मानं प्रजहि ह्येनं ज्ञानविज्ञाननाशनम्॥",
    "transliteration": "tasmāt tvam indriyāṇy ādau niyamya bharatarṣabha | pāpmānaṁ prajahi hy enaṁ jñāna-vijñāna-nāśanam ||",
    "translation": "Therefore, thou noblest child of Bharata! govern thy heart! Constrain th' entangled sense! Resist the false, soft sinfulness which saps knowledge and judgment!",
    "teaching": "Therefore, O best of the Bharatas, control your senses from the very beginning and slay this sinful enemy which destroys both knowledge and realization. Self-control is the first step to victory over desire.",
    "category": "self-control",
    "relevance": 93
  },
  {
    "id": 342,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "42",
    "sanskrit": "इन्द्रियाणि पराण्याहुरिन्द्रियेभ्यः परं मनः। मनसस्तु परा बुद्धिर्यो बुद्धेः परतस्तु सः॥",
    "transliteration": "indriyāṇi parāṇy āhur indriyebhyaḥ paraṁ manaḥ | manasas tu parā buddhir yo buddheḥ paratas tu saḥ ||",
    "translation": "Yea, the world is strong, but what discerns it stronger, and the mind strongest; and high o'er all the ruling Soul.",
    "teaching": "The senses are said to be superior to the body; the mind is superior to the senses; the intelligence is superior to the mind; and the soul is superior to the intelligence. Understanding this hierarchy helps us gain mastery.",
    "category": "philosophy",
    "relevance": 91
  },
  {
    "id": 343,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 3",
    "verse": "43",
    "sanskrit": "एवं बुद्धेः परं बुद्ध्वा संस्तभ्यात्मानमात्मना। जहि शत्रुं महाबाहो कामरूपं दुरासदम्॥",
    "transliteration": "evaṁ buddheḥ paraṁ buddhvā saṁstabhyātmānam ātmanā | jahi śatruṁ mahā-bāho kāma-rūpaṁ durāsadam ||",
    "translation": "Wherefore, perceiving Him who reigns supreme, put forth full force of Soul in thy own soul! Fight! vanquish foes and doubts, dear Hero! slay what haunts thee in fond shapes, and would betray!",
    "teaching": "Thus knowing the soul to be superior to the intelligence, O mighty-armed, stabilize the self by the self and conquer this formidable enemy in the form of desire. Use your higher nature to control your lower nature.",
    "category": "victory",
    "relevance": 94
  },
  {
    "id": 401,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "1",
    "sanskrit": "श्रीभगवानुवाच इमं विवस्वते योगं प्रोक्तवानहमव्ययम्। विवस्वान्मनवे प्राह मनुरिक्ष्वाकवेऽब्रवीत्॥",
    "transliteration": "śrī-bhagavān uvāca imaṁ vivasvate yogaṁ proktavān aham avyayam | vivasvān manave prāha manur ikṣvākave 'bravīt ||",
    "translation": "This deathless Yoga, this deep union, I taught Vivaswata, the Lord of Light; Vivaswata to Manu gave it; he to Ikshwaku; so passed it down the line of all my royal Rishis.",
    "teaching": "Krishna reveals that this ancient wisdom was first taught to Vivaswata (the sun-god), then passed through a lineage of enlightened kings. Spiritual knowledge has an ancient, sacred lineage that preserves its purity.",
    "category": "knowledge",
    "relevance": 88
  },
  {
    "id": 402,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "2",
    "sanskrit": "एवं परम्पराप्राप्तमिमं राजर्षयो विदुः। स कालेनेह महता योगो नष्टः परन्तप॥",
    "transliteration": "evaṁ paramparā-prāptam imaṁ rājarṣayo viduḥ | sa kāleneha mahatā yogo naṣṭaḥ parantapa ||",
    "translation": "Then, with years, the truth grew dim and perished, noble Prince! Now once again to thee it is declared—this ancient lore, this mystery supreme—seeing I find thee votary and friend.",
    "teaching": "The royal sages understood this knowledge received through disciplic succession. But over time this yoga was lost. Krishna is now re-establishing it through Arjuna. Truth must be periodically renewed.",
    "category": "knowledge",
    "relevance": 86
  },
  {
    "id": 403,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "3",
    "sanskrit": "स एवायं मया तेऽद्य योगः प्रोक्तः पुरातनः। भक्तोऽसि मे सखा चेति रहस्यं ह्येतदुत्तमम्॥",
    "transliteration": "sa evāyaṁ mayā te 'dya yogaḥ proktaḥ purātanaḥ | bhakto 'si me sakhā ceti rahasyaṁ hy etad uttamam ||",
    "translation": "Seeing I find thee votary and friend.",
    "teaching": "That same ancient yoga has been declared to you by Me today because you are My devotee and friend. This is a supreme secret. Spiritual knowledge is revealed to those who have devotion and friendship with the Divine.",
    "category": "devotion",
    "relevance": 90
  },
  {
    "id": 404,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "4",
    "sanskrit": "अर्जुन उवाच अपरं भवतो जन्म परं जन्म विवस्वतः। कथमेतद्विजानीयां त्वमादौ प्रोक्तवानिति॥",
    "transliteration": "arjuna uvāca aparaṁ bhavato janma paraṁ janma vivasvataḥ | katham etad vijānīyāṁ tvam ādau proktavān iti ||",
    "translation": "Thy birth, dear Lord, was in these later days, and bright Vivaswata's preceded time! How shall I comprehend this thing thou sayest, 'From the beginning it was I who taught?'",
    "teaching": "Arjuna's logical question: How could you have taught this to Vivaswata who lived in ancient times when you were born recently? This sets up Krishna's revelation of His divine nature.",
    "category": "inquiry",
    "relevance": 87
  },
  {
    "id": 405,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "5",
    "sanskrit": "श्रीभगवानुवाच बहूनि मे व्यतीतानि जन्मानि तव चार्जुन। तान्यहं वेद सर्वाणि न त्वं वेत्थ परन्तप॥",
    "transliteration": "śrī-bhagavān uvāca bahūni me vyatītāni janmāni tava cārjuna | tāny ahaṁ veda sarvāṇi na tvaṁ vettha parantapa ||",
    "translation": "Manifold the renewals of my birth have been, Arjuna! and of thy births, too! But mine I know, and thine thou knowest not, O Slayer of thy Foes!",
    "teaching": "The Supreme Lord said: Many births of Mine have passed, and many of yours, O Arjuna. I know them all, but you do not. The Divine has complete knowledge of all incarnations while we remain forgetful.",
    "category": "incarnation",
    "relevance": 92
  },
  {
    "id": 406,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "6",
    "sanskrit": "अजोऽपि सन्नव्ययात्मा भूतानामीश्वरोऽपि सन्। प्रकृतिं स्वामधिष्ठाय सम्भवाम्यात्ममायया॥",
    "transliteration": "ajo 'pi sann avyayātmā bhūtānām īśvaro 'pi san | prakṛtiṁ svām adhiṣṭhāya sambhavāmy ātma-māyayā ||",
    "translation": "Albeit I be unborn, undying, indestructible, the Lord of all things living; not the less—by Maya, by my magic which I stamp on floating Nature-forms, the primal vast—I come, and go, and come.",
    "teaching": "Though I am unborn and imperishable, and though I am the Lord of all beings, I appear in My original form by controlling My own material nature through My internal potency. The Divine descends by His own will.",
    "category": "incarnation",
    "relevance": 94
  },
  {
    "id": 407,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "7",
    "sanskrit": "यदा यदा हि धर्मस्य ग्लानिर्भवति भारत। अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥",
    "transliteration": "yadā yadā hi dharmasya glānir bhavati bhārata | abhyutthānam adharmasya tadātmānaṁ sṛjāmy aham ||",
    "translation": "When Righteousness declines, O Bharata! when Wickedness is strong, I rise, from age to age, and take visible shape, and move a man with men.",
    "teaching": "Whenever there is a decline of righteousness and a rise of unrighteousness, O Bharata, then I manifest Myself. This famous verse explains why divine incarnations occur - to restore dharma when it declines.",
    "category": "incarnation",
    "relevance": 98
  },
  {
    "id": 408,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "8",
    "sanskrit": "परित्राणाय साधूनां विनाशाय च दुष्कृताम्। धर्मसंस्थापनार्थाय सम्भवामि युगे युगे॥",
    "transliteration": "paritrāṇāya sādhūnāṁ vināśāya ca duṣkṛtām | dharma-saṁsthāpanārthāya sambhavāmi yuge yuge ||",
    "translation": "Succouring the good, thrusting the evil back, and setting Virtue on her seat again.",
    "teaching": "For the protection of the good, the destruction of the wicked, and the establishment of righteousness, I appear age after age. The Divine has three purposes: protect devotees, defeat evil, and restore dharma.",
    "category": "incarnation",
    "relevance": 97
  },
  {
    "id": 409,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "9",
    "sanskrit": "जन्म कर्म च मे दिव्यमेवं यो वेत्ति तत्त्वतः। त्यक्त्वा देहं पुनर्जन्म नैति मामेति सोऽर्जुन॥",
    "transliteration": "janma karma ca me divyam evaṁ yo vetti tattvataḥ | tyaktvā dehaṁ punar janma naiti mām eti so 'rjuna ||",
    "translation": "Who knows the truth touching my births on earth and my divine work, when he quits the flesh puts on its load no more, falls no more down to earthly birth: to Me he comes, dear Prince!",
    "teaching": "One who knows the transcendental nature of My appearance and activities does not, upon leaving the body, take birth again in this material world, but attains My eternal abode. Understanding God's divine nature leads to liberation.",
    "category": "liberation",
    "relevance": 93
  },
  {
    "id": 410,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "10",
    "sanskrit": "वीतरागभयक्रोधा मन्मया मामुपाश्रिताः। बहवो ज्ञानतपसा पूता मद्भावमागताः॥",
    "transliteration": "vīta-rāga-bhaya-krodhā man-mayā mām upāśritāḥ | bahavo jñāna-tapasā pūtā mad-bhāvam āgatāḥ ||",
    "translation": "Many there be who come! from fear set free, from anger, from desire; keeping their hearts fixed upon me—my Faithful—purified by sacred flame of Knowledge. Such as these mix with my being.",
    "teaching": "Being freed from attachment, fear, and anger, fully absorbed in Me and taking refuge in Me, many persons in the past became purified by knowledge and penance and attained love for Me.",
    "category": "devotion",
    "relevance": 89
  },
  {
    "id": 411,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "11",
    "sanskrit": "ये यथा मां प्रपद्यन्ते तांस्तथैव भजाम्यहम्। मम वर्त्मानुवर्तन्ते मनुष्याः पार्थ सर्वशः॥",
    "transliteration": "ye yathā māṁ prapadyante tāṁs tathaiva bhajāmy aham | mama vartmānuvartante manuṣyāḥ pārtha sarvaśaḥ ||",
    "translation": "Whoso worship me, them I exalt; but all men everywhere shall fall into my path; albeit, those souls which seek reward for works, make sacrifice now, to the lower gods.",
    "teaching": "As people surrender to Me, I reward them accordingly. Everyone follows My path in all respects, O Partha. The Divine reciprocates with each person according to their approach and devotion.",
    "category": "devotion",
    "relevance": 91
  },
  {
    "id": 412,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "12",
    "sanskrit": "काङ्क्षन्तः कर्मणां सिद्धिं यजन्त इह देवताः। क्षिप्रं हि मानुषे लोके सिद्धिर्भवति कर्मजा॥",
    "transliteration": "kāṅkṣantaḥ karmaṇāṁ siddhiṁ yajanta iha devatāḥ | kṣipraṁ hi mānuṣe loke siddhir bhavati karma-jā ||",
    "translation": "I say to thee here have they their reward. But I am He made the Four Castes, and portioned them a place after their qualities and gifts.",
    "teaching": "Those desiring success from their actions worship the demigods, for in this human world success from work comes quickly. Material results come fast through such worship, but they are temporary.",
    "category": "worship",
    "relevance": 84
  },
  {
    "id": 413,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "13",
    "sanskrit": "चातुर्वर्ण्यं मया सृष्टं गुणकर्मविभागशः। तस्य कर्तारमपि मां विद्ध्यकर्तारमव्ययम्॥",
    "transliteration": "cātur-varṇyaṁ mayā sṛṣṭaṁ guṇa-karma-vibhāgaśaḥ | tasya kartāram api māṁ viddhy akartāram avyayam ||",
    "translation": "Yea, I created, the Reposeful; I that live immortally, made all those mortal births: for works soil not my essence, being works wrought uninvolved.",
    "teaching": "The four divisions of human society were created by Me according to the modes of nature and work. Though I am the creator, know Me to be the non-doer and eternal. Social order reflects natural qualities.",
    "category": "philosophy",
    "relevance": 86
  },
  {
    "id": 414,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "14",
    "sanskrit": "न मां कर्माणि लिम्पन्ति न मे कर्मफले स्पृहा। इति मां योऽभिजानाति कर्मभिर्न स बध्यते॥",
    "transliteration": "na māṁ karmāṇi limpanti na me karma-phale spṛhā | iti māṁ yo 'bhijānāti karmabhir na sa badhyate ||",
    "translation": "Who knows me acting thus unchained by action, action binds not him; and, so perceiving, all those saints of old worked, seeking for deliverance.",
    "teaching": "Actions do not bind Me, nor do I have any desire for the fruits of action. One who understands this truth about Me is also not bound by actions. Understanding God's transcendence frees us.",
    "category": "liberation",
    "relevance": 90
  },
  {
    "id": 415,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "15",
    "sanskrit": "एवं ज्ञात्वा कृतं कर्म पूर्वैरपि मुमुक्षुभिः। कुरु कर्मैव तस्मात्त्वं पूर्वैः पूर्वतरं कृतम्॥",
    "transliteration": "evaṁ jñātvā kṛtaṁ karma pūrvair api mumukṣubhiḥ | kuru karmaiva tasmāt tvaṁ pūrvaiḥ pūrvataraṁ kṛtam ||",
    "translation": "Work thou as, in the days gone by, thy fathers did. Thou sayst, perplexed, It hath been asked before by singers and by sages, 'What is act, and what inaction?'",
    "teaching": "Knowing this, the ancient seekers of liberation performed their duties. Therefore, you should also perform your duty, following in the footsteps of the ancients. The wisdom of the ages guides right action.",
    "category": "action",
    "relevance": 87
  },
  {
    "id": 416,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "16",
    "sanskrit": "किं कर्म किमकर्मेति कवयोऽप्यत्र मोहिताः। तत्ते कर्म प्रवक्ष्यामि यज्ज्ञात्वा मोक्ष्यसेऽशुभात्॥",
    "transliteration": "kiṁ karma kim akarmeti kavayo 'py atra mohitāḥ | tat te karma pravakṣyāmi yaj jñātvā mokṣyase 'śubhāt ||",
    "translation": "I will teach thee this, and, knowing, thou shalt learn which work doth save. Needs must one rightly meditate those three—Doing,—not doing,—and undoing.",
    "teaching": "What is action and what is inaction? Even the wise are confused about this. I shall explain action to you, knowing which you will be liberated from inauspiciousness. This is a subtle but crucial distinction.",
    "category": "knowledge",
    "relevance": 89
  },
  {
    "id": 417,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "17",
    "sanskrit": "कर्मणो ह्यपि बोद्धव्यं बोद्धव्यं च विकर्मणः। अकर्मणश्च बोद्धव्यं गहना कर्मणो गतिः॥",
    "transliteration": "karmaṇo hy api boddhavyaṁ boddhavyaṁ ca vikarmaṇaḥ | akarmaṇaś ca boddhavyaṁ gahanā karmaṇo gatiḥ ||",
    "translation": "Here thorny and dark the path is! He who sees how action may be rest, rest action—he is wisest 'mid his kind; he hath the truth! He doeth well, acting or resting.",
    "teaching": "One must understand the nature of action, wrong action, and inaction. The truth about action is profound and difficult to understand. This requires deep discrimination and wisdom.",
    "category": "knowledge",
    "relevance": 88
  },
  {
    "id": 418,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "18",
    "sanskrit": "कर्मण्यकर्म यः पश्येदकर्मणि च कर्म यः। स बुद्धिमान्मनुष्येषु स युक्तः कृत्स्नकर्मकृत्॥",
    "transliteration": "karmaṇy akarma yaḥ paśyed akarmaṇi ca karma yaḥ | sa buddhimān manuṣyeṣu sa yuktaḥ kṛtsna-karma-kṛt ||",
    "translation": "He who sees how action may be rest, rest action—he is wisest 'mid his kind; he hath the truth! He doeth well, acting or resting.",
    "teaching": "One who sees inaction in action, and action in inaction, is intelligent among people and situated in the transcendental position, although engaged in all sorts of activities. True wisdom sees beyond appearances.",
    "category": "wisdom",
    "relevance": 92
  },
  {
    "id": 419,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "19",
    "sanskrit": "यस्य सर्वे समारम्भाः कामसङ्कल्पवर्जिताः। ज्ञानाग्निदग्धकर्माणं तमाहुः पण्डितं बुधाः॥",
    "transliteration": "yasya sarve samārambhāḥ kāma-saṅkalpa-varjitāḥ | jñānāgni-dagdha-karmāṇaṁ tam āhuḥ paṇḍitaṁ budhāḥ ||",
    "translation": "Freed in all his works from prickings of desire, burned clean in act by the white fire of truth, the wise call that man wise; and such an one, renouncing fruit of deeds, always content, always self-satisfying, if he works, doth nothing that shall stain his separate soul.",
    "teaching": "One whose every endeavor is devoid of desire and selfish motive, whose actions are consumed by the fire of knowledge—such a person is called wise by the learned. Knowledge burns away the binding effects of action.",
    "category": "wisdom",
    "relevance": 90
  },
  {
    "id": 420,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "20",
    "sanskrit": "त्यक्त्वा कर्मफलासङ्गं नित्यतृप्तो निराश्रयः। कर्मण्यभिप्रवृत्तोऽपि नैव किञ्चित्करोति सः॥",
    "transliteration": "tyaktvā karma-phalāsaṅgaṁ nitya-tṛpto nirāśrayaḥ | karmaṇy abhipravṛtto 'pi naiva kiñcit karoti saḥ ||",
    "translation": "Which—quit of fear and hope—subduing self—rejecting outward impulse—yielding up to body's need nothing save body, dwells sinless amid all sin, with equal calm taking what may befall, by grief unmoved, unmoved by joy, unenvyingly; the same in good and evil fortunes; nowise bound by bond of deeds.",
    "teaching": "Abandoning attachment to the fruits of action, always satisfied, independent, such a person does nothing even while engaged in action. Though active, they perform no binding karma because there is no ego-driven motivation.",
    "category": "detachment",
    "relevance": 91
  },
  {
    "id": 421,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "21",
    "sanskrit": "निराशीर्यतचित्तात्मा त्यक्तसर्वपरिग्रहः। शारीरं केवलं कर्म कुर्वन्नाप्नोति किल्बिषम्॥",
    "transliteration": "nirāśīr yata-cittātmā tyakta-sarva-parigrahaḥ | śārīraṁ kevalaṁ karma kurvan nāpnoti kilbiṣam ||",
    "translation": "Nay, but of such an one, whose crave is gone, whose soul is liberate, whose heart is set on truth—of such an one what work he does is work of sacrifice, which passeth purely into ash and smoke consumed upon the altar!",
    "teaching": "Without desire, with mind and self controlled, having renounced all possessions, performing only bodily action, such a person incurs no sin. Minimalist living with inner freedom leads to sinless action.",
    "category": "renunciation",
    "relevance": 87
  },
  {
    "id": 422,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "22",
    "sanskrit": "यदृच्छालाभसन्तुष्टो द्वन्द्वातीतो विमत्सरः। समः सिद्धावसिद्धौ च कृत्वापि न निबध्यते॥",
    "transliteration": "yadṛcchā-lābha-santuṣṭo dvandvātīto vimatsaraḥ | samaḥ siddhāv asiddhau ca kṛtvāpi na nibadhyate ||",
    "translation": "All's then God! The sacrifice is Brahm, the ghee and grain are Brahm, the fire is Brahm, the flesh it eats is Brahm, and unto Brahm attaineth he who, in such office, meditates on Brahm.",
    "teaching": "Content with whatever comes unsought, transcending dualities, free from envy, balanced in success and failure—even while acting, such a person is not bound. True equanimity brings freedom from karma.",
    "category": "equanimity",
    "relevance": 89
  },
  {
    "id": 423,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "23",
    "sanskrit": "गतसङ्गस्य मुक्तस्य ज्ञानावस्थितचेतसः। यज्ञायाचरतः कर्म समग्रं प्रविलीयते॥",
    "transliteration": "gata-saṅgasya muktasya jñānāvasthita-cetasaḥ | yajñāyācarataḥ karma samagraṁ pravilīyate ||",
    "translation": "Some votaries there be who serve the gods with flesh and altar-smoke; but other some who, lighting subtler fires, make purer rite with will of worship.",
    "teaching": "The work of one who is free from attachment, liberated, whose mind is established in knowledge, and who acts only for the sake of sacrifice, dissolves entirely. When action becomes pure offering, it loses all binding power.",
    "category": "sacrifice",
    "relevance": 90
  },
  {
    "id": 424,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "24",
    "sanskrit": "ब्रह्मार्पणं ब्रह्म हविर्ब्रह्माग्नौ ब्रह्मणा हुतम्। ब्रह्मैव तेन गन्तव्यं ब्रह्मकर्मसमाधिना॥",
    "transliteration": "brahmārpaṇaṁ brahma havir brahmāgnau brahmaṇā hutam | brahmaiva tena gantavyaṁ brahma-karma-samādhinā ||",
    "translation": "All's then God! The sacrifice is Brahm, the ghee and grain are Brahm, the fire is Brahm, the flesh it eats is Brahm, and unto Brahm attaineth he who, in such office, meditates on Brahm.",
    "teaching": "The offering is Brahman, the oblation is Brahman, offered by Brahman into the fire of Brahman. Brahman is to be attained by one who sees Brahman in all action. Everything becomes divine when seen with spiritual vision.",
    "category": "philosophy",
    "relevance": 95
  },
  {
    "id": 425,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "25",
    "sanskrit": "दैवमेवापरे यज्ञं योगिनः पर्युपासते। ब्रह्माग्नावपरे यज्ञं यज्ञेनैवोपजुह्वति॥",
    "transliteration": "daivam evāpare yajñaṁ yoginaḥ paryupāsate | brahmāgnāv apare yajñaṁ yajñenaivopajuhvati ||",
    "translation": "Some votaries there be who serve the gods with flesh and altar-smoke; but other some who, lighting subtler fires, make purer rite with will of worship.",
    "teaching": "Some yogis properly worship the demigods by offering sacrifices to them, while others offer the sacrifice of self-realization in the fire of the Supreme Brahman. There are many valid spiritual practices.",
    "category": "sacrifice",
    "relevance": 85
  },
  {
    "id": 426,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "26",
    "sanskrit": "श्रोत्रादीनीन्द्रियाण्यन्ये संयमाग्निषु जुह्वति। शब्दादीन्विषयानन्य इन्द्रियाग्निषु जुह्वति॥",
    "transliteration": "śrotrādīnīndriyāṇy anye saṁyamāgniṣu juhvati | śabdādīn viṣayān anya indriyāgniṣu juhvati ||",
    "translation": "Of the which be they who, in white flame of continence, consume joys of the sense, delights of eye and ear, forgoing tender speech and sound of song.",
    "teaching": "Some offer hearing and other senses into the fires of restraint, while others offer sound and other sense objects into the fires of the senses. Different yogis practice different forms of sense control.",
    "category": "sacrifice",
    "relevance": 84
  },
  {
    "id": 427,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "27",
    "sanskrit": "सर्वाणीन्द्रियकर्माणि प्राणकर्माणि चापरे। आत्मसंयमयोगाग्नौ जुह्वति ज्ञानदीपिते॥",
    "transliteration": "sarvāṇīndriya-karmāṇi prāṇa-karmāṇi cāpare | ātma-saṁyama-yogāgnau juhvati jñāna-dīpite ||",
    "translation": "And they who, kindling fires with torch of Truth, burn on a hidden altar-stone the bliss of youth and love, renouncing happiness.",
    "teaching": "Others offer all the functions of the senses and the vital airs into the fire of self-controlled yoga, kindled by knowledge. Various methods of yoga all aim at self-control through dedicated practice.",
    "category": "yoga",
    "relevance": 86
  },
  {
    "id": 428,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "28",
    "sanskrit": "द्रव्ययज्ञास्तपोयज्ञा योगयज्ञास्तथापरे। स्वाध्यायज्ञानयज्ञाश्च यतयः संशितव्रताः॥",
    "transliteration": "dravya-yajñās tapo-yajñā yoga-yajñās tathāpare | svādhyāya-jñāna-yajñāś ca yatayaḥ saṁśita-vratāḥ ||",
    "translation": "And they who lay for offering there their wealth, their penance, meditation, piety, their steadfast reading of the scrolls, their lore painfully gained with long austerities.",
    "teaching": "Some perform sacrifice with material possessions, some with austerities, some with yoga, while others with strict vows study scriptures and cultivate knowledge as their sacrifice. Many paths lead to the same spiritual goal.",
    "category": "sacrifice",
    "relevance": 85
  },
  {
    "id": 429,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "29",
    "sanskrit": "अपाने जुह्वति प्राणं प्राणेऽपानं तथापरे। प्राणापानगती रुद्ध्वा प्राणायामपरायणाः॥",
    "transliteration": "apāne juhvati prāṇaṁ prāṇe 'pānaṁ tathāpare | prāṇāpāna-gatī ruddhvā prāṇāyāma-parāyaṇāḥ ||",
    "translation": "And they who, making silent sacrifice, draw in their breath to feed the flame of thought, and breathe it forth to waft the heart on high, governing the ventage of each entering air lest one sigh pass which helpeth not the soul.",
    "teaching": "Still others offer the outgoing breath into the incoming breath, and the incoming breath into the outgoing breath, restraining both, absorbed in breath control. Pranayama is a powerful form of sacrifice.",
    "category": "yoga",
    "relevance": 83
  },
  {
    "id": 430,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "30",
    "sanskrit": "अपरे नियताहाराः प्राणान्प्राणेषु जुह्वति। सर्वेऽप्येते यज्ञविदो यज्ञक्षपितकल्मषाः॥",
    "transliteration": "apare niyatāhārāḥ prāṇān prāṇeṣu juhvati | sarve 'py ete yajña-vido yajña-kṣapita-kalmaṣāḥ ||",
    "translation": "And they who, day by day denying needs, lay life itself upon the altar-flame, burning the body wan. Lo! all these keep the rite of offering, as if they slew victims; and all thereby efface much sin.",
    "teaching": "Others, restricting their food intake, offer their life breaths into life breaths. All these knowers of sacrifice have their sins destroyed by sacrifice. Every sincere spiritual practice purifies and elevates consciousness.",
    "category": "sacrifice",
    "relevance": 84
  },
  {
    "id": 431,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "31",
    "sanskrit": "यज्ञशिष्टामृतभुजो यान्ति ब्रह्म सनातनम्। नायं लोकोऽस्त्ययज्ञस्य कुतोऽन्यः कुरुसत्तम॥",
    "transliteration": "yajña-śiṣṭāmṛta-bhujo yānti brahma sanātanam | nāyaṁ loko 'sty ayajñasya kuto 'nyaḥ kuru-sattama ||",
    "translation": "Yea! and who feed on the immortal food left of such sacrifice, to Brahma pass, to The Unending. But for him that makes no sacrifice, he hath nor part nor lot even in the present world. How should he share another, O thou Chief of the Kurus!",
    "teaching": "Those who partake of the nectar remaining after sacrifice attain the eternal Brahman. O best of the Kurus, for one who does not perform sacrifice, even this world is not happy—how then the next?",
    "category": "sacrifice",
    "relevance": 88
  },
  {
    "id": 432,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "32",
    "sanskrit": "एवं बहुविधा यज्ञा वितता ब्रह्मणो मुखे। कर्मजान्विद्धि तान्सर्वानेवं ज्ञात्वा विमोक्ष्यसे॥",
    "transliteration": "evaṁ bahu-vidhā yajñā vitatā brahmaṇo mukhe | karma-jān viddhi tān sarvān evaṁ jñātvā vimokṣyase ||",
    "translation": "In sight of Brahma all these offerings are spread and are accepted! Comprehend that all proceed by act; for knowing this, thou shalt be quit of doubt.",
    "teaching": "Many types of sacrifice are described in the Vedas. Know them all to be born of action. Knowing thus, you will be liberated. Understanding the diversity of spiritual practices leads to freedom.",
    "category": "knowledge",
    "relevance": 89
  },
  {
    "id": 433,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "33",
    "sanskrit": "श्रेयान्द्रव्यमयाद्यज्ञाज्ज्ञानयज्ञः परन्तप। सर्वं कर्माखिलं पार्थ ज्ञाने परिसमाप्यते॥",
    "transliteration": "śreyān dravya-mayād yajñāj jñāna-yajñaḥ parantapa | sarvaṁ karmākhilaṁ pārtha jñāne parisamāpyate ||",
    "translation": "The sacrifice which Knowledge pays is better than great gifts offered by wealth, since gifts' worth—O my Prince! lies in the mind which gives, the will that serves: and these are gained by reverence, by strong search, by humble heed of those who see the Truth and teach it.",
    "teaching": "O scorcher of enemies, sacrifice performed in knowledge is superior to sacrifice made with material possessions. O Partha, all actions in their entirety culminate in knowledge. Knowledge is the highest offering.",
    "category": "knowledge",
    "relevance": 94
  },
  {
    "id": 434,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "34",
    "sanskrit": "तद्विद्धि प्रणिपातेन परिप्रश्नेन सेवया। उपदेक्ष्यन्ति ते ज्ञानं ज्ञानिनस्तत्त्वदर्शिनः॥",
    "transliteration": "tad viddhi praṇipātena paripraśnena sevayā | upadekṣyanti te jñānaṁ jñāninas tattva-darśinaḥ ||",
    "translation": "Knowing Truth, thy heart no more will ache with error, for the Truth shall show all things subdued to thee, as thou to Me.",
    "teaching": "Learn this knowledge through prostration, inquiry, and service. The self-realized souls who have seen the truth will impart knowledge to you. True knowledge requires humility, questioning, and devoted service to a teacher.",
    "category": "knowledge",
    "relevance": 92
  },
  {
    "id": 435,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "35",
    "sanskrit": "यज्ज्ञात्वा न पुनर्मोहमेवं यास्यसि पाण्डव। येन भूतान्यशेषेण द्रक्ष्यस्यात्मन्यथो मयि॥",
    "transliteration": "yaj jñātvā na punar moham evaṁ yāsyasi pāṇḍava | yena bhūtāny aśeṣeṇa drakṣyasy ātmany atho mayi ||",
    "translation": "Knowing Truth, thy heart no more will ache with error, for the Truth shall show all things subdued to thee, as thou to Me.",
    "teaching": "Knowing which, O Pandava, you will never again fall into delusion. By this knowledge you will see all beings in your Self, and also in Me. Self-knowledge reveals the unity of all existence.",
    "category": "self-realization",
    "relevance": 95
  },
  {
    "id": 436,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "36",
    "sanskrit": "अपि चेदसि पापेभ्यः सर्वेभ्यः पापकृत्तमः। सर्वं ज्ञानप्लवेनैव वृजिनं सन्तरिष्यसि॥",
    "transliteration": "api ced asi pāpebhyaḥ sarvebhyaḥ pāpa-kṛt-tamaḥ | sarvaṁ jñāna-plavenaiva vṛjinaṁ santariṣyasi ||",
    "translation": "Moreover, Son of Pandu! wert thou worst of all wrong-doers, this fair ship of Truth should bear thee safe and dry across the sea of thy transgressions.",
    "teaching": "Even if you are the most sinful of all sinners, you will cross over the ocean of sin by the boat of knowledge alone. Knowledge is the supreme purifier that can redeem anyone.",
    "category": "redemption",
    "relevance": 93
  },
  {
    "id": 437,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "37",
    "sanskrit": "यथैधांसि समिद्धोऽग्निर्भस्मसात्कुरुतेऽर्जुन। ज्ञानाग्निः सर्वकर्माणि भस्मसात्कुरुते तथा॥",
    "transliteration": "yathaidhāṁsi samiddho 'gnir bhasma-sāt kurute 'rjuna | jñānāgniḥ sarva-karmāṇi bhasma-sāt kurute tathā ||",
    "translation": "As the kindled flame feeds on the fuel till it sinks to ash, so unto ash, Arjuna! unto nought the flame of Knowledge wastes works' dross away!",
    "teaching": "As a blazing fire reduces wood to ashes, O Arjuna, so does the fire of knowledge reduce all actions to ashes. Knowledge destroys the karmic consequences of all actions.",
    "category": "knowledge",
    "relevance": 91
  },
  {
    "id": 438,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "38",
    "sanskrit": "न हि ज्ञानेन सदृशं पवित्रमिह विद्यते। तत्स्वयं योगसंसिद्धः कालेनात्मनि विन्दति॥",
    "transliteration": "na hi jñānena sadṛśaṁ pavitram iha vidyate | tat svayaṁ yoga-saṁsiddhaḥ kālenātmani vindati ||",
    "translation": "There is no purifier like thereto in all this world, and he who seeketh it shall find it—being grown perfect—in himself.",
    "teaching": "In this world there is nothing as purifying as knowledge. One who is perfected in yoga finds this knowledge within the self in due course of time. Knowledge is self-revealing to the prepared soul.",
    "category": "knowledge",
    "relevance": 90
  },
  {
    "id": 439,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "39",
    "sanskrit": "श्रद्धावाँल्लभते ज्ञानं तत्परः संयतेन्द्रियः। ज्ञानं लब्ध्वा परां शान्तिमचिरेणाधिगच्छति॥",
    "transliteration": "śraddhāvāḻ labhate jñānaṁ tat-paraḥ saṁyatendriyaḥ | jñānaṁ labdhvā parāṁ śāntim acireṇādhigacchati ||",
    "translation": "Believing, he receives it when the soul masters itself, and cleaves to Truth, and comes—possessing knowledge—to the higher peace, the uttermost repose.",
    "teaching": "The faithful who are devoted and control their senses obtain knowledge. Having obtained knowledge, one quickly attains supreme peace. Faith, dedication, and sense control are prerequisites for knowledge.",
    "category": "faith",
    "relevance": 89
  },
  {
    "id": 440,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "40",
    "sanskrit": "अज्ञश्चाश्रद्दधानश्च संशयात्मा विनश्यति। नायं लोकोऽस्ति न परो न सुखं संशयात्मनः॥",
    "transliteration": "ajñaś cāśraddadhānaś ca saṁśayātmā vinaśyati | nāyaṁ loko 'sti na para na sukhaṁ saṁśayātmanaḥ ||",
    "translation": "But those untaught, and those without full faith, and those who fear are shent; no peace is here or other where, no hope, nor happiness for whoso doubts.",
    "teaching": "But the ignorant, the faithless, and the doubter perishes. For the doubting soul there is neither this world, nor the next, nor happiness. Doubt is a destroyer that must be overcome through knowledge.",
    "category": "warning",
    "relevance": 87
  },
  {
    "id": 441,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "41",
    "sanskrit": "योगसंन्यस्तकर्माणं ज्ञानसञ्छिन्नसंशयम्। आत्मवन्तं न कर्माणि निबध्नन्ति धनञ्जय॥",
    "transliteration": "yoga-sannyasta-karmāṇaṁ jñāna-sañchinna-saṁśayam | ātmavantaṁ na karmāṇi nibadhnanti dhanañjaya ||",
    "translation": "He that, being self-contained, hath vanquished doubt, disparting self from service, soul from works, enlightened and emancipate, my Prince! works fetter him no more!",
    "teaching": "O Dhananjaya, one who has renounced actions through yoga, whose doubts are destroyed by knowledge, and who is situated in the self—actions do not bind such a person. Self-knowledge brings complete freedom.",
    "category": "liberation",
    "relevance": 92
  },
  {
    "id": 442,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 4",
    "verse": "42",
    "sanskrit": "तस्मादज्ञानसम्भूतं हृत्स्थं ज्ञानासिनात्मनः। छित्त्वैनं संशयं योगमातिष्ठोत्तिष्ठ भारत॥",
    "transliteration": "tasmād ajñāna-sambhūtaṁ hṛt-sthaṁ jñānāsinātmanaḥ | chittvainaṁ saṁśayaṁ yogam ātiṣṭhottiṣṭha bhārata ||",
    "translation": "Cut then atwain with sword of wisdom, Son of Bharata! this doubt that binds thy heart-beats! cleave the bond born of thy ignorance! Be bold and wise! Give thyself to the field with me! Arise!",
    "teaching": "Therefore, with the sword of knowledge cut asunder the doubt in your heart born of ignorance. Take refuge in yoga. Stand up and fight, O Bharata! Knowledge is a weapon that cuts through all doubt and confusion.",
    "category": "action",
    "relevance": 94
  },
  {
    "id": 501,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "1",
    "sanskrit": "अर्जुन उवाच संन्यासं कर्मणां कृष्ण पुनर्योगं च शंससि। यच्छ्रेय एतयोरेकं तन्मे ब्रूहि सुनिश्चितम्॥",
    "transliteration": "arjuna uvāca sannyāsaṁ karmaṇāṁ kṛṣṇa punar yogaṁ ca śaṁsasi | yac chreya etayor ekaṁ tan me brūhi su-niścitam ||",
    "translation": "Yet, Krishna! at the one time thou dost laud surcease of works, and, at another time, service through work. Of these twain plainly tell which is the better way?",
    "teaching": "Arjuna said: O Krishna, first You recommend renunciation of work, and then again You recommend work in devotion. Now definitely tell me which is better. This shows Arjuna's continued confusion about action versus renunciation.",
    "category": "inquiry",
    "relevance": 87
  },
  {
    "id": 502,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "2",
    "sanskrit": "श्रीभगवानुवाच संन्यासः कर्मयोगश्च निःश्रेयसकरावुभौ। तयोस्तु कर्मसंन्यासात्कर्मयोगो विशिष्यते॥",
    "transliteration": "śrī-bhagavān uvāca sannyāsaḥ karma-yogaś ca niḥśreyasa-karāv ubhau | tayos tu karma-sannyāsāt karma-yogo viśiṣyate ||",
    "translation": "To cease from works is well, and to do works in holiness is well; and both conduct to bliss supreme; but of these twain the better way is his who working piously refraineth not.",
    "teaching": "The Supreme Lord said: Both renunciation of work and work in devotion lead to the supreme goal. But of the two, karma-yoga is superior to renunciation of work. Active devotion is better than mere withdrawal.",
    "category": "philosophy",
    "relevance": 90
  },
  {
    "id": 503,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "3",
    "sanskrit": "ज्ञेयः स नित्यसंन्यासी यो न द्वेष्टि न काङ्क्षति। निर्द्वन्द्वो हि महाबाहो सुखं बन्धात्प्रमुच्यते॥",
    "transliteration": "jñeyaḥ sa nitya-sannyāsī yo na dveṣṭi na kāṅkṣati | nirdvandvo hi mahā-bāho sukhaṁ bandhāt pramucyate ||",
    "translation": "That is the true Renouncer, firm and fixed, who—seeking nought, rejecting nought—dwells proof against the 'opposites.' O valiant Prince! in doing, such breaks lightly from all deed.",
    "teaching": "One who neither hates nor desires should be known as a perpetual renunciant. Free from dualities, O mighty-armed, one is easily liberated from bondage. True renunciation is internal, not merely external.",
    "category": "renunciation",
    "relevance": 89
  },
  {
    "id": 504,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "4",
    "sanskrit": "सांख्ययोगौ पृथग्बालाः प्रवदन्ति न पण्डिताः। एकमप्यास्थितः सम्यगुभयोर्विन्दते फलम्॥",
    "transliteration": "sāṅkhya-yogau pṛthag bālāḥ pravadanti na paṇḍitāḥ | ekam apy āsthitaḥ samyag ubhayor vindate phalam ||",
    "translation": "'Tis the new scholar talks as they were two, this Sankhya and this Yoga: wise men know who husbands one plucks golden fruit of both!",
    "teaching": "Only the ignorant speak of devotional service as different from analytical study of the material world. Those who are truly learned say that one who applies oneself well to one achieves the results of both.",
    "category": "wisdom",
    "relevance": 88
  },
  {
    "id": 505,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "5",
    "sanskrit": "यत्सांख्यैः प्राप्यते स्थानं तद्योगैरपि गम्यते। एकं सांख्यं च योगं च यः पश्यति स पश्यति॥",
    "transliteration": "yat sāṅkhyaiḥ prāpyate sthānaṁ tad yogair api gamyate | ekaṁ sāṅkhyaṁ ca yogaṁ ca yaḥ paśyati sa paśyati ||",
    "translation": "The region of high rest which Sankhyans reach Yogins attain. Who sees these twain as one sees with clear eyes!",
    "teaching": "The place that is reached by the followers of analytical study is also attained by those engaged in devotional service. One who sees analytical study and devotional service as the same actually sees things as they are.",
    "category": "wisdom",
    "relevance": 87
  },
  {
    "id": 506,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "6",
    "sanskrit": "संन्यासस्तु महाबाहो दुःखमाप्तुमयोगतः। योगयुक्तो मुनिर्ब्रह्म नचिरेणाधिगच्छति॥",
    "transliteration": "sannyāsas tu mahā-bāho duḥkham āptum ayogataḥ | yoga-yukto munir brahma na cireṇādhigacchati ||",
    "translation": "Yet such abstraction, Chief! is hard to win without much holiness. Whoso is fixed in holiness, self-ruled, pure-hearted, lord of senses and of self, lost in the common life of all which lives—a 'Yogayukt'—he is a Saint who wends straightway to Brahm.",
    "teaching": "But renunciation, O mighty-armed, is difficult to attain without yoga. The sage equipped with yoga quickly attains Brahman. Mere renunciation without yoga practice is challenging and incomplete.",
    "category": "yoga",
    "relevance": 86
  },
  {
    "id": 507,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "7",
    "sanskrit": "योगयुक्तो विशुद्धात्मा विजितात्मा जितेन्द्रियः। सर्वभूतात्मभूतात्मा कुर्वन्नपि न लिप्यते॥",
    "transliteration": "yoga-yukto viśuddhātmā vijitātmā jitendriyaḥ | sarva-bhūtātma-bhūtātmā kurvann api na lipyate ||",
    "translation": "Such an one is not touched by taint of deeds. 'Nought of myself I do!' thus will he think—who holds the truth of truths—in seeing, hearing, touching, smelling; when he eats, or goes, or breathes; slumbers or talks, holds fast or loosens, opes his eyes or shuts.",
    "teaching": "One who is engaged in yoga, whose self is pure, who has conquered the mind and senses, and who realizes the self in all beings—though working, such a person is not tainted. Inner purity protects from karmic bondage.",
    "category": "purity",
    "relevance": 88
  },
  {
    "id": 508,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "8",
    "sanskrit": "नैव किञ्चित्करोमीति युक्तो मन्येत तत्त्ववित्। पश्यञ्शृण्वन्स्पृशञ्जिघ्रन्नश्नन्गच्छन्स्वपञ्श्वसन्॥",
    "transliteration": "naiva kiñcit karomīti yukto manyeta tattva-vit | paśyañ śṛṇvan spṛśañ jighran naśnan gacchan svapañ śvasan ||",
    "translation": "'Nought of myself I do!' thus will he think—who holds the truth of truths—in seeing, hearing, touching, smelling.",
    "teaching": "One who is in divine consciousness and knows the truth thinks, 'I do nothing at all'—even while seeing, hearing, touching, smelling, eating, walking, sleeping, and breathing.",
    "category": "detachment",
    "relevance": 89
  },
  {
    "id": 509,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "9",
    "sanskrit": "प्रलपन्विसृजन्गृह्णन्नुन्मिषन्निमिषन्नपि। इन्द्रियाणीन्द्रियार्थेषु वर्तन्त इति धारयन्॥",
    "transliteration": "pralapan visṛjan gṛhṇann unmiṣan nimiṣann api | indriyāṇīndriyārtheṣu vartanta iti dhārayan ||",
    "translation": "Always assured 'This is the sense-world plays with senses.' He that acts in thought of Brahm, detaching end from act, with act content, the world of sense can no more stain his soul than waters mar th' enamelled lotus-leaf.",
    "teaching": "Speaking, releasing, grasping, opening and closing the eyes—one should understand that only the senses are engaging with sense objects. The enlightened person sees the machinery of nature operating while the Self remains uninvolved.",
    "category": "detachment",
    "relevance": 87
  },
  {
    "id": 510,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "10",
    "sanskrit": "ब्रह्मण्याधाय कर्माणि सङ्गं त्यक्त्वा करोति यः। लिप्यते न स पापेन पद्मपत्रमिवाम्भसा॥",
    "transliteration": "brahmaṇy ādhāya karmāṇi saṅgaṁ tyaktvā karoti yaḥ | lipyate na sa pāpena padma-patram ivāmbhasā ||",
    "translation": "He that acts in thought of Brahm, detaching end from act, with act content, the world of sense can no more stain his soul than waters mar th' enamelled lotus-leaf.",
    "teaching": "One who performs actions, offering them to Brahman and abandoning attachment, is not tainted by sin—just as a lotus leaf is untouched by water. Dedication to the Divine purifies all action.",
    "category": "detachment",
    "relevance": 91
  },
  {
    "id": 511,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "11",
    "sanskrit": "कायेन मनसा बुद्ध्या केवलैरिन्द्रियैरपि। योगिनः कर्म कुर्वन्ति सङ्गं त्यक्त्वात्मशुद्धये॥",
    "transliteration": "kāyena manasā buddhyā kevalair indriyair api | yoginaḥ karma kurvanti saṅgaṁ tyaktvātma-śuddhaye ||",
    "translation": "With life, with heart, with mind,—nay, with the help of all five senses—letting selfhood go—Yogins toil ever towards their souls' release.",
    "teaching": "Yogis, abandoning attachment, act with body, mind, intelligence, and senses only for the purpose of self-purification. All actions become means of spiritual purification when done without attachment.",
    "category": "purification",
    "relevance": 88
  },
  {
    "id": 512,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "12",
    "sanskrit": "युक्तः कर्मफलं त्यक्त्वा शान्तिमाप्नोति नैष्ठिकीम्। अयुक्तः कामकारेण फले सक्तो निबध्यते॥",
    "transliteration": "yuktaḥ karma-phalaṁ tyaktvā śāntim āpnoti naiṣṭhikīm | ayuktaḥ kāma-kāreṇa phale sakto nibadhyate ||",
    "translation": "Such votaries, renouncing fruit of deeds, gain endless peace: the unvowed, the passion-bound, seeking a fruit from works, are fastened down.",
    "teaching": "The steadily devoted soul attains unadulterated peace by abandoning attachment to the fruits of work; but the unsteady, driven by desire and attached to results, becomes entangled. Peace comes from detachment.",
    "category": "peace",
    "relevance": 90
  },
  {
    "id": 513,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "13",
    "sanskrit": "सर्वकर्माणि मनसा संन्यस्यास्ते सुखं वशी। नवद्वारे पुरे देही नैव कुर्वन्न कारयन्॥",
    "transliteration": "sarva-karmāṇi manasā sannyasyāste sukhaṁ vaśī | nava-dvāre pure dehī naiva kurvan na kārayan ||",
    "translation": "The embodied sage, withdrawn within his soul, at every act sits godlike in 'the town which hath nine gateways,' neither doing aught nor causing any deed.",
    "teaching": "Mentally renouncing all actions, the self-controlled embodied being resides happily in the city of nine gates, neither acting nor causing action. The wise person lives in the body but is not of it.",
    "category": "renunciation",
    "relevance": 89
  },
  {
    "id": 514,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "14",
    "sanskrit": "न कर्तृत्वं न कर्माणि लोकस्य सृजति प्रभुः। न कर्मफलसंयोगं स्वभावस्तु प्रवर्तते॥",
    "transliteration": "na kartṛtvaṁ na karmāṇi lokasya sṛjati prabhuḥ | na karma-phala-saṁyogaṁ svabhāvas tu pravartate ||",
    "translation": "This world's Lord makes neither the work, nor passion for the work, nor lust for fruit of work; the man's own self pushes to these!",
    "teaching": "The embodied soul neither creates actions, nor the sense of agency, nor the connection between action and fruit. It is material nature that acts. Understanding this distinction brings freedom from false identification.",
    "category": "philosophy",
    "relevance": 87
  },
  {
    "id": 515,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "15",
    "sanskrit": "नादत्ते कस्यचित्पापं न चैव सुकृतं विभुः। अज्ञानेनावृतं ज्ञानं तेन मुह्यन्ति जन्तवः॥",
    "transliteration": "nādatte kasyacit pāpaṁ na caiva sukṛtaṁ vibhuḥ | ajñānenāvṛtaṁ jñānaṁ tena muhyanti jantavaḥ ||",
    "translation": "The Master of this World takes on himself the good or evil deeds of no man—dwelling beyond! Mankind errs here by folly, darkening knowledge.",
    "teaching": "The all-pervading Spirit does not take on anyone's sinful or pious activities. Knowledge is covered by ignorance; therefore living beings are bewildered. God doesn't create our karma—ignorance does.",
    "category": "philosophy",
    "relevance": 88
  },
  {
    "id": 516,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "16",
    "sanskrit": "ज्ञानेन तु तदज्ञानं येषां नाशितमात्मनः। तेषामादित्यवज्ज्ञानं प्रकाशयति तत्परम्॥",
    "transliteration": "jñānena tu tad ajñānaṁ yeṣāṁ nāśitam ātmanaḥ | teṣām āditya-vaj jñānaṁ prakāśayati tat param ||",
    "translation": "But, for whom that darkness of the soul is chased by light, splendid and clear shines manifest the Truth as if a Sun of Wisdom sprang to shed its beams of dawn.",
    "teaching": "But for those whose ignorance is destroyed by knowledge of the Self, that knowledge reveals the Supreme like the sun illuminating everything. Knowledge is the light that dispels the darkness of ignorance.",
    "category": "knowledge",
    "relevance": 92
  },
  {
    "id": 517,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "17",
    "sanskrit": "तद्बुद्धयस्तदात्मानस्तन्निष्ठास्तत्परायणाः। गच्छन्त्यपुनरावृत्तिं ज्ञाननिर्धूतकल्मषाः॥",
    "transliteration": "tad-buddhayas tad-ātmānas tan-niṣṭhās tat-parāyaṇāḥ | gacchanty apunar-āvṛttiṁ jñāna-nirdhūta-kalmaṣāḥ ||",
    "translation": "Him meditating still, Him seeking, with Him blended, stayed on Him, the souls illuminated take that road which hath no turning back—their sins flung off by strength of faith.",
    "teaching": "Those whose intellect and self are absorbed in the Supreme, who are firmly established in Him as their ultimate goal, attain liberation from rebirth, their sins washed away by knowledge. Total absorption leads to freedom.",
    "category": "liberation",
    "relevance": 91
  },
  {
    "id": 518,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "18",
    "sanskrit": "विद्याविनयसम्पन्ने ब्राह्मणे गवि हस्तिनि। शुनि चैव श्वपाके च पण्डिताः समदर्शिनः॥",
    "transliteration": "vidyā-vinaya-sampanne brāhmaṇe gavi hastini | śuni caiva śva-pāke ca paṇḍitāḥ sama-darśinaḥ ||",
    "translation": "Who will may have this Light; who hath it sees. To him who wisely sees, the Brahman with his scrolls and sanctities, the cow, the elephant, the unclean dog, the Outcast gorging dog's meat, are all one.",
    "teaching": "The wise see with equal vision a learned and humble brahmin, a cow, an elephant, a dog, and even an outcaste. True knowledge transcends all external distinctions and sees the divine essence in all beings.",
    "category": "equality",
    "relevance": 94
  },
  {
    "id": 519,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "19",
    "sanskrit": "इहैव तैर्जितः सर्गो येषां साम्ये स्थितं मनः। निर्दोषं हि समं ब्रह्म तस्माद्ब्रह्मणि ते स्थिताः॥",
    "transliteration": "ihaiva tair jitaḥ sargo yeṣāṁ sāmye sthitaṁ manaḥ | nirdoṣaṁ hi samaṁ brahma tasmād brahmaṇi te sthitāḥ ||",
    "translation": "The world is overcome—aye! even here!—by such as fix their faith on Unity. The sinless Brahma dwells in Unity, and they in Brahma.",
    "teaching": "Those whose minds are established in equanimity have conquered the cycle of birth and death even in this life. Since Brahman is spotless and equal, they are situated in Brahman. Equal vision brings liberation now.",
    "category": "liberation",
    "relevance": 90
  },
  {
    "id": 520,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "20",
    "sanskrit": "न प्रहृष्येत्प्रियं प्राप्य नोद्विजेत्प्राप्य चाप्रियम्। स्थिरबुद्धिरसम्मूढो ब्रह्मविद्ब्रह्मणि स्थितः॥",
    "transliteration": "na prahṛṣyet priyaṁ prāpya nodvijet prāpya cāpriyam | sthira-buddhir asammūḍho brahma-vid brahmaṇi sthitaḥ ||",
    "translation": "Be not over-glad attaining joy, and be not over-sad encountering grief, but, stayed on Brahma, still constant let each abide!",
    "teaching": "One who is not elated on obtaining what is pleasant, nor disturbed on obtaining the unpleasant, who has steady intelligence, is undeluded, knows Brahman, and is established in Brahman. Equanimity in all circumstances is the sign of wisdom.",
    "category": "equanimity",
    "relevance": 89
  },
  {
    "id": 521,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "21",
    "sanskrit": "बाह्यस्पर्शेष्वसक्तात्मा विन्दत्यात्मनि यत्सुखम्। स ब्रह्मयोगयुक्तात्मा सुखमक्षयमश्नुते॥",
    "transliteration": "bāhya-sparśeṣv asaktātmā vindaty ātmani yat sukham | sa brahma-yoga-yuktātmā sukham akṣayam aśnute ||",
    "translation": "The sage whose soul holds off from outer contacts, in himself finds bliss; to Brahma joined by piety, his spirit tastes eternal peace.",
    "teaching": "One who is not attached to external sense pleasures finds happiness within the Self. Such a person, engaged in meditation on Brahman, attains unlimited happiness. True joy is internal, not external.",
    "category": "happiness",
    "relevance": 88
  },
  {
    "id": 522,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "22",
    "sanskrit": "ये हि संस्पर्शजा भोगा दुःखयोनय एव ते। आद्यन्तवन्तः कौन्तेय न तेषु रमते बुधः॥",
    "transliteration": "ye hi saṁsparśa-jā bhogā duḥkha-yonaya eva te | ādy-antavantaḥ kaunteya na teṣu ramate budhaḥ ||",
    "translation": "The joys springing from sense-life are but quickening wombs which breed sure griefs: those joys begin and end! The wise mind takes no pleasure, Kunti's Son! in such as those!",
    "teaching": "Pleasures born of sense contact are indeed sources of misery, for they have a beginning and an end, O son of Kunti. The wise person does not rejoice in them. All material pleasures are temporary and ultimately unsatisfying.",
    "category": "detachment",
    "relevance": 87
  },
  {
    "id": 523,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "23",
    "sanskrit": "शक्नोतीहैव यः सोढुं प्राक्शरीरविमोक्षणात्। कामक्रोधोद्भवं वेगं स युक्तः स सुखी नरः॥",
    "transliteration": "śaknotīhaiva yaḥ soḍhuṁ prāk śarīra-vimokṣaṇāt | kāma-krodhodbhavaṁ vegaṁ sa yuktaḥ sa sukhī naraḥ ||",
    "translation": "But if a man shall learn, even while he lives and bears his body's chain, to master lust and anger, he is blest! He is the Yukta; he hath happiness, contentment, light, within: his life is merged in Brahma's life; he doth Nirvana touch!",
    "teaching": "One who is able to withstand the impulses of desire and anger even before giving up this body—such a person is a yogi and is happy in this world. Self-mastery in this life is the goal, not waiting for death.",
    "category": "self-control",
    "relevance": 91
  },
  {
    "id": 524,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "24",
    "sanskrit": "योऽन्तःसुखोऽन्तरारामस्तथान्तर्ज्योतिरेव यः। स योगी ब्रह्मनिर्वाणं ब्रह्मभूतोऽधिगच्छति॥",
    "transliteration": "yo 'ntaḥ-sukho 'ntar-ārāmas tathāntar-jyotir eva yaḥ | sa yogī brahma-nirvāṇaṁ brahma-bhūto 'dhigacchati ||",
    "translation": "He is the Yukta; he hath happiness, contentment, light, within: his life is merged in Brahma's life; he doth Nirvana touch!",
    "teaching": "One who is happy within, who rejoices within, who is illumined within—such a yogi becomes Brahman and attains liberation in Brahman. The enlightened person finds everything within, needing nothing external.",
    "category": "self-realization",
    "relevance": 92
  },
  {
    "id": 525,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "25",
    "sanskrit": "लभन्ते ब्रह्मनिर्वाणमृषयः क्षीणकल्मषाः। छिन्नद्वैधा यतात्मानः सर्वभूतहिते रताः॥",
    "transliteration": "labhante brahma-nirvāṇam ṛṣayaḥ kṣīṇa-kalmaṣāḥ | chinna-dvaidhā yatātmānaḥ sarva-bhūta-hite ratāḥ ||",
    "translation": "Thus go the Rishis unto rest, who dwell with sins effaced, with doubts at end, with hearts governed and calm. Glad in all good they live, nigh to the peace of God.",
    "teaching": "Seers whose sins have been destroyed, whose doubts are cut asunder, whose minds are disciplined, and who are engaged in the welfare of all beings, attain liberation in Brahman. Service to all beings is the path to God.",
    "category": "liberation",
    "relevance": 90
  },
  {
    "id": 526,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "26",
    "sanskrit": "कामक्रोधवियुक्तानां यतीनां यतचेतसाम्। अभितो ब्रह्मनिर्वाणं वर्तते विदितात्मनाम्॥",
    "transliteration": "kāma-krodha-viyuktānāṁ yatīnāṁ yata-cetasām | abhito brahma-nirvāṇaṁ vartate viditātmanām ||",
    "translation": "And all those live who pass their days exempt from greed and wrath, subduing self and senses, knowing the Soul!",
    "teaching": "For those self-controlled ascetics who are free from desire and anger, who have controlled their minds and realized the Self, liberation in Brahman exists both here and hereafter. Freedom is available now for the prepared soul.",
    "category": "liberation",
    "relevance": 89
  },
  {
    "id": 527,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "27",
    "sanskrit": "स्पर्शान्कृत्वा बहिर्बाह्यांश्चक्षुश्चैवान्तरे भ्रुवोः। प्राणापानौ समौ कृत्वा नासाभ्यन्तरचारिणौ॥",
    "transliteration": "sparśān kṛtvā bahir bāhyāṁś cakṣuś caivāntare bhruvoḥ | prāṇāpānau samau kṛtvā nāsābhyantara-cāriṇau ||",
    "translation": "The Saint who shuts outside his placid soul all touch of sense, letting no contact through; whose quiet eyes gaze straight from fixed brows, whose outward breath and inward breath are drawn equal and slow through nostrils still and close.",
    "teaching": "Shutting out external sense objects, fixing the gaze between the eyebrows, equalizing the incoming and outgoing breaths moving within the nostrils—this begins the practice of meditation.",
    "category": "meditation",
    "relevance": 86
  },
  {
    "id": 528,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "28",
    "sanskrit": "यतेन्द्रियमनोबुद्धिर्मुनिर्मोक्षपरायणः। विगतेच्छाभयक्रोधो यः सदा मुक्त एव सः॥",
    "transliteration": "yatendriya-mano-buddhir munir mokṣa-parāyaṇaḥ | vigatecchā-bhaya-krodho yaḥ sadā mukta eva saḥ ||",
    "translation": "That one—with organs, heart, and mind constrained, bent on deliverance, having put away passion, and fear, and rage;—hath, even now, obtained deliverance, ever and ever freed.",
    "teaching": "The sage devoted to liberation, who has controlled the senses, mind and intelligence, who is free from desire, fear and anger—such a person is forever liberated. Liberation is a state of being, not a future event.",
    "category": "liberation",
    "relevance": 88
  },
  {
    "id": 529,
    "source": "Bhagavad Gita",
    "chapter": "Chapter 5",
    "verse": "29",
    "sanskrit": "भोक्तारं यज्ञतपसां सर्वलोकमहेश्वरम्। सुहृदं सर्वभूतानां ज्ञात्वा मां शान्तिमृच्छति॥",
    "transliteration": "bhoktāraṁ yajña-tapasāṁ sarva-loka-maheśvaram | suhṛdaṁ sarva-bhūtānāṁ jñātvā māṁ śāntim ṛcchati ||",
    "translation": "Yea! for he knows Me Who am He that heeds the sacrifice and worship, God revealed; and He who heeds not, being Lord of Worlds, Lover of all that lives, God unrevealed, wherein who will shall find surety and shield!",
    "teaching": "Knowing Me as the enjoyer of all sacrifices and austerities, the Supreme Lord of all worlds, and the friend of all beings, one attains peace. Understanding God's nature as the beneficiary, controller, and well-wisher brings ultimate peace.",
    "category": "peace",
    "relevance": 95
  },
    {
      "id": 529,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 5",
      "verse": "29",
      "sanskrit": "भोक्तारं यज्ञतपसां सर्वलोकमहेश्वरम्। सुहृदं सर्वभूतानां ज्ञात्वा मां शान्तिमृच्छति॥",
      "transliteration": "bhoktāraṁ yajña-tapasāṁ sarva-loka-maheśvaram | suhṛdaṁ sarva-bhūtānāṁ jñātvā māṁ śāntim ṛcchati ||",
      "translation": "A person in full consciousness of Me, knowing Me to be the ultimate beneficiary of all sacrifices and austerities, the Supreme Lord of all planets and demigods, and the benefactor and well-wisher of all living entities, attains peace from the pangs of material miseries.",
      "teaching": "Peace comes from understanding God as the ultimate beneficiary of all actions and the true friend of all beings. This realization removes the ego and brings inner tranquility.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 605,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 6",
      "verse": "5",
      "sanskrit": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥",
      "transliteration": "uddhared ātmanātmānaṁ nātmānam avasādayet | ātmaiva hy ātmano bandhur ātmaiva ripur ātmanaḥ ||",
      "translation": "One must deliver himself with the help of his mind, and not degrade himself. The mind is the friend of the conditioned soul, and his enemy as well.",
      "teaching": "Self-improvement and personal responsibility. The mind can be both our greatest ally and our greatest obstacle in spiritual progress.",
      "category": "self-development",
      "relevance": 88
    },
    {
      "id": 646,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 6",
      "verse": "46",
      "sanskrit": "तपस्विभ्योऽधिको योगी ज्ञानिभ्योऽपि मतोऽधिकः। कर्मिभ्यश्चाधिको योगी तस्माद्योगी भवार्जुन॥",
      "transliteration": "tapasvibhyo 'dhiko yogī jñānibhyo 'pi mato 'dhikaḥ | karmibhyaś cādhiko yogī tasmād yogī bhavārjuna ||",
      "translation": "A yogi is greater than the ascetic, greater than the empiricist and greater than the fruitive worker. Therefore, O Arjuna, in all circumstances, be a yogi.",
      "teaching": "The path of yoga integrates all spiritual practices - devotion, knowledge, and action - making it the most complete path for spiritual realization.",
      "category": "karma-yoga",
      "relevance": 95
    },
    {
      "id": 714,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 7",
      "verse": "14",
      "sanskrit": "दैवी ह्येषा गुणमयी मम माया दुरत्यया। मामेव ये प्रपद्यन्ते मायामेतां तरन्ति ते॥",
      "transliteration": "daivī hy eṣā guṇa-mayī mama māyā duratyayā | mām eva ye prapadyante māyām etāṁ taranti te ||",
      "translation": "This divine energy of Mine, consisting of the three modes of material nature, is difficult to overcome. But those who have surrendered unto Me can easily cross beyond it.",
      "teaching": "The illusory power of maya can only be transcended through surrender to the divine. Material nature is powerful but not insurmountable through divine grace.",
      "category": "surrender",
      "relevance": 95
    },
    {
      "id": 828,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 8",
      "verse": "28",
      "sanskrit": "वेदेषु यज्ञेषु तपःसु चैव दानेषु यत्पुण्यफलं प्रदिष्टम्। अत्येति तत्सर्वमिदं विदित्वा योगी परं स्थानमुपैति चाद्यम्॥",
      "transliteration": "vedeṣu yajñeṣu tapaḥsu caiva dāneṣu yat puṇya-phalaṁ pradiṣṭam | atyeti tat sarvam idaṁ viditvā yogī paraṁ sthānam upaiti cādyam ||",
      "translation": "A person who accepts the path of devotional service is not bereft of the results derived from studying the Vedas, performing sacrifices, undergoing austerities, giving charity or pursuing philosophical and fruitive activities. Simply by performing devotional service, he attains all these, and at the end he reaches the supreme eternal abode.",
      "teaching": "The path of devotional service encompasses and transcends all other spiritual practices, leading to the highest destination and greatest fulfillment.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 922,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 9",
      "verse": "22",
      "sanskrit": "अनन्याश्चिन्तयन्तो मां ये जनाः पर्युपासते। तेषां नित्याभियुक्तानां योगक्षेमं वहाम्यहम्॥",
      "transliteration": "ananyāś cintayanto māṁ ye janāḥ paryupāsate | teṣāṁ nityābhiyuktānāṁ yoga-kṣemaṁ vahāmy aham ||",
      "translation": "But those who always worship Me with exclusive devotion, meditating on My transcendental form—to them I carry what they lack, and I preserve what they have.",
      "teaching": "Complete devotion to the divine brings divine protection and provision. God personally takes care of the needs of sincere devotees, handling both their spiritual and material welfare.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 926,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 9",
      "verse": "26",
      "sanskrit": "पत्रं पुष्पं फलं तोयं यो मे भक्त्या प्रयच्छति। तदहं भक्त्युपहृतमश्नामि प्रयतात्मनः॥",
      "transliteration": "patraṁ puṣpaṁ phalaṁ toyaṁ yo me bhaktyā prayacchati | tad ahaṁ bhakty-upahṛtam aśnāmi prayatātmanaḥ ||",
      "translation": "If one offers Me with love and devotion a leaf, a flower, fruit or water, I will accept it.",
      "teaching": "True devotion is not about elaborate offerings but the sincerity and love behind the gesture. God values the heart's offering over material wealth, making spirituality accessible to all.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 1041,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 10",
      "verse": "41",
      "sanskrit": "यद्यद्विभूतिमत्सत्त्वं श्रीमदूर्जितमेव वा। तत्तदेवावगच्छ त्वं मम तेजोऽंशसम्भवम्॥",
      "transliteration": "yad yad vibhūtimat sattvaṁ śrīmad ūrjitam eva vā | tat tad evāvagaccha tvaṁ mama tejo-'ṁśa-sambhavam ||",
      "translation": "Know that all opulent, beautiful and glorious creations spring from but a spark of My splendor.",
      "teaching": "Every magnificent manifestation in creation—whether in power, beauty, or excellence—is but a tiny reflection of the infinite divine glory. This verse teaches us to see the divine in all extraordinary expressions.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 1136,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "36",
      "sanskrit": "अर्जुन उवाच। स्थाने हृषीकेश तव प्रकीर्त्या जगत्प्रहृष्यत्यनुरज्यते च। रक्षांसि भीतानि दिशो द्रवन्ति सर्वे नमस्यन्ति च सिद्धसङ्घाः॥",
      "transliteration": "arjuna uvāca | sthāne hṛṣīkeśa tava prakīrtyā jagat prahṛṣyaty anurajyate ca | rakṣāṁsi bhītāni diśo dravanti sarve namasyanti ca siddha-saṅghāḥ ||",
      "translation": "Arjuna said: It is justly so, O Hrishikesha, that the world becomes joyful and is attracted by Your fame. The demons flee in fear to all directions, and all the groups of perfected souls offer You their respectful obeisances.",
      "teaching": "The cosmic form of God naturally evokes appropriate responses from all beings - devotees are attracted with joy, while negative forces flee in fear. This shows the universal recognition of divine authority.",
      "category": "devotion",
      "relevance": 85
    },
    {
      "id": 1154,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "54",
      "sanskrit": "भक्त्या त्वनन्यया शक्य अहमेवंविधोऽर्जुन। ज्ञातुं द्रष्टुं च तत्त्वेन प्रवेष्टुं च परन्तप॥",
      "transliteration": "bhaktyā tv ananyayā śakya aham evaṁ-vidho 'rjuna | jñātuṁ draṣṭuṁ ca tattvena praveṣṭuṁ ca parantapa ||",
      "translation": "My dear Arjuna, only by undivided devotional service can I be understood as I am, standing before you, and can thus be seen directly. Only in this way can you enter into the mysteries of My understanding.",
      "teaching": "The cosmic vision of God can only be truly understood and experienced through pure, undivided devotion. Intellectual understanding alone is insufficient for divine realization.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 1219,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 12",
      "verse": "19",
      "sanskrit": "तुल्यनिन्दास्तुतिर्मौनी सन्तुष्टो येन केनचित्। अनिकेतः स्थिरमतिर्भक्तिमान्मे प्रियो नरः॥",
      "transliteration": "tulya-nindā-stutir maunī santuṣṭo yena kenacit | aniketaḥ sthira-matir bhaktimān me priyo naraḥ ||",
      "translation": "One who is equal in honor and dishonor, who is steady, satisfied with anything, without a fixed residence, fixed in knowledge, and engaged in devotional service—such a person is very dear to Me.",
      "teaching": "The qualities of a true devotee include equanimity in praise and criticism, contentment with whatever comes, detachment from material possessions, and steady devotion regardless of circumstances.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 1334,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 13",
      "verse": "34",
      "sanskrit": "क्षेत्रक्षेत्रज्ञयोरेवमन्तरं ज्ञानचक्षुषा। भूतप्रकृतिमोक्षं च ये विदुर्यान्ति ते परम्॥",
      "transliteration": "kṣetra-kṣetrajñayor evam antaraṁ jñāna-cakṣuṣā | bhūta-prakṛti-mokṣaṁ ca ye vidur yānti te param ||",
      "translation": "Those who see with eyes of knowledge the difference between the field and the knower of the field, and can also understand the process of liberation from material nature, attain the Supreme.",
      "teaching": "True knowledge lies in understanding the distinction between the body (field) and the soul (knower of the field). This realization of our spiritual identity leads to liberation from material bondage.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 1426,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 14",
      "verse": "26",
      "sanskrit": "मां च योऽव्यभिचारेण भक्तियोगेन सेवते। स गुणान्समतीत्यैतान्ब्रह्मभूयाय कल्पते॥",
      "transliteration": "māṁ ca yo 'vyabhicāreṇa bhakti-yogena sevate | sa guṇān samatītyaitān brahma-bhūyāya kalpate ||",
      "translation": "One who engages in full devotional service, unfailing in all circumstances, at once transcends the modes of material nature and thus comes to the level of Brahman.",
      "teaching": "Unwavering devotional service transcends the three modes of material nature (goodness, passion, ignorance) and elevates one to the spiritual platform of Brahman realization.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 1515,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 15",
      "verse": "15",
      "sanskrit": "सर्वस्य चाहं हृदि सन्निविष्टो मत्तः स्मृतिर्ज्ञानमपोहनं च। वेदैश्च सर्वैरहमेव वेद्यो वेदान्तकृद्वेदविदेव चाहम्॥",
      "transliteration": "sarvasya cāhaṁ hṛdi sanniviṣṭo mattaḥ smṛtir jñānam apohanaṁ ca | vedaiś ca sarvair aham eva vedyo vedānta-kṛd veda-vid eva cāham ||",
      "translation": "I am seated in everyone's heart, and from Me come remembrance, knowledge and forgetfulness. By all the Vedas, I am to be known. Indeed, I am the compiler of Vedanta, and I am the knower of the Vedas.",
      "teaching": "The divine presence within all beings is the source of consciousness, memory, and knowledge. All spiritual knowledge ultimately leads to understanding this inner divine presence as our true guide.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 1621,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 16",
      "verse": "21",
      "sanskrit": "त्रिविधं नरकस्येदं द्वारं नाशनमात्मनः। कामः क्रोधस्तथा लोभस्तस्मादेतत्त्रयं त्यजेत्॥",
      "transliteration": "tri-vidhaṁ narakasyedaṁ dvāraṁ nāśanam ātmanaḥ | kāmaḥ krodhas tathā lobhas tasmād etat trayaṁ tyajet ||",
      "translation": "There are three gates leading to this hell—lust, anger and greed. Every sane man should give these up, for they lead to the degradation of the soul.",
      "teaching": "Lust, anger, and greed are the three primary enemies of spiritual progress. They are the gateways to spiritual destruction and must be consciously abandoned for inner peace and growth.",
      "category": "psychology",
      "relevance": 95
    },
    {
      "id": 1702,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 17",
      "verse": "2",
      "sanskrit": "श्रीभगवानुवाच। त्रिविधा भवति श्रद्धा देहिनां सा स्वभावजा। सात्त्विकी राजसी चैव तामसी चेति तां शृणु॥",
      "transliteration": "śrī-bhagavān uvāca | tri-vidhā bhavati śraddhā dehināṁ sā svabhāva-jā | sāttvikī rājasī caiva tāmasī ceti tāṁ śṛṇu ||",
      "translation": "The Supreme Personality of Godhead said: According to the modes of nature acquired by the embodied soul, one's faith can be of three kinds—in the mode of goodness, the mode of passion, or the mode of ignorance. Now hear about this.",
      "teaching": "Faith itself is influenced by the three modes of material nature. Understanding the quality of our faith helps us purify our consciousness and elevate our spiritual practice toward higher modes.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 1866,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 18",
      "verse": "66",
      "sanskrit": "सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज। अहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः॥",
      "transliteration": "sarva-dharmān parityajya mām ekaṁ śaraṇaṁ vraja | ahaṁ tvāṁ sarva-pāpebhyo mokṣayiṣyāmi mā śucaḥ ||",
      "translation": "Abandon all varieties of religion and just surrender unto Me. I shall deliver you from all sinful reactions. Do not fear.",
      "teaching": "The ultimate teaching of surrender and divine grace. Complete trust in the divine removes all fear and suffering, offering the simplest and most direct path to liberation.",
      "category": "surrender",
      "relevance": 98
    }
  ]
}