{
  "verses": [
    {
      "id": 101,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "1",
      "sanskrit": "धृतराष्ट्र उवाच। धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः। मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय॥",
      "transliteration": "dhṛtarāṣṭra uvāca | dharma-kṣetre kuru-kṣetre samavetā yuyutsavaḥ | māmakāḥ pāṇḍavāś caiva kim akurvata sañjaya ||",
      "translation": "Dhritarashtra said: O Sanjaya, after my sons and the sons of Pandu assembled in the place of pilgrimage at Kurukshetra, desiring to fight, what did they do?",
      "teaching": "The opening verse sets the stage for the great dialogue. Kurukshetra represents both the external battlefield and the internal field of dharma where the battle between good and evil takes place within each person.",
      "category": "dharma",
      "relevance": 75
    },
    {
      "id": 102,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "2",
      "sanskrit": "सञ्जय उवाच। दृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा। आचार्यमुपसङ्गम्य राजा वचनमब्रवीत्॥",
      "transliteration": "sañjaya uvāca | dṛṣṭvā tu pāṇḍavānīkaṁ vyūḍhaṁ duryodhanas tadā | ācāryam upasaṅgamya rājā vacanam abravīt ||",
      "translation": "Sanjaya said: O King, after looking over the army arranged in military formation by the sons of Pandu, King Duryodhana went to his teacher and spoke the following words.",
      "teaching": "This verse shows how in times of crisis, even the proud seek guidance from their teachers. It highlights the importance of seeking counsel from experienced mentors.",
      "category": "dharma",
      "relevance": 70
    },
    {
      "id": 103,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "3",
      "sanskrit": "पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम्। व्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता॥",
      "transliteration": "paśyaitāṁ pāṇḍu-putrāṇām ācārya mahatīṁ camūm | vyūḍhāṁ drupada-putreṇa tava śiṣyeṇa dhīmatā ||",
      "translation": "O my teacher, behold the great army of the sons of Pandu, so expertly arranged by your intelligent disciple Dhrishtadyumna, the son of Drupada.",
      "teaching": "Duryodhana acknowledges the skill of his enemies, showing that wisdom recognizes merit even in opponents. This teaches us to respect competence regardless of personal conflicts.",
      "category": "dharma",
      "relevance": 72
    },
    {
      "id": 104,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "4",
      "sanskrit": "अत्र शूरा महेष्वासा भीमार्जुनसमा युधि। युयुधानो विराटश्च द्रुपदश्च महारथः॥",
      "transliteration": "atra śūrā maheṣvāsā bhīmārjuna-samā yudhi | yuyudhāno virāṭaś ca drupadaś ca mahā-rathaḥ ||",
      "translation": "Here in this army are many heroic bowmen equal in fighting to Bhima and Arjuna: great fighters like Yuyudhana, Virata and Drupada.",
      "teaching": "Recognition of strength in opponents is a mark of wisdom. Acknowledging others' abilities without diminishing our own confidence shows mature assessment.",
      "category": "dharma",
      "relevance": 73
    },
    {
      "id": 115,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "15",
      "sanskrit": "पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जयः। पौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदरः॥",
      "transliteration": "pāñcajanyaṁ hṛṣīkeśo devadattaṁ dhanañjayaḥ | pauṇḍraṁ dadhmau mahā-śaṅkhaṁ bhīma-karmā vṛkodaraḥ ||",
      "translation": "Lord Krishna blew His conchshell Panchajanya; Arjuna blew his, called Devadatta; and Bhima the terrible blew his great shell called Paundra.",
      "teaching": "The divine sound of conchshells represents the call to righteous action. When we align with dharma, even our preparations become sacred and announce the victory of good over evil.",
      "category": "dharma",
      "relevance": 95
    },
    {
      "id": 121,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "21",
      "sanskrit": "अर्जुन उवाच। सेनयोरुभयोर्मध्ये रथं स्थापय मेऽच्युत। यावदेतान्निरीक्षेऽहं योद्धुकामानवस्थितान्॥",
      "transliteration": "arjuna uvāca | senayor ubhayor madhye rathaṁ sthāpaya me 'cyuta | yāvad etān nirīkṣe 'haṁ yoddhu-kāmān avasthitān ||",
      "translation": "Arjuna said: O infallible one, please place my chariot between the two armies so that I may see those present here, who desire to fight.",
      "teaching": "Sometimes we need to pause and assess a situation fully before acting. Taking time to understand what we're facing is a sign of wisdom, not weakness.",
      "category": "self-development",
      "relevance": 76
    },
    {
      "id": 128,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "28",
      "sanskrit": "अर्जुन उवाच। दृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम्। सीदन्ति मम गात्राणि मुखं च परिशुष्यति॥",
      "transliteration": "arjuna uvāca | dṛṣṭvemaṁ sva-janaṁ kṛṣṇa yuyutsuṁ samupasthitam | sīdanti mama gātrāṇi mukhaṁ ca pariśuṣyati ||",
      "translation": "Arjuna said: My dear Krishna, seeing my friends and relatives present before me in such a fighting spirit, I feel the limbs of my body quivering and my mouth drying up.",
      "teaching": "Physical symptoms often reflect mental and spiritual conflicts. Our body responds to moral dilemmas, showing the deep connection between conscience and physical well-being.",
      "category": "psychology",
      "relevance": 85
    },
    {
      "id": 131,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "31",
      "sanskrit": "न च श्रेयोऽनुपश्यामि हत्वा स्वजनमाहवे। न काङ्क्षे विजयं कृष्ण न च राज्यं सुखानि च॥",
      "transliteration": "na ca śreyo 'nupaśyāmi hatvā sva-janam āhave | na kāṅkṣe vijayaṁ kṛṣṇa na ca rājyaṁ sukhāni ca ||",
      "translation": "I can find no good in killing my own kinsmen in battle, nor can I, my dear Krishna, desire any subsequent victory, kingdom, or happiness.",
      "teaching": "When personal relationships conflict with duty, we may question whether any gain is worth the cost. This moral sensitivity shows the depth of Arjuna's character.",
      "category": "psychology",
      "relevance": 82
    },
    {
      "id": 140,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "40",
      "sanskrit": "अधर्माभिभवात्कृष्ण प्रदुष्यन्ति कुलस्त्रियः। स्त्रीषु दुष्टासु वार्ष्णेय जायते वर्णसङ्करः॥",
      "transliteration": "adharmābhibhavāt kṛṣṇa praduṣyanti kula-striyaḥ | strīṣu duṣṭāsu vārṣṇeya jāyate varṇa-saṅkaraḥ ||",
      "translation": "When irreligion is prominent in the family, O Krishna, the women of the family become polluted, and from the degradation of womanhood, O descendant of Vrishni, comes unwanted progeny.",
      "teaching": "Arjuna expresses concern about social breakdown following war. His worry shows how individual actions can have far-reaching consequences on society and future generations.",
      "category": "dharma",
      "relevance": 74
    },
    {
      "id": 147,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "47",
      "sanskrit": "एवमुक्त्वार्जुनः सङ्ख्ये रथोपस्थ उपाविशत्। विसृज्य सशरं चापं शोकसंविग्नमानसः॥",
      "transliteration": "evam uktvārjunaḥ saṅkhye rathopastha upāviśat | visṛjya sa-śaraṁ cāpaṁ śoka-saṁvigna-mānasaḥ ||",
      "translation": "Arjuna, having thus spoken on the battlefield, cast aside his bow and arrows and sat down on the chariot, his mind overwhelmed with grief.",
      "teaching": "This verse shows the climax of Arjuna's crisis. Sometimes we must reach the depths of confusion before we can receive divine guidance. It sets the stage for Krishna's teachings.",
      "category": "psychology",
      "relevance": 90
    },
    {
      "id": 201,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "1",
      "sanskrit": "सञ्जय उवाच। तं तथा कृपयाविष्टमश्रुपूर्णाकुलेक्षणम्। विषीदन्तमिदं वाक्यमुवाच मधुसूदनः॥",
      "transliteration": "sañjaya uvāca | taṁ tathā kṛpayāviṣṭam aśru-pūrṇākulekṣaṇam | viṣīdantam idaṁ vākyam uvāca madhusūdanaḥ ||",
      "translation": "Sanjaya said: Seeing Arjuna full of compassion, his mind depressed, his eyes full of tears, Madhusudana, Krishna, spoke the following words.",
      "teaching": "Krishna responds to Arjuna's emotional crisis with wisdom. This shows that divine guidance comes when we are most receptive, often in our moments of greatest need.",
      "category": "psychology",
      "relevance": 85
    },
    {
      "id": 202,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "2",
      "sanskrit": "श्रीभगवानुवाच। कुतस्त्वा कश्मलमिदं विषमे समुपस्थितम्। अनार्यजुष्टमस्वर्ग्यमकीर्तिकरमर्जुन॥",
      "transliteration": "śrī-bhagavān uvāca | kutas tvā kaśmalam idaṁ viṣame samupasthitam | anārya-juṣṭam asvargyam akīrti-karam arjuna ||",
      "translation": "The Supreme Personality of Godhead said: My dear Arjuna, how have these impurities come upon you? They are not at all befitting a man who knows the value of life. They lead not to higher planets but to infamy.",
      "teaching": "Krishna challenges Arjuna's despondency, calling it 'impurity' that doesn't befit a noble person. Sometimes we need direct confrontation with our weaknesses to move forward.",
      "category": "self-development",
      "relevance": 80
    },
    {
      "id": 203,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "3",
      "sanskrit": "क्लैब्यं मा स्म गमः पार्थ नैतत्त्वय्युपपद्यते। क्षुद्रं हृदयदौर्बल्यं त्यक्त्वोत्तिष्ठ परन्तप॥",
      "transliteration": "klaibyaṁ mā sma gamaḥ pārtha naitat tvayy upapadyate | kṣudraṁ hṛdaya-daurbalyaṁ tyaktvottiṣṭha parantapa ||",
      "translation": "O son of Pritha, do not yield to this degrading impotence. It does not become you. Give up such petty weakness of heart and arise, O chastiser of the enemy!",
      "teaching": "Krishna calls for courage and action over despair. True strength comes from rising above emotional weakness and taking appropriate action despite difficulties.",
      "category": "self-development",
      "relevance": 88
    },
    {
      "id": 204,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "4",
      "sanskrit": "अर्जुन उवाच। कथं भीष्ममहं सङ्ख्ये द्रोणं च मधुसूदन। इषुभिः प्रतियोत्स्यामि पूजार्हावरिसूदन॥",
      "transliteration": "arjuna uvāca | kathaṁ bhīṣmam ahaṁ saṅkhye droṇaṁ ca madhusūdana | iṣubhiḥ pratiyotsyāmi pūjārhāv arisūdana ||",
      "translation": "Arjuna said: O Madhusudana, how can I counterattack with arrows in battle men like Bhishma and Drona, who are worthy of my worship?",
      "teaching": "The conflict between personal respect and duty creates deep moral anguish. Sometimes life demands actions that seem to contradict our deepest values and relationships.",
      "category": "psychology",
      "relevance": 84
    },
    {
      "id": 207,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "7",
      "sanskrit": "कार्पण्यदोषोपहतस्वभावः पृच्छामि त्वां धर्मसम्मूढचेताः। यच्छ्रेयः स्यान्निश्चितं ब्रूहि तन्मे शिष्यस्तेऽहं शाधि मां त्वां प्रपन्नम्॥",
      "transliteration": "kārpaṇya-doṣopahata-svabhāvaḥ pṛcchāmi tvāṁ dharma-sammūḍha-cetāḥ | yac chreyaḥ syān niścitaṁ brūhi tan me śiṣyas te 'haṁ śādhi māṁ tvāṁ prapannam ||",
      "translation": "Now I am confused about my duty and have lost all composure because of miserly weakness. In this condition I am asking You to tell me for certain what is best for me. Now I am Your disciple, and a soul surrendered unto You. Please instruct me.",
      "teaching": "True learning begins with surrendering to a qualified teacher and admitting our confusion. Humility and openness are prerequisites for receiving wisdom.",
      "category": "surrender",
      "relevance": 90
    },
    {
      "id": 211,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "11",
      "sanskrit": "अशोच्यानन्वशोचस्त्वं प्रज्ञावादांश्च भाषसे। गतासूनगतासूंश्च नानुशोचन्ति पण्डिताः॥",
      "transliteration": "aśocyān anvaśocas tvaṁ prajñā-vādāṁś ca bhāṣase | gatāsūn agatāsūṁś ca nānuśocanti paṇḍitāḥ ||",
      "translation": "While speaking learned words, you are mourning for what is not worthy of grief. Those who are wise lament neither for the living nor for the dead.",
      "teaching": "True wisdom transcends grief for the temporary body. The wise understand the eternal nature of the soul and don't lament what is merely a change of form.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 212,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "12",
      "sanskrit": "न त्वेवाहं जातु नासं न त्वं नेमे जनाधिपाः। न चैव न भविष्यामः सर्वे वयमतः परम्॥",
      "transliteration": "na tv evāhaṁ jātu nāsaṁ na tvaṁ neme janādhipāḥ | na caiva na bhaviṣyāmaḥ sarve vayam ataḥ param ||",
      "translation": "Never was there a time when I did not exist, nor you, nor all these kings; nor in the future shall any of us cease to be.",
      "teaching": "The eternal existence of the soul is fundamental truth. Understanding our eternal nature removes fear of death and gives meaning to life beyond temporary circumstances.",
      "category": "spirituality",
      "relevance": 94
    },
    {
      "id": 213,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "13",
      "sanskrit": "देहिनोऽस्मिन्यथा देहे कौमारं यौवनं जरा। तथा देहान्तरप्राप्तिर्धीरस्तत्र न मुह्यति॥",
      "transliteration": "dehino 'smin yathā dehe kaumāraṁ yauvanaṁ jarā | tathā dehāntara-prāptir dhīras tatra na muhyati ||",
      "translation": "As the embodied soul continuously passes, in this body, from boyhood to youth to old age, the soul similarly passes into another body at death. A sober person is not bewildered by such a change.",
      "teaching": "Death is simply another change for the eternal soul, no different from the changes we accept in life from childhood to old age. The wise person understands this continuity.",
      "category": "spirituality",
      "relevance": 94
    },
    {
      "id": 214,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "14",
      "sanskrit": "मात्रास्पर्शास्तु कौन्तेय शीतोष्णसुखदुःखदाः। आगमापायिनोऽनित्यास्तांस्तितिक्षस्व भारत॥",
      "transliteration": "mātrā-sparśās tu kaunteya śītoṣṇa-sukha-duḥkha-dāḥ | āgamāpāyino 'nityās tāṁs titikṣasva bhārata ||",
      "translation": "O son of Kunti, the nonpermanent appearance of happiness and distress, and their disappearance in due course, are like the appearance and disappearance of winter and summer seasons. They arise from sense perception, O scion of Bharata, and one must learn to tolerate them without being disturbed.",
      "teaching": "Life's dualities are temporary like seasons. Developing tolerance for life's ups and downs without being overwhelmed is essential for inner peace and spiritual progress.",
      "category": "self-development",
      "relevance": 88
    },
    {
      "id": 217,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "17",
      "sanskrit": "अविनाशि तु तद्विद्धि येन सर्वमिदं ततम्। विनाशमव्ययस्यास्य न कश्चित्कर्तुमर्हति॥",
      "transliteration": "avināśi tu tad viddhi yena sarvam idaṁ tatam | vināśam avyayasyāsya na kaścit kartum arhati ||",
      "translation": "That which pervades the entire body you should understand to be indestructible. No one is able to destroy that imperishable soul.",
      "teaching": "The soul that pervades the body is indestructible. Understanding our true indestructible nature frees us from fear and gives us confidence in life's challenges.",
      "category": "spirituality",
      "relevance": 91
    },
    {
      "id": 220,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "20",
      "sanskrit": "न जायते म्रियते वा कदाचिन्नायं भूत्वा भविता वा न भूयः। अजो नित्यः शाश्वतोऽयं पुराणो न हन्यते हन्यमाने शरीरे॥",
      "transliteration": "na jāyate mriyate vā kadācin nāyaṁ bhūtvā bhavitā vā na bhūyaḥ | ajo nityaḥ śāśvato 'yaṁ purāṇo na hanyate hanyamāne śarīre ||",
      "translation": "For the soul there is neither birth nor death. It is not slain when the body is slain.",
      "teaching": "The soul is eternal, unborn, undying, and primeval. This fundamental truth about our spiritual nature is the foundation for overcoming the fear of death and living with courage.",
      "category": "spirituality",
      "relevance": 94
    },
    {
      "id": 222,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "22",
      "sanskrit": "वासांसि जीर्णानि यथा विहाय नवानि गृह्णाति नरोऽपराणि। तथा शरीराणि विहाय जीर्णान्यन्यानि संयाति नवानि देही॥",
      "transliteration": "vāsāṁsi jīrṇāni yathā vihāya navāni gṛhṇāti naro 'parāṇi | tathā śarīrāṇi vihāya jīrṇāny anyāni saṁyāti navāni dehī ||",
      "translation": "As a person puts on new garments, giving up old ones, the soul similarly accepts new material bodies, giving up the old and useless ones.",
      "teaching": "Death is merely changing clothes for the eternal soul. This beautiful analogy helps us understand that death is a natural transition, not an end, removing fear and bringing acceptance.",
      "category": "spirituality",
      "relevance": 94
    },
    {
      "id": 231,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "31",
      "sanskrit": "स्वधर्ममपि चावेक्ष्य न विकम्पितुमर्हसि। धर्म्याद्धि युद्धाच्छ्रेयोऽन्यत्क्षत्रियस्य न विद्यते॥",
      "transliteration": "sva-dharmam api cāvekṣya na vikampitum arhasi | dharmyād dhi yuddhāc chreyo 'nyat kṣatriyasya na vidyate ||",
      "translation": "Considering your specific duty as a warrior, you should not waver. For a warrior, nothing is higher than a war against evil.",
      "teaching": "Each person has specific duties according to their nature and position. Following one's dharma, even when difficult, is the path to spiritual and social harmony.",
      "category": "dharma",
      "relevance": 87
    },
    {
      "id": 240,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "40",
      "sanskrit": "नेहाभिक्रमनाशोऽस्ति प्रत्यवायो न विद्यते। स्वल्पमप्यस्य धर्मस्य त्रायते महतो भयात्॥",
      "transliteration": "nehābhikrama-nāśo 'sti pratyavāyo na vidyate | svalpam apy asya dharmasya trāyate mahato bhayāt ||",
      "translation": "In this endeavor there is no loss or diminution, and a little advancement on this path can protect one from the most dangerous type of fear.",
      "teaching": "Spiritual effort is never wasted. Even small steps toward righteousness and self-realization provide protection and bring us closer to the ultimate goal.",
      "category": "karma-yoga",
      "relevance": 85
    },
    {
      "id": 247,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "47",
      "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
      "transliteration": "karmaṇy evādhikāras te mā phaleṣu kadācana | mā karma-phala-hetur bhūr mā te saṅgo 'stv akarmaṇi ||",
      "translation": "You have a right to perform your prescribed duty, but not to the fruits of action. Never consider yourself the cause of the results of your activities, and never be attached to not doing your duty.",
      "teaching": "The principle of Nishkama Karma - performing duty without attachment to results. This is the foundation of karma yoga and leads to freedom from anxiety and ego.",
      "category": "karma-yoga",
      "relevance": 98
    },
    {
      "id": 248,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "48",
      "sanskrit": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥",
      "transliteration": "yoga-sthaḥ kuru karmāṇi saṅgaṁ tyaktvā dhanañjaya | siddhy-asiddhyoḥ samo bhūtvā samatvaṁ yoga ucyate ||",
      "translation": "Perform your duty equipoised, O Arjuna, abandoning all attachment to success or failure. Such equanimity is called yoga.",
      "teaching": "True yoga is maintaining mental equilibrium in success and failure. This balanced state of mind transforms work into spiritual practice and brings inner peace.",
      "category": "karma-yoga",
      "relevance": 94
    },
    {
      "id": 256,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "56",
      "sanskrit": "दुःखेष्वनुद्विग्नमनाः सुखेषु विगतस्पृहः। वीतरागभयक्रोधः स्थितधीर्मुनिरुच्यते॥",
      "transliteration": "duḥkheṣv anudvigna-manāḥ sukheṣu vigata-spṛhaḥ | vīta-rāga-bhaya-krodhaḥ sthita-dhīr munir ucyate ||",
      "translation": "One who is not disturbed in mind even amidst the threefold miseries or elated when there is happiness, and who is free from attachment, fear and anger, is called a sage of steady mind.",
      "teaching": "The characteristics of a self-realized person include equanimity in pleasure and pain, freedom from attachment, fear, and anger. This steady state of mind is the goal of spiritual practice.",
      "category": "self-development",
      "relevance": 93
    },
    {
      "id": 262,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "62",
      "sanskrit": "ध्यायतो विषयान्पुंसः सङ्गस्तेषूपजायते। सङ्गात्सञ्जायते कामः कामात्क्रोधोऽभिजायते॥",
      "transliteration": "dhyāyato viṣayān puṁsaḥ saṅgas teṣūpajāyate | saṅgāt sañjāyate kāmaḥ kāmāt krodho 'bhijāyate ||",
      "translation": "While contemplating the objects of the senses, a person develops attachment for them, and from such attachment lust develops, and from lust anger arises.",
      "teaching": "The psychology of desire shows how mental dwelling on sense objects creates a chain reaction leading to suffering. Awareness of this process helps us break free from destructive patterns.",
      "category": "psychology",
      "relevance": 90
    },
    {
      "id": 263,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "63",
      "sanskrit": "क्रोधाद्भवति सम्मोहः सम्मोहात्स्मृतिविभ्रमः। स्मृतिभ्रंशाद्बुद्धिनाशो बुद्धिनाशात्प्रणश्यति॥",
      "transliteration": "krodhād bhavati sammohaḥ sammohāt smṛti-vibhramaḥ | smṛti-bhraṁśād buddhi-nāśo buddhi-nāśāt praṇaśyati ||",
      "translation": "From anger, complete delusion arises, and from delusion bewilderment of memory. When memory is bewildered, intelligence is lost, and when intelligence is lost one falls down again into the material pool.",
      "teaching": "The complete chain of spiritual downfall: desire → anger → delusion → memory loss → destruction of intelligence → spiritual ruin. Understanding this helps us catch ourselves early in the process.",
      "category": "psychology",
      "relevance": 92
    },
    {
      "id": 264,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "64",
      "sanskrit": "रागद्वेषवियुक्तैस्तु विषयानिन्द्रियैश्चरन्। आत्मवश्यैर्विधेयात्मा प्रसादमधिगच्छति॥",
      "transliteration": "rāga-dveṣa-viyuktais tu viṣayān indriyaiś caran | ātma-vaśyair vidheyātmā prasādam adhigacchati ||",
      "translation": "But a person who is not attached or aversive to sense objects, who controls the senses and is self-governed, attains tranquility.",
      "teaching": "The path to inner peace - engaging with the world while maintaining detachment from attractions and aversions. Self-control leads to tranquility.",
      "category": "self-development",
      "relevance": 88
    },
    {
      "id": 270,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "70",
      "sanskrit": "आपूर्यमाणमचलप्रतिष्ठं समुद्रमापः प्रविशन्ति यद्वत्। तद्वत्कामा यं प्रविशन्ति सर्वे स शान्तिमाप्नोति न कामकामी॥",
      "transliteration": "āpūryamāṇam acala-pratiṣṭhaṁ samudram āpaḥ praviśanti yadvat | tadvat kāmā yaṁ praviśanti sarve sa śāntim āpnoti na kāma-kāmī ||",
      "translation": "A person who is not disturbed by the incessant flow of desires—that enter like rivers into the ocean, which is ever being filled but is always still—can alone achieve peace, and not the man who strives to satisfy such desires.",
      "teaching": "True peace comes from being like the ocean - remaining undisturbed despite the constant flow of desires. The peaceful person doesn't resist desires but remains unaffected by them.",
      "category": "self-development",
      "relevance": 93
    },
    {
      "id": 342,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "42",
      "sanskrit": "इन्द्रियाणि पराण्याहुरिन्द्रियेभ्यः परं मनः। मनसस्तु परा बुद्धिर्यो बुद्धेः परतस्तु सः॥",
      "transliteration": "indriyāṇi parāṇy āhur indriyebhyaḥ paraṁ manaḥ | manasas tu parā buddhir yo buddheḥ paratas tu saḥ ||",
      "translation": "The working senses are superior to dull matter; mind is higher than the senses; intelligence is still higher than the mind; and the soul is even higher than the intelligence.",
      "teaching": "The hierarchy of consciousness - understanding the layers of our being from body to soul helps in self-realization and knowing our true identity beyond the physical.",
      "category": "self-development",
      "relevance": 95
    },
    {
      "id": 407,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 4",
      "verse": "7",
      "sanskrit": "यदा यदा हि धर्मस्य ग्लानिर्भवति भारत। अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥",
      "transliteration": "yadā yadā hi dharmasya glānir bhavati bhārata | abhyutthānam adharmasya tadātmānaṁ sṛjāmy aham ||",
      "translation": "Whenever righteousness declines and unrighteousness increases, O Arjuna, at that time I manifest myself on earth.",
      "teaching": "Divine intervention occurs when righteousness is threatened. This speaks to the cyclical nature of cosmic balance and hope in times of moral crisis.",
      "category": "dharma",
      "relevance": 95
    },
    {
      "id": 408,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 4",
      "verse": "8",
      "sanskrit": "परित्राणाय साधूनां विनाशाय च दुष्कृताम्। धर्मसंस्थापनार्थाय सम्भवामि युगे युगे॥",
      "transliteration": "paritrāṇāya sādhūnāṁ vināśāya ca duṣkṛtām | dharma-saṁsthāpanārthāya sambhavāmi yuge yuge ||",
      "translation": "To deliver the pious and to annihilate the miscreants, as well as to reestablish the principles of dharma, I appear millennium after millennium.",
      "teaching": "The divine promise to restore balance between good and evil gives hope and purpose to righteous action in every age.",
      "category": "dharma",
      "relevance": 91
    },
    {
      "id": 424,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 4",
      "verse": "24",
      "sanskrit": "ब्रह्मार्पणं ब्रह्म हविर्ब्रह्माग्नौ ब्रह्मणा हुतम्। ब्रह्मैव तेन गन्तव्यं ब्रह्मकर्मसमाधिना॥",
      "transliteration": "brahmārpaṇaṁ brahma havir brahmāgnau brahmaṇā hutam | brahmaiva tena gantavyaṁ brahma-karma-samādhinā ||",
      "translation": "The act of offering is Brahman; the oblation is Brahman; by Brahman it is offered into the fire of Brahman. Brahman is that which is to be attained by him who performs action pertaining to Brahman.",
      "teaching": "The vision of the divine in all activities - seeing everything as sacred transforms ordinary work into spiritual practice and leads to the realization of universal consciousness.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 529,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 5",
      "verse": "29",
      "sanskrit": "भोक्तारं यज्ञतपसां सर्वलोकमहेश्वरम्। सुहृदं सर्वभूतानां ज्ञात्वा मां शान्तिमृच्छति॥",
      "transliteration": "bhoktāraṁ yajña-tapasāṁ sarva-loka-maheśvaram | suhṛdaṁ sarva-bhūtānāṁ jñātvā māṁ śāntim ṛcchati ||",
      "translation": "A person in full consciousness of Me, knowing Me to be the ultimate beneficiary of all sacrifices and austerities, the Supreme Lord of all planets and demigods, and the benefactor and well-wisher of all living entities, attains peace from the pangs of material miseries.",
      "teaching": "Peace comes from understanding God as the ultimate beneficiary of all actions and the true friend of all beings. This realization removes the ego and brings inner tranquility.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 605,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 6",
      "verse": "5",
      "sanskrit": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥",
      "transliteration": "uddhared ātmanātmānaṁ nātmānam avasādayet | ātmaiva hy ātmano bandhur ātmaiva ripur ātmanaḥ ||",
      "translation": "One must deliver himself with the help of his mind, and not degrade himself. The mind is the friend of the conditioned soul, and his enemy as well.",
      "teaching": "Self-improvement and personal responsibility. The mind can be both our greatest ally and our greatest obstacle in spiritual progress.",
      "category": "self-development",
      "relevance": 88
    },
    {
      "id": 646,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 6",
      "verse": "46",
      "sanskrit": "तपस्विभ्योऽधिको योगी ज्ञानिभ्योऽपि मतोऽधिकः। कर्मिभ्यश्चाधिको योगी तस्माद्योगी भवार्जुन॥",
      "transliteration": "tapasvibhyo 'dhiko yogī jñānibhyo 'pi mato 'dhikaḥ | karmibhyaś cādhiko yogī tasmād yogī bhavārjuna ||",
      "translation": "A yogi is greater than the ascetic, greater than the empiricist and greater than the fruitive worker. Therefore, O Arjuna, in all circumstances, be a yogi.",
      "teaching": "The path of yoga integrates all spiritual practices - devotion, knowledge, and action - making it the most complete path for spiritual realization.",
      "category": "karma-yoga",
      "relevance": 95
    },
    {
      "id": 714,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 7",
      "verse": "14",
      "sanskrit": "दैवी ह्येषा गुणमयी मम माया दुरत्यया। मामेव ये प्रपद्यन्ते मायामेतां तरन्ति ते॥",
      "transliteration": "daivī hy eṣā guṇa-mayī mama māyā duratyayā | mām eva ye prapadyante māyām etāṁ taranti te ||",
      "translation": "This divine energy of Mine, consisting of the three modes of material nature, is difficult to overcome. But those who have surrendered unto Me can easily cross beyond it.",
      "teaching": "The illusory power of maya can only be transcended through surrender to the divine. Material nature is powerful but not insurmountable through divine grace.",
      "category": "surrender",
      "relevance": 95
    },
    {
      "id": 828,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 8",
      "verse": "28",
      "sanskrit": "वेदेषु यज्ञेषु तपःसु चैव दानेषु यत्पुण्यफलं प्रदिष्टम्। अत्येति तत्सर्वमिदं विदित्वा योगी परं स्थानमुपैति चाद्यम्॥",
      "transliteration": "vedeṣu yajñeṣu tapaḥsu caiva dāneṣu yat puṇya-phalaṁ pradiṣṭam | atyeti tat sarvam idaṁ viditvā yogī paraṁ sthānam upaiti cādyam ||",
      "translation": "A person who accepts the path of devotional service is not bereft of the results derived from studying the Vedas, performing sacrifices, undergoing austerities, giving charity or pursuing philosophical and fruitive activities. Simply by performing devotional service, he attains all these, and at the end he reaches the supreme eternal abode.",
      "teaching": "The path of devotional service encompasses and transcends all other spiritual practices, leading to the highest destination and greatest fulfillment.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 922,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 9",
      "verse": "22",
      "sanskrit": "अनन्याश्चिन्तयन्तो मां ये जनाः पर्युपासते। तेषां नित्याभियुक्तानां योगक्षेमं वहाम्यहम्॥",
      "transliteration": "ananyāś cintayanto māṁ ye janāḥ paryupāsate | teṣāṁ nityābhiyuktānāṁ yoga-kṣemaṁ vahāmy aham ||",
      "translation": "But those who always worship Me with exclusive devotion, meditating on My transcendental form—to them I carry what they lack, and I preserve what they have.",
      "teaching": "Complete devotion to the divine brings divine protection and provision. God personally takes care of the needs of sincere devotees, handling both their spiritual and material welfare.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 926,
      "source": "Bhagavad Gita", 
      "chapter": "Chapter 9",
      "verse": "26",
      "sanskrit": "पत्रं पुष्पं फलं तोयं यो मे भक्त्या प्रयच्छति। तदहं भक्त्युपहृतमश्नामि प्रयतात्मनः॥",
      "transliteration": "patraṁ puṣpaṁ phalaṁ toyaṁ yo me bhaktyā prayacchati | tad ahaṁ bhakty-upahṛtam aśnāmi prayatātmanaḥ ||",
      "translation": "If one offers Me with love and devotion a leaf, a flower, fruit or water, I will accept it.",
      "teaching": "True devotion is not about elaborate offerings but the sincerity and love behind the gesture. God values the heart's offering over material wealth, making spirituality accessible to all.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 1041,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 10",
      "verse": "41",
      "sanskrit": "यद्यद्विभूतिमत्सत्त्वं श्रीमदूर्जितमेव वा। तत्तदेवावगच्छ त्वं मम तेजोऽंशसम्भवम्॥",
      "transliteration": "yad yad vibhūtimat sattvaṁ śrīmad ūrjitam eva vā | tat tad evāvagaccha tvaṁ mama tejo-'ṁśa-sambhavam ||",
      "translation": "Know that all opulent, beautiful and glorious creations spring from but a spark of My splendor.",
      "teaching": "Every magnificent manifestation in creation—whether in power, beauty, or excellence—is but a tiny reflection of the infinite divine glory. This verse teaches us to see the divine in all extraordinary expressions.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 1136,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "36",
      "sanskrit": "अर्जुन उवाच। स्थाने हृषीकेश तव प्रकीर्त्या जगत्प्रहृष्यत्यनुरज्यते च। रक्षांसि भीतानि दिशो द्रवन्ति सर्वे नमस्यन्ति च सिद्धसङ्घाः॥",
      "transliteration": "arjuna uvāca | sthāne hṛṣīkeśa tava prakīrtyā jagat prahṛṣyaty anurajyate ca | rakṣāṁsi bhītāni diśo dravanti sarve namasyanti ca siddha-saṅghāḥ ||",
      "translation": "Arjuna said: It is justly so, O Hrishikesha, that the world becomes joyful and is attracted by Your fame. The demons flee in fear to all directions, and all the groups of perfected souls offer You their respectful obeisances.",
      "teaching": "The cosmic form of God naturally evokes appropriate responses from all beings - devotees are attracted with joy, while negative forces flee in fear. This shows the universal recognition of divine authority.",
      "category": "devotion",
      "relevance": 85
    },
    {
      "id": 1154,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "54",
      "sanskrit": "भक्त्या त्वनन्यया शक्य अहमेवंविधोऽर्जुन। ज्ञातुं द्रष्टुं च तत्त्वेन प्रवेष्टुं च परन्तप॥",
      "transliteration": "bhaktyā tv ananyayā śakya aham evaṁ-vidho 'rjuna | jñātuṁ draṣṭuṁ ca tattvena praveṣṭuṁ ca parantapa ||",
      "translation": "My dear Arjuna, only by undivided devotional service can I be understood as I am, standing before you, and can thus be seen directly. Only in this way can you enter into the mysteries of My understanding.",
      "teaching": "The cosmic vision of God can only be truly understood and experienced through pure, undivided devotion. Intellectual understanding alone is insufficient for divine realization.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 1219,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 12",
      "verse": "19",
      "sanskrit": "तुल्यनिन्दास्तुतिर्मौनी सन्तुष्टो येन केनचित्। अनिकेतः स्थिरमतिर्भक्तिमान्मे प्रियो नरः॥",
      "transliteration": "tulya-nindā-stutir maunī santuṣṭo yena kenacit | aniketaḥ sthira-matir bhaktimān me priyo naraḥ ||",
      "translation": "One who is equal in honor and dishonor, who is steady, satisfied with anything, without a fixed residence, fixed in knowledge, and engaged in devotional service—such a person is very dear to Me.",
      "teaching": "The qualities of a true devotee include equanimity in praise and criticism, contentment with whatever comes, detachment from material possessions, and steady devotion regardless of circumstances.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 1334,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 13",
      "verse": "34",
      "sanskrit": "क्षेत्रक्षेत्रज्ञयोरेवमन्तरं ज्ञानचक्षुषा। भूतप्रकृतिमोक्षं च ये विदुर्यान्ति ते परम्॥",
      "transliteration": "kṣetra-kṣetrajñayor evam antaraṁ jñāna-cakṣuṣā | bhūta-prakṛti-mokṣaṁ ca ye vidur yānti te param ||",
      "translation": "Those who see with eyes of knowledge the difference between the field and the knower of the field, and can also understand the process of liberation from material nature, attain the Supreme.",
      "teaching": "True knowledge lies in understanding the distinction between the body (field) and the soul (knower of the field). This realization of our spiritual identity leads to liberation from material bondage.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 1426,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 14",
      "verse": "26",
      "sanskrit": "मां च योऽव्यभिचारेण भक्तियोगेन सेवते। स गुणान्समतीत्यैतान्ब्रह्मभूयाय कल्पते॥",
      "transliteration": "māṁ ca yo 'vyabhicāreṇa bhakti-yogena sevate | sa guṇān samatītyaitān brahma-bhūyāya kalpate ||",
      "translation": "One who engages in full devotional service, unfailing in all circumstances, at once transcends the modes of material nature and thus comes to the level of Brahman.",
      "teaching": "Unwavering devotional service transcends the three modes of material nature (goodness, passion, ignorance) and elevates one to the spiritual platform of Brahman realization.",
      "category": "devotion",
      "relevance": 95
    },
    {
      "id": 1515,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 15",
      "verse": "15",
      "sanskrit": "सर्वस्य चाहं हृदि सन्निविष्टो मत्तः स्मृतिर्ज्ञानमपोहनं च। वेदैश्च सर्वैरहमेव वेद्यो वेदान्तकृद्वेदविदेव चाहम्॥",
      "transliteration": "sarvasya cāhaṁ hṛdi sanniviṣṭo mattaḥ smṛtir jñānam apohanaṁ ca | vedaiś ca sarvair aham eva vedyo vedānta-kṛd veda-vid eva cāham ||",
      "translation": "I am seated in everyone's heart, and from Me come remembrance, knowledge and forgetfulness. By all the Vedas, I am to be known. Indeed, I am the compiler of Vedanta, and I am the knower of the Vedas.",
      "teaching": "The divine presence within all beings is the source of consciousness, memory, and knowledge. All spiritual knowledge ultimately leads to understanding this inner divine presence as our true guide.",
      "category": "spirituality", 
      "relevance": 95
    },
    {
      "id": 1621,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 16",
      "verse": "21",
      "sanskrit": "त्रिविधं नरकस्येदं द्वारं नाशनमात्मनः। कामः क्रोधस्तथा लोभस्तस्मादेतत्त्रयं त्यजेत्॥",
      "transliteration": "tri-vidhaṁ narakasyedaṁ dvāraṁ nāśanam ātmanaḥ | kāmaḥ krodhas tathā lobhas tasmād etat trayaṁ tyajet ||",
      "translation": "There are three gates leading to this hell—lust, anger and greed. Every sane man should give these up, for they lead to the degradation of the soul.",
      "teaching": "Lust, anger, and greed are the three primary enemies of spiritual progress. They are the gateways to spiritual destruction and must be consciously abandoned for inner peace and growth.",
      "category": "psychology",
      "relevance": 95
    },
    {
      "id": 1702,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 17",
      "verse": "2",
      "sanskrit": "श्रीभगवानुवाच। त्रिविधा भवति श्रद्धा देहिनां सा स्वभावजा। सात्त्विकी राजसी चैव तामसी चेति तां शृणु॥",
      "transliteration": "śrī-bhagavān uvāca | tri-vidhā bhavati śraddhā dehināṁ sā svabhāva-jā | sāttvikī rājasī caiva tāmasī ceti tāṁ śṛṇu ||",
      "translation": "The Supreme Personality of Godhead said: According to the modes of nature acquired by the embodied soul, one's faith can be of three kinds—in the mode of goodness, the mode of passion, or the mode of ignorance. Now hear about this.",
      "teaching": "Faith itself is influenced by the three modes of material nature. Understanding the quality of our faith helps us purify our consciousness and elevate our spiritual practice toward higher modes.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 1866,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 18",
      "verse": "66",
      "sanskrit": "सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज। अहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः॥",
      "transliteration": "sarva-dharmān parityajya mām ekaṁ śaraṇaṁ vraja | ahaṁ tvāṁ sarva-pāpebhyo mokṣayiṣyāmi mā śucaḥ ||",
      "translation": "Abandon all varieties of religion and just surrender unto Me. I shall deliver you from all sinful reactions. Do not fear.",
      "teaching": "The ultimate teaching of surrender and divine grace. Complete trust in the divine removes all fear and suffering, offering the simplest and most direct path to liberation.",
      "category": "surrender",
      "relevance": 98
    }
  ]
}