{
  "verses": [
    {
      "id": 101,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "1",
      "sanskrit": "धृतराष्ट्र उवाच। धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः। मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय॥",
      "transliteration": "dhṛtarāṣṭra uvāca | dharma-kṣetre kuru-kṣetre samavetā yuyutsavaḥ | māmakāḥ pāṇḍavāś caiva kim akurvata sañjaya ||",
      "translation": "Dhritarashtra said: O Sanjaya, after my sons and the sons of Pandu assembled in the place of pilgrimage at Kurukshetra, desiring to fight, what did they do?",
      "teaching": "The opening verse sets the stage for the great dialogue. Kurukshetra represents both the external battlefield and the internal field of dharma where the battle between good and evil takes place within each person.",
      "category": "dharma",
      "relevance": 75
    },
    {
      "id": 102,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "2",
      "sanskrit": "सञ्जय उवाच। दृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा। आचार्यमुपसङ्गम्य राजा वचनमब्रवीत्॥",
      "transliteration": "sañjaya uvāca | dṛṣṭvā tu pāṇḍavānīkaṁ vyūḍhaṁ duryodhanas tadā | ācāryam upasaṅgamya rājā vacanam abravīt ||",
      "translation": "Sanjaya said: O King, after looking over the army arranged in military formation by the sons of Pandu, King Duryodhana went to his teacher and spoke the following words.",
      "teaching": "This verse shows how in times of crisis, even the proud seek guidance from their teachers. It highlights the importance of seeking counsel from experienced mentors.",
      "category": "dharma",
      "relevance": 70
    },
    {
      "id": 103,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "3",
      "sanskrit": "पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम्। व्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता॥",
      "transliteration": "paśyaitāṁ pāṇḍu-putrāṇām ācārya mahatīṁ camūm | vyūḍhāṁ drupada-putreṇa tava śiṣyeṇa dhīmatā ||",
      "translation": "O my teacher, behold the great army of the sons of Pandu, so expertly arranged by your intelligent disciple Dhrishtadyumna, the son of Drupada.",
      "teaching": "Duryodhana acknowledges the skill of his enemies, showing that wisdom recognizes merit even in opponents. This teaches us to respect competence regardless of personal conflicts.",
      "category": "dharma",
      "relevance": 72
    },
    {
      "id": 147,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "47",
      "sanskrit": "एवमुक्त्वार्जुनः सङ्ख्ये रथोपस्थ उपाविशत्। विसृज्य सशरं चापं शोकसंविग्नमानसः॥",
      "transliteration": "evam uktvārjunaḥ saṅkhye rathopastha upāviśat | visṛjya sa-śaraṁ cāpaṁ śoka-saṁvigna-mānasaḥ ||",
      "translation": "Arjuna, having thus spoken on the battlefield, cast aside his bow and arrows and sat down on the chariot, his mind overwhelmed with grief.",
      "teaching": "This verse shows the climax of Arjuna's crisis. Sometimes we must reach the depths of confusion before we can receive divine guidance. It sets the stage for Krishna's teachings.",
      "category": "psychology",
      "relevance": 90
    },
    {
      "id": 201,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "1",
      "sanskrit": "सञ्जय उवाच। तं तथा कृपयाविष्टमश्रुपूर्णाकुलेक्षणम्। विषीदन्तमिदं वाक्यमुवाच मधुसूदनः॥",
      "transliteration": "sañjaya uvāca | taṁ tathā kṛpayāviṣṭam aśru-pūrṇākulekṣaṇam | viṣīdantam idaṁ vākyam uvāca madhusūdanaḥ ||",
      "translation": "Sanjaya said: Seeing Arjuna full of compassion, his mind depressed, his eyes full of tears, Madhusudana, Krishna, spoke the following words.",
      "teaching": "Krishna responds to Arjuna's emotional crisis with wisdom. This shows that divine guidance comes when we are most receptive, often in our moments of greatest need.",
      "category": "psychology",
      "relevance": 85
    },
    {
      "id": 202,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "2",
      "sanskrit": "श्रीभगवानुवाच। कुतस्त्वा कश्मलमिदं विषमे समुपस्थितम्। अनार्यजुष्टमस्वर्ग्यमकीर्तिकरमर्जुन॥",
      "transliteration": "śrī-bhagavān uvāca | kutas tvā kaśmalam idaṁ viṣame samupasthitam | anārya-juṣṭam asvargyam akīrti-karam arjuna ||",
      "translation": "The Supreme Personality of Godhead said: My dear Arjuna, how have these impurities come upon you? They are not at all befitting a man who knows the value of life. They lead not to higher planets but to infamy.",
      "teaching": "Krishna challenges Arjuna's despondency, calling it 'impurity' that doesn't befit a noble person. Sometimes we need direct confrontation with our weaknesses to move forward.",
      "category": "self-development",
      "relevance": 80
    },
    {
      "id": 203,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "3",
      "sanskrit": "क्लैब्यं मा स्म गमः पार्थ नैतत्त्वय्युपपद्यते। क्षुद्रं हृदयदौर्बल्यं त्यक्त्वोत्तिष्ठ परन्तप॥",
      "transliteration": "klaibyaṁ mā sma gamaḥ pārtha naitat tvayy upapadyate | kṣudraṁ hṛdaya-daurbalyaṁ tyaktvottiṣṭha parantapa ||",
      "translation": "O son of Pritha, do not yield to this degrading impotence. It does not become you. Give up such petty weakness of heart and arise, O chastiser of the enemy!",
      "teaching": "Krishna calls for courage and action over despair. True strength comes from rising above emotional weakness and taking appropriate action despite difficulties.",
      "category": "self-development",
      "relevance": 88
    },
    {
      "id": 211,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "11",
      "sanskrit": "अशोच्यानन्वशोचस्त्वं प्रज्ञावादांश्च भाषसे। गतासूनगतासूंश्च नानुशोचन्ति पण्डिताः॥",
      "transliteration": "aśocyān anvaśocas tvaṁ prajñā-vādāṁś ca bhāṣase | gatāsūn agatāsūṁś ca nānuśocanti paṇḍitāḥ ||",
      "translation": "While speaking learned words, you are mourning for what is not worthy of grief. Those who are wise lament neither for the living nor for the dead.",
      "teaching": "True wisdom transcends grief for the temporary body. The wise understand the eternal nature of the soul and don't lament what is merely a change of form.",
      "category": "spirituality",
      "relevance": 92
    },
    {
      "id": 212,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "12",
      "sanskrit": "न त्वेवाहं जातु नासं न त्वं नेमे जनाधिपाः। न चैव न भविष्यामः सर्वे वयमतः परम्॥",
      "transliteration": "na tv evāhaṁ jātu nāsaṁ na tvaṁ neme janādhipāḥ | na caiva na bhaviṣyāmaḥ sarve vayam ataḥ param ||",
      "translation": "Never was there a time when I did not exist, nor you, nor all these kings; nor in the future shall any of us cease to be.",
      "teaching": "The eternal existence of the soul is fundamental truth. Understanding our eternal nature removes fear of death and gives meaning to life beyond temporary circumstances.",
      "category": "spirituality",
      "relevance": 94
    },
    {
      "id": 213,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "13",
      "sanskrit": "देहिनोऽस्मिन्यथा देहे कौमारं यौवनं जरा। तथा देहान्तरप्राप्तिर्धीरस्तत्र न मुह्यति॥",
      "transliteration": "dehino 'smin yathā dehe kaumāraṁ yauvanaṁ jarā | tathā dehāntara-prāptir dhīras tatra na muhyati ||",
      "translation": "As the embodied soul continuously passes, in this body, from boyhood to youth to old age, the soul similarly passes into another body at death. A sober person is not bewildered by such a change.",
      "teaching": "Death is simply another change for the eternal soul, no different from the changes we accept in life from childhood to old age. The wise person understands this continuity.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 247,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "47",
      "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
      "transliteration": "karmaṇy evādhikāras te mā phaleṣu kadācana | mā karma-phala-hetur bhūr mā te saṅgo 'stv akarmaṇi ||",
      "translation": "You have a right to perform your prescribed duty, but not to the fruits of action. Never consider yourself the cause of the results of your activities, and never be attached to not doing your duty.",
      "teaching": "The principle of Nishkama Karma - performing duty without attachment to results. This is the foundation of karma yoga and leads to freedom from anxiety and ego.",
      "category": "karma-yoga",
      "relevance": 98
    },
    {
      "id": 248,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "48",
      "sanskrit": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥",
      "transliteration": "yoga-sthaḥ kuru karmāṇi saṅgaṁ tyaktvā dhanañjaya | siddhy-asiddhyoḥ samo bhūtvā samatvaṁ yoga ucyate ||",
      "translation": "Perform your duty equipoised, O Arjuna, abandoning all attachment to success or failure. Such equanimity is called yoga.",
      "teaching": "True yoga is maintaining mental equilibrium in success and failure. This balanced state of mind transforms work into spiritual practice and brings inner peace.",
      "category": "karma-yoga",
      "relevance": 96
    },
    {
      "id": 262,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "62",
      "sanskrit": "ध्यायतो विषयान्पुंसः सङ्गस्तेषूपजायते। सङ्गात्सञ्जायते कामः कामात्क्रोधोऽभिजायते॥",
      "transliteration": "dhyāyato viṣayān puṁsaḥ saṅgas teṣūpajāyate | saṅgāt sañjāyate kāmaḥ kāmāt krodho 'bhijāyate ||",
      "translation": "While contemplating the objects of the senses, a person develops attachment for them, and from such attachment lust develops, and from lust anger arises.",
      "teaching": "The psychology of desire shows how mental dwelling on sense objects creates a chain reaction leading to suffering. Awareness of this process helps us break free from destructive patterns.",
      "category": "psychology",
      "relevance": 90
    },
    {
      "id": 263,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "63",
      "sanskrit": "क्रोधाद्भवति सम्मोहः सम्मोहात्स्मृतिविभ्रमः। स्मृतिभ्रंशाद्बुद्धिनाशो बुद्धिनाशात्प्रणश्यति॥",
      "transliteration": "krodhād bhavati sammohaḥ sammohāt smṛti-vibhramaḥ | smṛti-bhraṁśād buddhi-nāśo buddhi-nāśāt praṇaśyati ||",
      "translation": "From anger, complete delusion arises, and from delusion bewilderment of memory. When memory is bewildered, intelligence is lost, and when intelligence is lost one falls down again into the material pool.",
      "teaching": "The complete chain of spiritual downfall: desire → anger → delusion → memory loss → destruction of intelligence → spiritual ruin. Understanding this helps us catch ourselves early in the process.",
      "category": "psychology",
      "relevance": 92
    },
    {
      "id": 270,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "70",
      "sanskrit": "आपूर्यमाणमचलप्रतिष्ठं समुद्रमापः प्रविशन्ति यद्वत्। तद्वत्कामा यं प्रविशन्ति सर्वे स शान्तिमाप्नोति न कामकामी॥",
      "transliteration": "āpūryamāṇam acala-pratiṣṭhaṁ samudram āpaḥ praviśanti yadvat | tadvat kāmā yaṁ praviśanti sarve sa śāntim āpnoti na kāma-kāmī ||",
      "translation": "A person who is not disturbed by the incessant flow of desires—that enter like rivers into the ocean, which is ever being filled but is always still—can alone achieve peace, and not the man who strives to satisfy such desires.",
      "teaching": "True peace comes from being like the ocean - remaining undisturbed despite the constant flow of desires. The peaceful person doesn't resist desires but remains unaffected by them.",
      "category": "self-development",
      "relevance": 93
    }
  ]
}
