{
  "verses": [
    {
      "id": 1,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "1",
      "sanskrit": "धृतराष्ट्र उवाच। धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः। मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय॥",
      "transliteration": "dhṛtarāṣṭra uvāca | dharma-kṣetre kuru-kṣetre samavetā yuyutsavaḥ | māmakāḥ pāṇḍavāś caiva kim akurvata sañjaya ||",
      "translation": "Dhritarashtra said: O Sanjaya, after my sons and the sons of Pandu assembled in the place of pilgrimage at Kurukshetra, desiring to fight, what did they do?",
      "teaching": "The opening verse sets the stage for the great dialogue. Kurukshetra represents both the external battlefield and the internal field of dharma where the battle between good and evil takes place within each person.",
      "category": "dharma",
      "relevance": 75
    },
    {
      "id": 2,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "2",
      "sanskrit": "सञ्जय उवाच। दृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा। आचार्यमुपसङ्गम्य राजा वचनमब्रवीत्॥",
      "transliteration": "sañjaya uvāca | dṛṣṭvā tu pāṇḍavānīkaṁ vyūḍhaṁ duryodhanas tadā | ācāryam upasaṅgamya rājā vacanam abravīt ||",
      "translation": "Sanjaya said: O King, after looking over the army arranged in military formation by the sons of Pandu, King Duryodhana went to his teacher and spoke the following words.",
      "teaching": "This verse shows how in times of crisis, even the proud seek guidance from their teachers. It highlights the importance of seeking counsel from experienced mentors.",
      "category": "dharma",
      "relevance": 70
    },
    {
      "id": 3,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "15",
      "sanskrit": "पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जयः। पौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदरः॥",
      "transliteration": "pāñcajanyaṁ hṛṣīkeśo devadattaṁ dhanañjayaḥ | pauṇḍraṁ dadhmau mahā-śaṅkhaṁ bhīma-karmā vṛkodaraḥ ||",
      "translation": "Lord Krishna blew His conchshell, called Panchajanya; Arjuna blew his, the Devadatta; and Bhima, the voracious eater and performer of herculean tasks, blew his terrific conchshell, called Paundra.",
      "teaching": "The divine preparations for the great battle of Kurukshetra symbolize the cosmic forces aligning for the establishment of dharma.",
      "category": "dharma",
      "relevance": 75
    },
    {
      "id": 4,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "28",
      "sanskrit": "अर्जुन उवाच। दृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम्। सीदन्ति मम गात्राणि मुखं च परिशुष्यति॥",
      "transliteration": "arjuna uvāca | dṛṣṭvemaṁ sva-janaṁ kṛṣṇa yuyutsuṁ samupasthitam | sīdanti mama gātrāṇi mukhaṁ ca pariśuṣyati ||",
      "translation": "Arjuna said: My dear Krishna, seeing my friends and relatives present before me in such a fighting spirit, I feel the limbs of my body quivering and my mouth drying up.",
      "teaching": "Arjuna's physical symptoms represent the natural human response to moral conflict. Even great warriors experience doubt when facing difficult ethical decisions.",
      "category": "psychology",
      "relevance": 85
    },
    {
      "id": 5,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 1",
      "verse": "47",
      "sanskrit": "एवमुक्त्वार्जुनः सङ्ख्ये रथोपस्थ उपाविशत्। विसृज्य सशरं चापं शोकसंविग्नमानसः॥",
      "transliteration": "evam uktvārjunaḥ saṅkhye rathopastha upāviśat | visṛjya sa-śaraṁ cāpaṁ śoka-saṁvigna-mānasaḥ ||",
      "translation": "Arjuna, having thus spoken on the battlefield, cast aside his bow and arrows and sat down on the chariot, his mind overwhelmed with grief.",
      "teaching": "This verse shows the climax of Arjuna's crisis. Sometimes we must reach the depths of confusion before we can receive divine guidance. It sets the stage for Krishna's teachings.",
      "category": "psychology",
      "relevance": 90
    },
    {
      "id": 6,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "11",
      "sanskrit": "अशोच्यानन्वशोचस्त्वं प्रज्ञावादांश्च भाषसे। गतासूनगतासूंश्च नानुशोचन्ति पण्डिताः॥",
      "transliteration": "aśocyān anvaśocas tvaṁ prajñā-vādāṁś ca bhāṣase | gatāsūn agatāsūṁś ca nānuśocanti paṇḍitāḥ ||",
      "translation": "While speaking learned words, you are mourning for what is not worthy of grief. Those who are wise lament neither for the living nor for the dead.",
      "teaching": "True wisdom transcends grief for the temporary body. The wise understand the eternal nature of the soul.",
      "category": "spirituality",
      "relevance": 87
    },
    {
      "id": 7,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "13",
      "sanskrit": "देहिनोऽस्मिन्यथा देहे कौमारं यौवनं जरा। तथा देहान्तरप्राप्तिर्धीरस्तत्र न मुह्यति॥",
      "transliteration": "dehino 'smin yathā dehe kaumāraṁ yauvanaṁ jarā | tathā dehāntara-prāptir dhīras tatra na muhyati ||",
      "translation": "As the embodied soul continuously passes, in this body, from boyhood to youth to old age, the soul similarly passes into another body at death. A sober person is not bewildered by such a change.",
      "teaching": "The soul is eternal and separate from the temporary body. Just as we don't grieve when a child becomes a youth, we shouldn't grieve when the soul changes bodies.",
      "category": "spirituality",
      "relevance": 92
    },
    {
      "id": 8,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "20",
      "sanskrit": "न जायते म्रियते वा कदाचिन्नायं भूत्वा भविता वा न भूयः। अजो नित्यः शाश्वतोऽयं पुराणो न हन्यते हन्यमाने शरीरे॥",
      "transliteration": "na jāyate mriyate vā kadācin nāyaṁ bhūtvā bhavitā vā na bhūyaḥ | ajo nityaḥ śāśvato 'yaṁ purāṇo na hanyate hanyamāne śarīre ||",
      "translation": "For the soul there is neither birth nor death. It is not slain when the body is slain.",
      "teaching": "The soul is eternal, unborn, undying, and primeval. This fundamental truth about our spiritual nature is the foundation for overcoming the fear of death.",
      "category": "spirituality",
      "relevance": 95
    },
    {
      "id": 9,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "22",
      "sanskrit": "वासांसि जीर्णानि यथा विहाय नवानि गृह्णाति नरोऽपराणि। तथा शरीराणि विहाय जीर्णान्यन्यानि संयाति नवानि देही॥",
      "transliteration": "vāsāṁsi jīrṇāni yathā vihāya navāni gṛhṇāti naro 'parāṇi | tathā śarīrāṇi vihāya jīrṇāny anyāni saṁyāti navāni dehī ||",
      "translation": "As a person puts on new garments, giving up old ones, the soul similarly accepts new material bodies, giving up the old and useless ones.",
      "teaching": "Death is merely changing clothes for the eternal soul. This beautiful analogy helps us understand that death is a natural transition, not an end.",
      "category": "spirituality",
      "relevance": 94
    },
    {
      "id": 10,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "47",
      "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
      "transliteration": "karmaṇy evādhikāras te mā phaleṣu kadācana | mā karma-phala-hetur bhūr mā te saṅgo 'stv akarmaṇi ||",
      "translation": "You have a right to perform your prescribed duty, but not to the fruits of action. Never consider yourself the cause of the results of your activities, and never be attached to not doing your duty.",
      "teaching": "The principle of Nishkama Karma - performing duty without attachment to results. This is the foundation of karma yoga.",
      "category": "karma-yoga",
      "relevance": 95
    },
    {
      "id": 11,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "48",
      "sanskrit": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥",
      "transliteration": "yoga-sthaḥ kuru karmāṇi saṅgaṁ tyaktvā dhanañjaya | siddhy-asiddhyoḥ samo bhūtvā samatvaṁ yoga ucyate ||",
      "translation": "Perform your duty equipoised, O Arjuna, abandoning all attachment to success or failure. Such equanimity is called yoga.",
      "teaching": "True yoga is maintaining mental equilibrium in success and failure. This balanced state of mind is the key to spiritual progress.",
      "category": "karma-yoga",
      "relevance": 93
    },
    {
      "id": 12,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "56",
      "sanskrit": "दुःखेष्वनुद्विग्नमनाः सुखेषु विगतस्पृहः। वीतरागभयक्रोधः स्थितधीर्मुनिरुच्यते॥",
      "transliteration": "duḥkheṣv anudvigna-manāḥ sukheṣu vigata-spṛhaḥ | vīta-rāga-bhaya-krodhaḥ sthita-dhīr munir ucyate ||",
      "translation": "One who is not disturbed in mind even amidst the threefold miseries or elated when there is happiness, and who is free from attachment, fear and anger, is called a sage of steady mind.",
      "teaching": "The characteristics of a self-realized person - equanimity in pleasure and pain, freedom from attachment, fear, and anger. This is the goal of spiritual practice.",
      "category": "self-development",
      "relevance": 91
    },
    {
      "id": 13,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "62-63",
      "sanskrit": "ध्यायतो विषयान्पुंसः सङ्गस्तेषूपजायते। सङ्गात्सञ्जायते कामः कामात्क्रोधोऽभिजायते॥ क्रोधाद्भवति सम्मोहः सम्मोहात्स्मृतिविभ्रमः।",
      "transliteration": "dhyāyato viṣayān puṁsaḥ saṅgas teṣūpajāyate | saṅgāt sañjāyate kāmaḥ kāmāt krodho 'bhijāyate || krodhād bhavati sammohaḥ sammohāt smṛti-vibhramaḥ |",
      "translation": "While contemplating the objects of the senses, a person develops attachment for them, and from such attachment lust develops, and from lust anger arises. From anger, complete delusion arises, and from delusion bewilderment of memory.",
      "teaching": "The psychology of desire and how it leads to suffering. Understanding this chain helps in breaking free from negative patterns.",
      "category": "psychology",
      "relevance": 85
    },
    {
      "id": 14,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "64",
      "sanskrit": "रागद्वेषवियुक्तैस्तु विषयानिन्द्रियैश्चरन्। आत्मवश्यैर्विधेयात्मा प्रसादमधिगच्छति॥",
      "transliteration": "rāga-dveṣa-viyuktais tu viṣayān indriyaiś caran | ātma-vaśyair vidheyātmā prasādam adhigacchati ||",
      "translation": "But a person who is not attached or aversive to sense objects, who controls the senses and is self-governed, attains tranquility.",
      "teaching": "The path to inner peace - engaging with the world while maintaining detachment from attractions and aversions. Self-control leads to tranquility.",
      "category": "self-development",
      "relevance": 88
    },
    {
      "id": 15,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 2",
      "verse": "70",
      "sanskrit": "आपूर्यमाणमचलप्रतिष्ठं समुद्रमापः प्रविशन्ति यद्वत्। तद्वत्कामा यं प्रविशन्ति सर्वे स शान्तिमाप्नोति न कामकामी॥",
      "transliteration": "āpūryamāṇam acala-pratiṣṭhaṁ samudram āpaḥ praviśanti yadvat | tadvat kāmā yaṁ praviśanti sarve sa śāntim āpnoti na kāma-kāmī ||",
      "translation": "A person who is not disturbed by the incessant flow of desires—that enter like rivers into the ocean, which is ever being filled but is always being still—can alone achieve peace, and not the man who strives to satisfy such desires.",
      "teaching": "Like the ocean remains undisturbed by rivers flowing into it, a peaceful person remains unaffected by desires. True peace comes from non-attachment, not from fulfilling desires.",
      "category": "self-development",
      "relevance": 90
    },
    {
      "id": 16,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 3",
      "verse": "42",
      "sanskrit": "इन्द्रियाणि पराण्याहुरिन्द्रियेभ्यः परं मनः। मनसस्तु परा बुद्धिर्यो बुद्धेः परतस्तु सः॥",
      "transliteration": "indriyāṇi parāṇy āhur indriyebhyaḥ paraṁ manaḥ | manasas tu parā buddhir yo buddheḥ paratas tu saḥ ||",
      "translation": "The working senses are superior to dull matter; mind is higher than the senses; intelligence is still higher than the mind; and the soul is even higher than the intelligence.",
      "teaching": "The hierarchy of consciousness - understanding the layers of our being from body to soul helps in self-realization.",
      "category": "self-development",
      "relevance": 90
    },
    {
      "id": 17,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 4",
      "verse": "7-8",
      "sanskrit": "यदा यदा हि धर्मस्य ग्लानिर्भवति भारत। अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥ परित्राणाय साधूनां विनाशाय च दुष्कृताम्। धर्मसंस्थापनार्थाय सम्भवामि युगे युगे॥",
      "transliteration": "yadā yadā hi dharmasya glānir bhavati bhārata | abhyutthānam adharmasya tadātmānaṁ sṛjāmy aham || paritrāṇāya sādhūnāṁ vināśāya ca duṣkṛtām | dharma-saṁsthāpanārthāya sambhavāmi yuge yuge ||",
      "translation": "Whenever righteousness declines and unrighteousness increases, O Arjuna, at that time I manifest myself on earth. To deliver the pious and to annihilate the miscreants, as well as to reestablish the principles of dharma, I appear millennium after millennium.",
      "teaching": "Divine intervention occurs when righteousness is threatened. This speaks to the cyclical nature of cosmic balance.",
      "category": "dharma",
      "relevance": 92
    },
    {
      "id": 18,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 4",
      "verse": "24",
      "sanskrit": "ब्रह्मार्पणं ब्रह्म हविर्ब्रह्माग्नौ ब्रह्मणा हुतम्। ब्रह्मैव तेन गन्तव्यं ब्रह्मकर्मसमाधिना॥",
      "transliteration": "brahmārpaṇaṁ brahma havir brahmāgnau brahmaṇā hutam | brahmaiva tena gantavyaṁ brahma-karma-samādhinā ||",
      "translation": "The act of offering is Brahman; the oblation is Brahman; by Brahman it is offered into the fire of Brahman. Brahman is that which is to be attained by him who performs action pertaining to Brahman.",
      "teaching": "The vision of the divine in all activities - seeing everything as sacred transforms ordinary work into spiritual practice.",
      "category": "spirituality",
      "relevance": 86
    },
    {
      "id": 19,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 5",
      "verse": "29",
      "sanskrit": "भोक्तारं यज्ञतपसां सर्वलोकमहेश्वरम्। सुहृदं सर्वभूतानां ज्ञात्वा मां शान्तिमृच्छति॥",
      "transliteration": "bhoktāraṁ yajña-tapasāṁ sarva-loka-maheśvaram | suhṛdaṁ sarva-bhūtānāṁ jñātvā māṁ śāntim ṛcchati ||",
      "translation": "A person in full consciousness of Me, knowing Me to be the ultimate beneficiary of all sacrifices and austerities, the Supreme Lord of all planets and demigods, and the benefactor and well-wisher of all living entities, attains peace from the pangs of material miseries.",
      "teaching": "Peace comes from understanding God as the ultimate beneficiary of all actions and the true friend of all beings.",
      "category": "devotion",
      "relevance": 84
    },
    {
      "id": 20,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 6",
      "verse": "5",
      "sanskrit": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥",
      "transliteration": "uddhared ātmanātmānaṁ nātmānam avasādayet | ātmaiva hy ātmano bandhur ātmaiva ripur ātmanaḥ ||",
      "translation": "One must deliver himself with the help of his mind, and not degrade himself. The mind is the friend of the conditioned soul, and his enemy as well.",
      "teaching": "Self-improvement and personal responsibility. The mind can be both our greatest ally and our greatest obstacle.",
      "category": "self-development",
      "relevance": 88
    },
    {
      "id": 21,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 6",
      "verse": "46",
      "sanskrit": "तपस्विभ्योऽधिको योगी ज्ञानिभ्योऽपि मतोऽधिकः। कर्मिभ्यश्चाधिको योगी तस्माद्योगी भवार्जुन॥",
      "transliteration": "tapasvibhyo 'dhiko yogī jñānibhyo 'pi mato 'dhikaḥ | karmibhyaś cādhiko yogī tasmād yogī bhavārjuna ||",
      "translation": "A yogi is greater than the ascetic, greater than the empiricist and greater than the fruitive worker. Therefore, O Arjuna, in all circumstances, be a yogi.",
      "teaching": "The path of yoga integrates all spiritual practices - devotion, knowledge, and action - making it the most complete path.",
      "category": "karma-yoga",
      "relevance": 83
    },
    {
      "id": 22,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 7",
      "verse": "14",
      "sanskrit": "दैवी ह्येषा गुणमयी मम माया दुरत्यया। मामेव ये प्रपद्यन्ते मायामेतां तरन्ति ते॥",
      "transliteration": "daivī hy eṣā guṇa-mayī mama māyā duratyayā | mām eva ye prapadyante māyām etāṁ taranti te ||",
      "translation": "This divine energy of Mine, consisting of the three modes of material nature, is difficult to overcome. But those who have surrendered unto Me can easily cross beyond it.",
      "teaching": "The illusory power of maya can only be transcended through surrender to the divine. Material nature is powerful but not insurmountable.",
      "category": "surrender",
      "relevance": 89
    },
    {
      "id": 23,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 8",
      "verse": "28",
      "sanskrit": "वेदेषु यज्ञेषु तपःसु चैव दानेषु यत्पुण्यफलं प्रदिष्टम्। अत्येति तत्सर्वमिदं विदित्वा योगी परं स्थानमुपैति चाद्यम्॥",
      "transliteration": "vedeṣu yajñeṣu tapaḥsu caiva dāneṣu yat puṇya-phalaṁ pradiṣṭam | atyeti tat sarvam idaṁ viditvā yogī paraṁ sthānam upaiti cādyam ||",
      "translation": "A person who accepts the path of devotional service is not bereft of the results derived from studying the Vedas, performing sacrifices, undergoing austerities, giving charity or pursuing philosophical and fruitive activities. Simply by performing devotional service, he attains all these, and at the end he reaches the supreme eternal abode.",
      "teaching": "The path of devotional service encompasses and transcends all other spiritual practices, leading to the highest destination.",
      "category": "devotion",
      "relevance": 81
    },
    {
      "id": 24,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 9",
      "verse": "22",
      "sanskrit": "अनन्याश्चिन्तयन्तो मां ये जनाः पर्युपासते। तेषां नित्याभियुक्तानां योगक्षेमं वहाम्यहम्॥",
      "transliteration": "ananyāś cintayanto māṁ ye janāḥ paryupāsate | teṣāṁ nityābhiyuktānāṁ yoga-kṣemaṁ vahāmy aham ||",
      "translation": "But those who always worship Me with exclusive devotion, meditating on My transcendental form—to them I carry what they lack, and I preserve what they have.",
      "teaching": "Complete devotion to the divine brings divine protection and provision. God personally takes care of the needs of sincere devotees.",
      "category": "devotion",
      "relevance": 88
    },
    {
      "id": 25,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 9",
      "verse": "26",
      "sanskrit": "पत्रं पुष्पं फलं तोयं यो मे भक्त्या प्रयच्छति। तदहं भक्त्युपहृतमश्नामि प्रयतात्मनः॥",
      "transliteration": "patraṁ puṣpaṁ phalaṁ toyaṁ yo me bhaktyā prayacchati | tad ahaṁ bhakty-upahṛtam aśnāmi prayatātmanaḥ ||",
      "translation": "If one offers Me with love and devotion a leaf, a flower, fruit or water, I will accept it.",
      "teaching": "True devotion is not about elaborate offerings but the sincerity and love behind the gesture.",
      "category": "devotion",
      "relevance": 82
    },
    {
      "id": 26,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 10",
      "verse": "41",
      "sanskrit": "यद्यद्विभूतिमत्सत्त्वं श्रीमदूर्जितमेव वा। तत्तदेवावगच्छ त्वं मम तेजोऽंशसम्भवम्॥",
      "transliteration": "yad yad vibhūtimat sattvaṁ śrīmad ūrjitam eva vā | tat tad evāvagaccha tvaṁ mama tejo-'ṁśa-sambhavam ||",
      "translation": "Know that all opulent, beautiful and glorious creations spring from but a spark of My splendor.",
      "teaching": "Every magnificent manifestation in creation—whether in power, beauty, or excellence—is but a tiny reflection of the infinite divine glory. This verse teaches us to see the divine in all extraordinary expressions.",
      "category": "spirituality",
      "relevance": 89
    },
    {
      "id": 27,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "36",
      "sanskrit": "अर्जुन उवाच। स्थाने हृषीकेश तव प्रकीर्त्या जगत्प्रहृष्यत्यनुरज्यते च। रक्षांसि भीतानि दिशो द्रवन्ति सर्वे नमस्यन्ति च सिद्धसङ्घाः॥",
      "transliteration": "arjuna uvāca | sthāne hṛṣīkeśa tava prakīrtyā jagat prahṛṣyaty anurajyate ca | rakṣāṁsi bhītāni diśo dravanti sarve namasyanti ca siddha-saṅghāḥ ||",
      "translation": "Arjuna said: It is justly so, O Hrishikesha, that the world becomes joyful and is attracted by Your fame. The demons flee in fear to all directions, and all the groups of perfected souls offer You their respectful obeisances.",
      "teaching": "The cosmic form of God naturally evokes appropriate responses from all beings - devotees are attracted with joy, while negative forces flee in fear. This shows the universal recognition of divine authority.",
      "category": "devotion",
      "relevance": 85
    },
    {
      "id": 28,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "37",
      "sanskrit": "कस्माच्च ते न नमेरन्महात्मन् गरीयसे ब्रह्मणोऽप्यादिकर्त्रे। अनन्त देवेश जगन्निवास त्वमक्षरं सदसत्तत्परं यत्॥",
      "transliteration": "kasmāc ca te na nameran mahātman garīyase brahmaṇo 'py ādi-kartre | ananta deveśa jagan-nivāsa tvam akṣaraṁ sad-asat tat-paraṁ yat ||",
      "translation": "O great one, why should they not offer their homages to You, who are greater than Brahma and the original creator? O infinite one, Lord of the gods, refuge of the universe! You are the imperishable, the transcendental, beyond both the manifest and unmanifest.",
      "teaching": "Recognition of the Supreme as the source of all existence, including Brahma the creator. The divine transcends all categories of being and non-being.",
      "category": "spirituality",
      "relevance": 88
    },
    {
      "id": 29,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "38",
      "sanskrit": "त्वमादिदेवः पुरुषः पुराणस्त्वमस्य विश्वस्य परं निधानम्। वेत्तासि वेद्यं च परं च धाम त्वया ततं विश्वमनन्तरूप॥",
      "transliteration": "tvam ādi-devaḥ puruṣaḥ purāṇas tvam asya viśvasya paraṁ nidhānam | vettāsi vedyaṁ ca paraṁ ca dhāma tvayā tataṁ viśvam ananta-rūpa ||",
      "translation": "You are the original God, the ancient personality. You are the ultimate sanctuary of this universe. You are the knower, the knowable, and the supreme abode. O limitless form, the whole cosmic manifestation is pervaded by You.",
      "teaching": "The divine is simultaneously the knower, the known, and the process of knowing. God is both the source and the substance of all existence.",
      "category": "spirituality",
      "relevance": 90
    },
    {
      "id": 30,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "39",
      "sanskrit": "वायुर्यमोऽग्निर्वरुणः शशाङ्कः प्रजापतिस्त्वं प्रपितामहश्च। नमो नमस्तेऽस्तु सहस्रकृत्वः पुनश्च भूयोऽपि नमो नमस्ते॥",
      "transliteration": "vāyur yamo 'gnir varuṇaḥ śaśāṅkaḥ prajāpatis tvaṁ prapitāmahaś ca | namo namas te 'stu sahasra-kṛtvaḥ punaś ca bhūyo 'pi namo namas te ||",
      "translation": "You are Vayu (the wind god), Yama (death), Agni (fire), Varuna (water), the moon, Prajapati (the creator), and the great-grandfather. I offer my respectful obeisances unto You a thousand times, and again and yet again!",
      "teaching": "The divine manifests through all natural forces and cosmic principles. Recognition of God in all aspects of nature leads to continuous gratitude and worship.",
      "category": "devotion",
      "relevance": 84
    },
    {
      "id": 31,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "40",
      "sanskrit": "नमः पुरस्तादथ पृष्ठतस्ते नमोऽस्तु ते सर्वत एव सर्व। अनन्तवीर्यामितविक्रमस्त्वं सर्वं समाप्नोषि ततोऽसि सर्वः॥",
      "transliteration": "namaḥ purastād atha pṛṣṭhatas te namo 'stu te sarvata eva sarva | ananta-vīryāmita-vikramas tvaṁ sarvaṁ samāpnoṣi tato 'si sarvaḥ ||",
      "translation": "Obeisances to You from the front, from behind and from all sides! O unbounded power, You are the master of limitless might! You pervade all that exists, and therefore You are all!",
      "teaching": "The omnipresence of God means that reverence should be offered in all directions and at all times. The divine infinite power encompasses and becomes everything.",
      "category": "devotion",
      "relevance": 86
    },
    {
      "id": 32,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "41-42",
      "sanskrit": "सखेति मत्वा प्रसभं यदुक्तं हे कृष्ण हे यादव हे सखेति। अजानता महिमानं तवेदं मया प्रमादात्प्रणयेन वापि॥ यच्चावहासार्थमसत्कृतोऽसि विहारशय्यासनभोजनेषु। एकोऽथवाप्यच्युत तत्समक्षं तत्क्षामये त्वामहमप्रमेयम्॥",
      "transliteration": "sakheti matvā prasabhaṁ yad uktaṁ he kṛṣṇa he yādava he sakheti | ajānatā mahimānaṁ tavedaṁ mayā pramādāt praṇayena vāpi || yac cāvahāsārtham asatkṛto 'si vihāra-śayyāsana-bhojaneṣu | eko 'thavāpy acyuta tat-samakṣaṁ tat kṣāmaye tvām aham aprameyam ||",
      "translation": "Thinking of You as my friend, I have rashly addressed You 'O Krishna,' 'O Yadava,' 'O my friend,' not knowing Your glories. Please forgive whatever I may have done in madness or in love. I have dishonored You many times, jesting as we relaxed, lay on the same bed, or sat or ate together, either alone or with friends. In all these times, O infallible one, please forgive me for my offenses.",
      "teaching": "Even intimate relationships with the divine require proper reverence. Familiarity should not breed contempt but rather deepen our appreciation of divine grace that allows such closeness.",
      "category": "devotion",
      "relevance": 87
    },
    {
      "id": 33,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "43",
      "sanskrit": "पितासि लोकस्य चराचरस्य त्वमस्य पूज्यश्च गुरुर्गरीयान्। न त्वत्समोऽस्त्यभ्यधिकः कुतोऽन्यो लोकत्रयेऽप्यप्रतिमप्रभाव॥",
      "transliteration": "pitāsi lokasya carācarasya tvam asya pūjyaś ca gurur garīyān | na tvat-samo 'sty abhyadhikaḥ kuto 'nyo loka-traye 'py apratima-prabhāva ||",
      "translation": "You are the father of this complete cosmic manifestation, of the moving and the nonmoving. You are its worshipable chief, the supreme spiritual master. No one is greater than You, nor can anyone be one with You. O Lord of incomparable power, You are supreme within the three worlds.",
      "teaching": "God is the ultimate father, teacher, and authority of all existence. Recognition of this supreme position naturally leads to humility and surrender.",
      "category": "surrender",
      "relevance": 89
    },
    {
      "id": 34,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "44",
      "sanskrit": "तस्मात्प्रणम्य प्रणिधाय कायं प्रसादये त्वामहमीशमीड्यम्। पितेव पुत्रस्य सखेव सख्युः प्रियः प्रियायार्हसि देव सोढुम्॥",
      "transliteration": "tasmāt praṇamya praṇidhāya kāyaṁ prasādaye tvām aham īśam īḍyam | piteva putrasya sakheva sakhyuḥ priyaḥ priyāyārhasi deva soḍhum ||",
      "translation": "You are the Supreme Lord, to be worshiped by all. Thus I fall down to offer You my respectful obeisances and ask Your mercy. As a father tolerates the impudence of his son, or a friend tolerates the impertinence of a friend, or a wife tolerates the familiarity of her husband, please tolerate the wrongs I may have done You.",
      "teaching": "Divine mercy operates through various relationships - parental, friendship, and love. God tolerates our imperfections out of compassion, just as we do in our cherished relationships.",
      "category": "surrender",
      "relevance": 88
    },
    {
      "id": 35,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "45",
      "sanskrit": "अदृष्टपूर्वं हृषितोऽस्मि दृष्ट्वा भयेन च प्रव्यथितं मनो मे। तदेव मे दर्शय देव रूपं प्रसीद देवेश जगन्निवास॥",
      "transliteration": "adṛṣṭa-pūrvaṁ hṛṣito 'smi dṛṣṭvā bhayena ca pravyathitaṁ mano me | tad eva me darśaya deva rūpaṁ prasīda deveśa jagan-nivāsa ||",
      "translation": "I am delighted to have seen what I have never seen before, but I am also disturbed with fear. Therefore, please bestow Your grace upon me and reveal the form I am familiar with. O Lord of lords, O abode of the universe, please be gracious!",
      "teaching": "Even divine visions can be overwhelming to human consciousness. It is natural to seek comfort in familiar forms of the divine while being grateful for extraordinary experiences.",
      "category": "devotion",
      "relevance": 85
    },
    {
      "id": 36,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "46",
      "sanskrit": "किरीटिनं गदिनं चक्रहस्तमिच्छामि त्वां द्रष्टुमहं तथैव। तेनैव रूपेण चतुर्भुजेन सहस्रबाहो भव विश्वमूर्ते॥",
      "transliteration": "kirīṭinaṁ gadinaṁ cakra-hastam icchāmi tvāṁ draṣṭum ahaṁ tathaiva | tenaiva rūpeṇa catur-bhujena sahasra-bāho bhava viśva-mūrte ||",
      "translation": "I wish to see You in Your four-armed form, with helmeted head and with club, wheel, conch and lotus flower in Your hands. I long to see You in that form, O universal form, O thousand-armed one!",
      "teaching": "After witnessing the cosmic form, Arjuna seeks the familiar four-armed Vishnu form. This shows that while we may receive grand spiritual experiences, we often find comfort in more approachable divine manifestations.",
      "category": "devotion",
      "relevance": 83
    },
    {
      "id": 37,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 11",
      "verse": "54",
      "sanskrit": "भक्त्या त्वनन्यया शक्य अहमेवंविधोऽर्जुन। ज्ञातुं द्रष्टुं च तत्त्वेन प्रवेष्टुं च परन्तप॥",
      "transliteration": "bhaktyā tv ananyayā śakya aham evaṁ-vidho 'rjuna | jñātuṁ draṣṭuṁ ca tattvena praveṣṭuṁ ca parantapa ||",
      "translation": "My dear Arjuna, only by undivided devotional service can I be understood as I am, standing before you, and can thus be seen directly. Only in this way can you enter into the mysteries of My understanding.",
      "teaching": "The cosmic vision of God can only be truly understood and experienced through pure, undivided devotion. Intellectual understanding alone is insufficient.",
      "category": "devotion",
      "relevance": 92
    },
    {
      "id": 38,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 12",
      "verse": "13-14",
      "sanskrit": "अद्वेष्टा सर्वभूतानां मैत्रः करुण एव च। निर्ममो निरहङ्कारः समदुःखसुखः क्षमी॥",
      "transliteration": "adveṣṭā sarva-bhūtānāṁ maitraḥ karuṇa eva ca | nirmamo nirahaṅkāraḥ sama-duḥkha-sukhaḥ kṣamī ||",
      "translation": "One who is not envious but is a kind friend to all living entities, who does not think himself a proprietor and is free from false ego, who is equal in both happiness and distress, who is tolerant...",
      "teaching": "The qualities of a realized soul - compassion, humility, equanimity, and universal friendship.",
      "category": "devotion",
      "relevance": 78
    },
    {
      "id": 39,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 12",
      "verse": "19",
      "sanskrit": "तुल्यनिन्दास्तुतिर्मौनी सन्तुष्टो येन केनचित्। अनिकेतः स्थिरमतिर्भक्तिमान्मे प्रियो नरः॥",
      "transliteration": "tulya-nindā-stutir maunī santuṣṭo yena kenacit | aniketaḥ sthira-matir bhaktimān me priyo naraḥ ||",
      "translation": "One who is equal in honor and dishonor, who is steady, satisfied with anything, without a fixed residence, fixed in knowledge, and engaged in devotional service—such a person is very dear to Me.",
      "teaching": "The qualities of a true devotee include equanimity in praise and criticism, contentment with whatever comes, and steady devotion regardless of circumstances.",
      "category": "devotion",
      "relevance": 85
    },
    {
      "id": 40,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 13",
      "verse": "34",
      "sanskrit": "क्षेत्रक्षेत्रज्ञयोरेवमन्तरं ज्ञानचक्षुषा। भूतप्रकृतिमोक्षं च ये विदुर्यान्ति ते परम्॥",
      "transliteration": "kṣetra-kṣetrajñayor evam antaraṁ jñāna-cakṣuṣā | bhūta-prakṛti-mokṣaṁ ca ye vidur yānti te param ||",
      "translation": "Those who see with eyes of knowledge the difference between the field and the knower of the field, and can also understand the process of liberation from material nature, attain the Supreme.",
      "teaching": "True knowledge lies in understanding the distinction between the body (field) and the soul (knower of the field). This realization leads to liberation.",
      "category": "spirituality",
      "relevance": 88
    },
    {
      "id": 41,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 14",
      "verse": "26",
      "sanskrit": "मां च योऽव्यभिचारेण भक्तियोगेन सेवते। स गुणान्समतीत्यैतान्ब्रह्मभूयाय कल्पते॥",
      "transliteration": "māṁ ca yo 'vyabhicāreṇa bhakti-yogena sevate | sa guṇān samatītyaitān brahma-bhūyāya kalpate ||",
      "translation": "One who engages in full devotional service, unfailing in all circumstances, at once transcends the modes of material nature and thus comes to the level of Brahman.",
      "teaching": "Unwavering devotional service transcends the three modes of material nature (goodness, passion, ignorance) and elevates one to the spiritual platform.",
      "category": "devotion",
      "relevance": 90
    },
    {
      "id": 42,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 15",
      "verse": "7",
      "sanskrit": "ममैवांशो जीवलोके जीवभूतः सनातनः। मनःषष्ठानीन्द्रियाणि प्रकृतिस्थानि कर्षति॥",
      "transliteration": "mamaivāṁśo jīva-loke jīva-bhūtaḥ sanātanaḥ | manaḥ-ṣaṣṭhānīndriyāṇi prakṛti-sthāni karṣati ||",
      "translation": "The living entities in this conditioned world are My eternal fragmental parts. Due to conditioned life, they are struggling very hard with the six senses, which include the mind.",
      "teaching": "The eternal relationship between the individual soul and the divine. We are all connected at the deepest level.",
      "category": "spirituality",
      "relevance": 80
    },
    {
      "id": 43,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 15",
      "verse": "15",
      "sanskrit": "सर्वस्य चाहं हृदि सन्निविष्टो मत्तः स्मृतिर्ज्ञानमपोहनं च। वेदैश्च सर्वैरहमेव वेद्यो वेदान्तकृद्वेदविदेव चाहम्॥",
      "transliteration": "sarvasya cāhaṁ hṛdi sanniviṣṭo mattaḥ smṛtir jñānam apohanaṁ ca | vedaiś ca sarvair aham eva vedyo vedānta-kṛd veda-vid eva cāham ||",
      "translation": "I am seated in everyone's heart, and from Me come remembrance, knowledge and forgetfulness. By all the Vedas, I am to be known. Indeed, I am the compiler of Vedanta, and I am the knower of the Vedas.",
      "teaching": "The divine presence within all beings is the source of consciousness, memory, and knowledge. All spiritual knowledge ultimately leads to understanding this inner divine presence.",
      "category": "spirituality",
      "relevance": 91
    },
    {
      "id": 44,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 16",
      "verse": "21",
      "sanskrit": "त्रिविधं नरकस्येदं द्वारं नाशनमात्मनः। कामः क्रोधस्तथा लोभस्तस्मादेतत्त्रयं त्यजेत्॥",
      "transliteration": "tri-vidhaṁ narakasyedaṁ dvāraṁ nāśanam ātmanaḥ | kāmaḥ krodhas tathā lobhas tasmād etat trayaṁ tyajet ||",
      "translation": "There are three gates leading to this hell—lust, anger and greed. Every sane man should give these up, for they lead to the degradation of the soul.",
      "teaching": "Lust, anger, and greed are the three primary enemies of spiritual progress. They are the gateways to spiritual destruction and must be consciously abandoned.",
      "category": "psychology",
      "relevance": 87
    },
    {
      "id": 45,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 17",
      "verse": "2",
      "sanskrit": "श्रीभगवानुवाच। त्रिविधा भवति श्रद्धा देहिनां सा स्वभावजा। सात्त्विकी राजसी चैव तामसी चेति तां शृणु॥",
      "transliteration": "śrī-bhagavān uvāca | tri-vidhā bhavati śraddhā dehināṁ sā svabhāva-jā | sāttvikī rājasī caiva tāmasī ceti tāṁ śṛṇu ||",
      "translation": "The Supreme Personality of Godhead said: According to the modes of nature acquired by the embodied soul, one's faith can be of three kinds—in the mode of goodness, the mode of passion, or the mode of ignorance. Now hear about this.",
      "teaching": "Faith itself is influenced by the three modes of material nature. Understanding the quality of our faith helps us purify our consciousness and spiritual practice.",
      "category": "spirituality",
      "relevance": 84
    },
    {
      "id": 46,
      "source": "Bhagavad Gita",
      "chapter": "Chapter 18",
      "verse": "66",
      "sanskrit": "सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज। अहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः॥",
      "transliteration": "sarva-dharmān parityajya mām ekaṁ śaraṇaṁ vraja | ahaṁ tvāṁ sarva-pāpebhyo mokṣayiṣyāmi mā śucaḥ ||",
      "translation": "Abandon all varieties of religion and just surrender unto Me. I shall deliver you from all sinful reactions. Do not fear.",
      "teaching": "The ultimate teaching of surrender and divine grace. Complete trust in the divine removes all fear and suffering.",
      "category": "surrender",
      "relevance": 90
    }
  ]
}
